import 'dart:convert';

import 'package:dartz/dartz.dart';
import 'package:shared_preferences/shared_preferences.dart';

import '../../domain/entities/Setting.dart';
import '../models/HadithModel.dart';
import '../models/SettingModel.dart';
import '../models/ZikerModel.dart';

abstract class ZikerLocalDataSource {
  Future<List<ZikerResponse>> getZikerListWithoutPrayHaijOmra();

  Future<List<ZikerResponse>> getPrayZikerList();

  Future<List<ZikerResponse>> getHaijZikerList();

  Future<List<ZikerResponse>> getOmraZikerList();
}

class ZikerLocalDataSourceImpl implements ZikerLocalDataSource {
  // "\uFD41 \uFD42 \uFD43 \uFD44 \uFDFB \uFDFA \uFDFC \uFDFD",
  // scheherazade font

   final azkarIndexList = [
    ...[for (int i = 1; i <= 6; i++) i],
    7,///prays
    19,///Haij
    21,///Omra
    ...[for (int i = 41; i <= 78; i++) i],
  ];

   final prayIndexList = [for (int i = 8; i <= 18; i++) i];
   late final haijIndexList = [20,...[for (int i = 23; i <= 30; i++) i],37,38,39,40];
   final omraIndexList = [for (int i = 23; i <= 30; i++) i]+[for (int i = 31; i <= 36; i++) i];

  Future<List<ZikerResponse>> _getZikerList() {
    final listOfZikerModel = <ZikerResponse>[
      ZikerResponse(1, "أَذْكَارُ ما بعد الاسْتِيقَاظِ مِنَ النَّومِ", <HadithResponse>[
          HadithResponse(
            1,
            "يمسح آثار النوم عن وجهه بكفِّه ، وقراءة العشر الآيات الأخيرة من سورة آل عمران :﴿ إِنَّ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ وَاخْتِلَافِ اللَّيْلِ وَالنَّهَارِ لَآيَاتٍ لِأُولِي الْأَلْبَابِ * ..... الآيات.",
            "البخاري 4569",
            1,
            0,
          ),
          HadithResponse(
              2,
              " (( الحَمْدُ للَّهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا، وَإِلَيْهِ النُّشُورُ)) وإذا انتبه من الليل قال: (( لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لهُ الْمُلْكُ وَلَهُ الحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، سُبْحَانَ اللَّهِ، وَالحَمْدُ للَّهِ، وَلاَ إِلَهَ إِلاَّ اللَّهُ، وَاللَّهُ أَكبَرُ، وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ الْعَلِيِّ الْعَظِيمِ، رَبِّ اغْفرْلِي)) \n ",
              "البخاري 1154",
              1,
              0),
          HadithResponse(
              3,
              " الْحَمْدُ لِلَّهِ الَّذِي عَافَانِي فِي جَسَدِي، وَرَدَّ عَلَيَّ رُوحِي، وَأَذِنَ لِي بِذِكْره ",
              "الترمذي 3401",
              1,
              0),
        ],),
      ZikerResponse(2, "أَذْكَارُ الصباح", <HadithResponse>[
          HadithResponse(1, "قراءة الاخلاص والمعوذتين ",
              "أخرجه أبو داود (5082) \"يقال ثلاث مرات.\"", 3, 0),
          HadithResponse(
              2,
              "أصبحتُ أثني عليك حمدًا وأشهدُ أن لا إله إلا الله. ",
              "أخرجه النسائي (10406) \"يقال ثلاث مرات.\"",
              3,
              0),
          HadithResponse(
              3,
              "أصبَحنا على فطرة الإسلام، وكلمة الإخلاص، وسُنَّة نبيِّنا محمد صلى الله عليه وسلم وملَّة أبينا إبراهيم، حنيفًا مسلمًا وما كان من المشركين. ",
              "أخرجه أحمد (15360)، الدارمي (2730) \"يقال مرة واحدة\"",
              1,
              0),
          HadithResponse(
              4,
              "اللهمَّ بك أصبَحنا، وبك أمسَينا، وبك نَحيا، وبك نموت، وإليك النشور. ",
              " أخرجه أبو داود (5068)، وابن حِبَّان (965) \"يقال مرة واحدة\"",
              1,
              0),
          HadithResponse(
              5,
              "أصبَحنا وأصبَح المُلك لله، والحمد لله، لا إله إلا الله وحْده لا شريكَ له، له المُلك وله الحمد، وهو على كلِّ شيءٍ قدير، ربِّ أسألك خيرَ ما في هذا اليوم، وخيرَ ما بعده، وأعوذ بك من شرِّ هذا اليوم، وشرِّ ما بعده، ربِّ أعوذ بك من الكسل وسُوء الكِبَر، ربِّ أعوذ بك من عذابٍ في النار وعذابٍ في القبر. ",
              "أخرَجه مسلم (2723) \"يقال مرة واحدة\"",
              1,
              0),
          HadithResponse(
              6,
              "لا إله إلا الله وحْده لا شريكَ له، له المُلك وله الحمد، وهو على كلِّ شيءٍ قدير. ",
              "\"يقال عشرات مرات ، أو مرة واحدة عند الكسل ، ومائة مرة في اليوم\" أخرَجه أبو داود (5077)، والنسائي في اليوم والليلة (27)",
              100,
              0),
          HadithResponse(
              7,
              "اللهم فاطِرَ السماواتِ والأرضِ ، عالِمَ الغيبِ والشهادةِ ، ربَّ كلِّ شئٍ ومليكَهُ ، أشهد أن لا إله إلا أنت ، أعوذ بك من شرِّ نفسى ، ومن شرِّ الشيطانِ وشركه، وأن أقترف على نفسي سوءا، أو أجره إلى مسلم. ",
              " أخرَجه أبو داود (5067)، والترمذي (3529) \"يقال مرة واحدة\"",
              1,
              0),
          HadithResponse(
              8,
              "اللهم إنى أسألك العافية فى الدنيا والآخرة ، اللهم إنى أسألك العفو والعافية فى دينى ، ودنياى ، وأهلى ، ومالى ، اللهم استر عَوْراتى ، وآمِن رَوْعاتي ، اللهم احفظنى من بين يدَىَّ ، ومن خلفى ، وعن يمينى ، وعن شمالى ، ومن فوقى ، وأعوذ بعظمتك أن أُغْتَالَ من تحتى. ",
              "أخرَجه أبو داود (5074)، وابن ماجه (387) \"يقال مرة واحدة\"",
              1,
              0),
          HadithResponse(
              9,
              "اللهم إني أسألُك علمًا نافعًا ، ورزقًا طيبًا ، وعملًا متقبلًا. ",
              "أخرجه ابن ماجه (٩٢٥) \"يقال مرة واحدة\"",
              1,
              0),
          HadithResponse(10, "سبحان الله وبحمده. ",
              "أخرَجه مسلم (2692)\"يقال مائة مرة.\"", 100, 0),
          HadithResponse(
              11,
              "يا حي يا قيُّوم، برحمتك أستغيث، أصلِح لي شأني كلَّه، ولا تَكلني إلى نفسي طرْفة عين. ",
              "أخرَجه النسائي في اليوم والليلة (570) \"يقال مرة واحدة\" ",
              1,
              0),
          HadithResponse(
              12,
              "اللهم أنت ربى لا إله إلا أنت خلقتنى وأنا عبدُكَ وأنا على عهدِكَ ووعدِكَ ما استطعتُ ، أعوذ بك من شرِّ ما صنعتُ ، أبوءُ لكَ بنعمتكَ علىَّ ، وأبوءُ لك بذنبى ؛ فاغفر لى ، فإنه لا يغفرُ الذنوب إلا أنت. ",
              "أخرَجه البخاري (6323) \"يقال مرة واحدة\"",
              1,
              0),
          HadithResponse(
              13,
              "بسم الله الذى لا يضرُّ مع اسمه شئٌ فى الأرضِ ولا فى السماءِ وهو السميعُ العليم. ",
              "أخرجه أبو داود (٥٠٨٨) ، الترمذي ( ٢٣٨٨ ) \"يقال ثلاث مرات\"",
              3,
              0),
          HadithResponse(
              14,
              "سبحان الله وبحمده عدد خلقه ، ورضا نفْسِهِ ، وزِنَةَ عرشه ، ومداد كلماته. ",
              "أخرجه مسلم (2726) \"يقال ثلاث مرات\"",
              3,
              0),
          HadithResponse(
              15,
              "رضيتُ بالله ربًّا، وبالإسلام دينًا، وبمحمدٍ صلى الله عليه وسلم نبيًّا. ",
              "أخرجه أبو داود (5072) \"يقال ثلاث مرات\"",
              3,
              0),
          HadithResponse(
              16,
              "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لَا إِلَهَ إِلَّا أَنْت.َ ",
              "أخرجه أبو داود (5090)، أحمد (20430)، بإسناد يحسن بالمتابعات والشواهد. \"يقال ثلاث مرات\"",
              3,
              0),
          HadithResponse(
              17,
              "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لَا إِلَهَ إِلَّا أَنْتَ. ",
              "أخرجه أبو داود (5090)، أحمد (20430)، بإسناد يحسن بالمتابعات والشواهد. \"يقال ثلاث مرات\"",
              3,
              0),
        ],),
      ZikerResponse(3, "الاذكار والدعوات دبر الصلواتَ المكتوبات", [
          HadithResponse(
              1,
              "الله أكبر، الله أكبر، الله أكبر \n" +
                  " (( مع رفع الصوت قليلا )) ",
              "رواه البخاري (842) ، مسلم (583) ",
              1,
              0),
          HadithResponse(
              2,
              "أستغفرُ اللهَ ثلاثًا، اللهمَّ أنتَ السَّلامُ، ومنك السَّلامُ، تبارَكْتَ يا ذا الجلالِ والإكرامِ. ",
              "رواه مسلم (591) ",
              1,
              0),
          HadithResponse(3, "قراءةُ المُعوِّذاتِ (الإخلاصِ والفلقِ والنَّاسِ) ",
              "رواه أبو داود (1523)، وغيره. ", 1, 0),
          HadithResponse(
              4,
              "لا إلهَ إلَّا اللهُ وحده لا شريكَ له، له المُلكُ وله الحمدُ، وهو على كلِّ شيءٍ قديرٌ، اللهمَّ لا مانعَ لِما أعطَيْتَ، ولا مُعطِيَ لِما منَعْتَ، ولا ينفَعُ ذا الجَدِّ منك الجَدُّ.«مع رفع الصوت» ",
              "رواه البخاري (844)، ومسلم (593) ",
              1,
              0),
          HadithResponse(
              5,
              "لا إلهَ إلَّا اللهُ وحدَه لا شريكَ له، له المُلكُ وله الحمدُ، وهو على كلِّ شيءٍ قديرٌ، لا حولَ ولا قوَّةَ إلَّا باللهِ، لا إلهَ إلَّا اللهُ، ولا نعبُدُ إلَّا إيَّاهُ، له النِّعمةُ وله الفضلُ، وله الثَّناءُ الحَسَنُ، لا إلهَ إلَّا اللهُ مُخلِصينَ له الدِّينَ ولو كرِهَ الكافرونَ.«مع رفع الصوت» ",
              "رواه مسلم (594) ",
              1,
              0),
          HadithResponse(6, "ربِّ قِنِي عذابَك يومَ تبعَثُ عِبادَكَ. ",
              "رواه مسلم (709) ", 1, 0),
          HadithResponse(
              7,
              "اللهمَّ أعِنِّي على ذِكرِكَ وشُكرِكَ وحُسْنِ عبادتِكَ. ",
              "رواه أبو داود (1522)، وغيره. ",
              1,
              0),
          HadithResponse(
              8,
              "اللهم إنى أسألك فِعلَ الخيرات وتَرْكَ المنكرات وحُبَّ المساكين وإذا أردتَ بعبادك فتنةً فاقبضني إليك غير مفتون. ",
              "رواه الترمذي (3233) ",
              1,
              0),
          HadithResponse(
              9,
              "التسبيح وصفاته أربعة:\n١- سُبحانَ اللهِ عشْرَ مرَّاتٍ، والحمدُ للهِ عشْرَ مرَّاتٍ، واللهُ أكبَرْ عشْرَ مرَّاتٍ.\nرواه البخاري ( 6329 )، ومسلم ( 595 )\nأو :\n٢- سُبحانَ اللهِ خَمْسًا وعشرينَ مرَّةً، والحمدُ للهِ خَمْسًا وعشرينَ مرَّةً، واللهُ أكبَرْ خَمْسًا وعشرينَ مرَّةً، ولا إلهَ إلَّا اللهُ خَمْسًا وعشرينَ مرَّةً.\nرواه الترمذي ( 3413 )، وغيره.\nأو :\n٣- سُبحانَ اللهِ ثلاثًا وثلاثينَ مرَّةً، والحمدُ للهِ ثلاثًا وثلاثينَ مرَّةً، واللهُ أكبَرُ أربعًا وثلاثيَن مرَّةً.\nرواه مسلم ( 596 )\nأو : \n٤- سُبحانَ اللهِ ثلاثًا وثلاثينَ، والحمدُ للهِ ثلاثًا وثلاثينَ، واللهُ أكبَرُ ثلاثًا وثلاثينَ، ولا إلهَ إلَّا اللهُ وحدَه لا شريكَ له، له المُلكُ وله الحمدُ، وهو على كلِّ شيءٍ قديرٌ، مرَّةً تمامَ المائةِ.\nرواه مسلم ( 597 )\nفائدة:\nوله الجمعُ بينها فيقولُ: سُبحانَ اللهِ والحمدُ للهِ واللهُ أكبَرُ، هكذا، ثلاثًا وثلاثينَ مرَّة\n\nًصفة العَقْدِ بالأناملِ:\nيُسَنُّ أنْ يَعُدَّ التسبيحَ والتحميدَ والتكبيرَ بعقدِ أصابِعه،نصَّ على ذلك الحنابلةُ،وهو قولُ النَّوويُّ،وابنُ تيميَّة،وابنُ القيِّم،والشَّوكانيُّ، وابنُ بازٍ، وابنُ عُثَيْمين\nرواه أبو داود ( 1501 )، وغيره .",
              "",
              33,
              0),
          HadithResponse(
              10,
              "اللهمَّ اغفِرْ لي ما قدَّمْتُ وما أخَّرْتُ، وما أسرَرْتُ وما أعلَنْتُ، وما أسرَفْتُ وما أنت أعلَمُ به منِّي، أنتَ المُقدِّمُ وأنتَ المُؤخِّرُ، لا إلهَ إلَّا أنتَ. ",
              "رواه أبو داود (1509)، وغيره. ",
              1,
              0),
          HadithResponse(
              11,
              "اللهمَّ إني أعوذُ بك مِن الجُبْنِ، وأعوذُ بك مِن البُخلِ، وأعوذُ بك مِن أنْ أُرَدَّ إلى أرذَلِ العُمُرِ، وأعوذُ بك مِن فتنةِ الدُّنيا وعذابِ القبرِ. ",
              "رواه البخاري(6374) ",
              1,
              0),
        ],),
      ZikerResponse(4, "أَذْكَارُ المساء", [
          HadithResponse(1, "قراءة الاخلاص والمعوذتين ",
              "أخرجه أبو داود (5082) \"يقال ثلاث مرات\"", 3, 0),
          HadithResponse(
              2,
              "اللهمَّ بك أمسَينا، وبك أصبَحنا، وبك نَحيا وبك نموت، وإليك المصير. ",
              " أخرجه أبو داود (5068)، وابن حِبَّان (965) \"يقال مرة واحدة\"",
              1,
              0),
          HadithResponse(
              3,
              "أمسَينا وأمسى المُلك لله، والحمد لله، لا إله إلا الله وحْده لا شريك له، له المُلك وله الحمد، وهو على كلِّ شيءٍ قدير، ربِّ أسألك خيرَ ما في هذه الليلة وخيرَ ما بعدها، وأعوذ بك من شرِّ ما في هذه الليلة وشرِّ ما بعدها، ربِّ أعوذ بك من الكسل وسوء الكِبَر، ربِّ أعوذ بك من عذابٍ في النار وعذابٍ في القبر. ",
              "أخرَجه مسلم (2723) \"يقال مرة واحدة\"",
              1,
              0),
          HadithResponse(
              4,
              "لا إله إلا الله وحْده لا شريكَ له، له المُلك وله الحمد، وهو على كلِّ شيءٍ قدير. ",
              "\"يقال عشرات مرات ، أو مرة واحدة عند الكسل ، ومائة مرة في اليوم\" أخرَجه أبو داود (5077)، والنسائي في اليوم والليلة (27)",
              100,
              0),
          HadithResponse(
              5,
              "اللهم فاطِرَ السماواتِ والأرضِ ، عالِمَ الغيبِ والشهادةِ ، ربَّ كلِّ شئٍ ومليكَهُ ، أشهد أن لا إله إلا أنت ، أعوذ بك من شرِّ نفسى ، ومن شرِّ الشيطانِ وشركه، وأن أقترف على نفسي سوءا، أو أجره إلى مسلم. ",
              " أخرَجه أبو داود (5067)، والترمذي (3529) \"يقال مرة واحدة\"",
              1,
              0),
          HadithResponse(
              6,
              "أمسينا على فطرة الإسلام، وكلمة الإخلاص، وسُّنة نبيِّنا محمد صلى الله عليه وسلم وملَّة أبينا إبراهيم، حنيفًا مسلمًا وما كان من المشركين. ",
              " أخرَجه النسائي في اليوم والليلة (3)، والطبراني في الدعاء (293)، \"يقال مرة واحدة\"",
              1,
              0),
          HadithResponse(
              7,
              "اللهم إنى أسألك العافية فى الدنيا والآخرة ، اللهم إنى أسألك العفو والعافية فى دينى ، ودنياى ، وأهلى ، ومالى ، اللهم استر عَوْراتى ، وآمِن رَوْعاتي ، اللهم احفظنى من بين يدَىَّ ، ومن خلفى ، وعن يمينى ، وعن شمالى ، ومن فوقى ، وأعوذ بعظمتك أن أُغْتَالَ من تحتى. ",
              "أخرَجه أبو داود (5074)، وابن ماجه (387) \"يقال مرة واحدة\"",
              1,
              0),
          HadithResponse(8, "أعوذ بكلمات الله التامَّات من شرِّ ما خلَق. ",
              "أخرَجه مسلم (2709)، \"يقال ثلاث مرات\"", 3, 0),
          HadithResponse(9, "سبحان الله وبحمده ",
              "أخرَجه مسلم (2692)\"يقال مائة مرة\"", 100, 0),
          HadithResponse(
              10,
              "يا حي يا قيُّوم، برحمتك أستغيث، أصلِح لي شأني كلَّه، ولا تَكلني إلى نفسي طرْفة عين. ",
              "أخرَجه النسائي في اليوم والليلة (570) \"يقال مرة واحدة\" ",
              1,
              0),
          HadithResponse(
              11,
              "اللهم أنت ربى لا إله إلا أنت خلقتنى وأنا عبدُكَ وأنا على عهدِكَ ووعدِكَ ما استطعتُ ، أعوذ بك من شرِّ ما صنعتُ ، أبوءُ لكَ بنعمتكَ علىَّ ، وأبوءُ لك بذنبى ؛ فاغفر لى ، فإنه لا يغفرُ الذنوب إلا أنت. ",
              "أخرَجه البخاري (6323) \"يقال مرة واحدة\"",
              1,
              0),
          HadithResponse(
              12,
              "بسم الله الذى لا يضرُّ مع اسمه شئٌ فى الأرضِ ولا فى السماءِ وهو السميعُ العليم. ",
              "أخرجه أبو داود (٥٠٨٨) ، الترمذي ( ٢٣٨٨ ) \"يقال ثلاث مرات\"",
              3,
              0),
          HadithResponse(
              13,
              "رضيتُ بالله ربًّا، وبالإسلام دينًا، وبمحمدٍ صلى الله عليه وسلم نبيًّا. ",
              "أخرجه أبو داود (5072) \"يقال ثلاث مرات\"",
              3,
              0),
          HadithResponse(
              14,
              "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لَا إِلَهَ إِلَّا أَنْت.َ ",
              "أخرجه أبو داود (5090)، أحمد (20430)، بإسناد يحسن بالمتابعات والشواهد. \"يقال ثلاث مرات\"",
              3,
              0),
          HadithResponse(
              15,
              "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لَا إِلَهَ إِلَّا أَنْتَ. ",
              "أخرجه أبو داود (5090)، أحمد (20430)، بإسناد يحسن بالمتابعات والشواهد \"يقال ثلاث مرات\"",
              3,
              0),
        ],),
      ZikerResponse(5,"أَذْكَارُ ما قبل النَّومِ",[
          HadithResponse(
              1,
              "جمع الكفين والنفث فيهما مع قراءة ﴿ قُلْ هُوَ اللَّهُ أَحَدٌ ﴾ و﴿ قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ﴾ ، و﴿ قُلْ أَعُوذُ بِرَبِّ النَّاسِ ﴾ ، ثم يمسَح بهما ما استطاع من جسده، يبدأ بهما على رأسه ووجهه وما أقبل من جسده؛ يفعل ذلك ثلاث مرات. ",
              "«البخاري 5017» ",
              3,
              0),
          HadithResponse(2, "قراءة آية الكرسي. ", "«البخاري 2311» ", 1, 0),
          HadithResponse(
              3,
              "قراءة الآيتين من آخر سورة البقرة ، فمَن قرأ بهما من ليلة كَفَتاه. ",
              "«البخاري 5009» ",
              1,
              0),
          HadithResponse(4, "قراءة : (سورتي بني إسرائيل- الإسراء - والزمر) ",
              "«الترمذي 2920» ", 1, 0),
          HadithResponse(
              5,
              "قراءة : ﴿ قُلْ يَا أَيُّهَا الْكَافِرُونَ ﴾ ، ثمَّ نم على خاتمتها؛ فإنها براءة من الشِّرك) ",
              "«أبو داود 5055» ",
              1,
              0),
          HadithResponse(
              6,
              "قراءة : ﴿ الم * تَنْزِيلُ ﴾ السجدة، و﴿ تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ ﴾ ",
              "«الترمذي 2892» ",
              1,
              0),
          HadithResponse(
              7,
              "وضع اليد تحتَ الخد ثم يقول: (( اللهم باسمك أموت وأحيا)) ",
              "«البخاري 6324» ",
              1,
              0),
          HadithResponse(
              8,
              "الله أكبر؛ أربعًا وثلاثين، وسبحان الله؛ ثلاثًا وثلاثين، والحمد لله؛ ثلاثًا وثلاثين. ",
              "«البخاري 5362» ",
              34,
              0),
          HadithResponse(
              9,
              "قول : (اللهمَّ أسلمتُ نفسي إليك، ووجهتُ وجهي إليك، وفوضتُ أمري إليك، وألجأتُ ظهري إليك، رغبة ورهبة إليك، لا ملجأ ولا منجى منك إلا إليك، آمنتُ بكتابك الذي أنزلتَ ونبيك الذي أرسلتَ) ",
              "«البخاري 6311» ",
              1,
              0),
          HadithResponse(
              10,
              "ينفض فراشه بداخِلَةِ إزاره أو بصنفة ثوبه ثلاثَ مرات ، ويقول: باسمك ربِّي وضعتُ جنبي وبك أرفعه، إن أمسكتَ نفسي فارحمها، أو (فاغفر لها)، وإن أرسلتَها فاحفظها بما تحفظ به عبادَك الصالحين) ",
              " «البخاري 6320»",
              1,
              0),
          HadithResponse(
              11,
              "قول:(الحمد لله الذي أطعَمَنا وسقانا، وكفانا وآوانا، فكم ممن لا كافي له ولا مؤوي) ",
              "«مسلم 2715»",
              1,
              0),
          HadithResponse(
              12,
              "قول: (( الحمد لله الذي كفاني، وآواني، وأطعمني، وسقاني، والذي مَنَّ عليَّ فأفضل، والذي أعطاني فأجزل، الحمد لله على كلِّ حال، اللهم رب كل شيء ومليكه، وإله كل شيء، أعوذ بك من النار)) ",
              "«أخرجه أحمد 185/8»",
              1,
              0),
          HadithResponse(
              13,
              "قول: (( اللهمَّ فاطر السموات والأرض، عالم الغيب والشهادة، رب كل شيء ومليكه، أشهد أن لا إله إلا أنت، أعوذ بك من شرِّ نفسي وشر الشيطان وشركه))، قال: (( قلها إذا أصبحتَ، وإذا أمسيتَ، وإذا أخذتَ مضجعك)) ",
              "«أبو داود 5069» ",
              1,
              0),
          HadithResponse(
              14,
              "قول: (( اللهمَّ قِني عذابك يوم تجمع أو تبعث عبادك)) ",
              "«الترمذي 3398» ",
              1,
              0),
          HadithResponse(
              15,
              "قول: (( أعوذ بكلمات الله التامَّة، من غضبه وعقابه، ومن شرِّ عباده، ومن همزات الشياطين، وأن يحضرون)) ",
              "«ابن السني 238» ",
              1,
              0),
          HadithResponse(
              16,
              "قول: (( اللهم رب السموات ورب الأرض ورب العرش العظيم، ربَّنا وربَّ كل شيء، فالق الحب والنَّوى ومنزل التوراة والإنجيل والفرقان، أعوذ بك من شر كل شيء أنت آخذ بناصيته، اللهم أنت الأول فليس قبلك شيء، وأنت الآخِر فليس بعدك شيء، وأنت الظاهر فليس فوقك شيء، وأنت الباطِن فليس دونك شيء، اقضِ عنا الدين وأغننا من الفقر)) ",
              "«مسلم 2713» ",
              1,
              0),
          HadithResponse(
              17,
              "قول: (( بسم الله وضعتُ جنبي، اللهمَّ اغفر لي ذنبي، وأخسئ شيطاني، وفكَّ رهاني، واجعلني في الندى الأعلى)) ",
              "«أبو داود 5054» ",
              1,
              0),
          HadithResponse(
              18,
              "قول: (( اللهم خلقتَ نفسي وأنت توفاها، لك مماتها ومحياها، إن أحييتَها فاحفظها وإن أمتَّها فاغفر لها، اللهمَّ إني أسألك العافية))، فقال له رجل: أسمعتَ هذا من عمر؟ فقال: من خير مِن عمر؛ من رسول الله صلى الله عليه وآله وسلم.",
              "«مسلم 2712»",
              1,
              0),
          HadithResponse(
              19,
              "قول: (( الحمد لله الذي كفاني وآواني، الحمد لله الذي أطعمني وسقاني، الحمد لله الذي مَنَّ عليَّ وأفضلَ، اللهمَّ إنِّي أسألك بعزَّتك أنْ تُنَجِّيَني من النَّار؛ فقدْ حَمِدَ الله بجميع محامدِ الخلقِ كلِّهم))",
              "«أخرجه الحاكم 546،545/1»",
              1,
              0),
          HadithResponse(
              20,
              "قول: (( اللهمَّ فاطِر السموات والأرض، عالمَ الغيب والشهادة، أنت ربُّ كل شيء، والملائكة يشهدون أنك لا إله إلا أنت، فإنا نعوذ بك من شرِّ أنفسنا، ومن شر الشيطان الرجيم وشركه، وأن نقترف سوءًا على أنفسنا أو نجرَّه إلى مسلم)) ",
              "«أبو داود 5083» ",
              1,
              0),
          HadithResponse(
              21,
              "قول: (( اللهمَّ فاطر السماوات والأرض، عالم الغيب والشهادة، رب كل شيء، وإله كل شيء، أشهد أن لا إله إلا أنت، وحدك لا شريك لك، وأن محمدًا عبدك ورسولك، والملائكة يشهدون، اللهمَّ إني أعوذ بك من الشيطان وشركه، وأعوذ بك أن أقترف على نفسي إثمًا، أو أرده إلى مسلم)) ",
              "«الطبراني في المعجم الكبير 94/40/13» ",
              1,
              0),
        ],),
      ZikerResponse(6, "من جوامع الدعاء من الصحيحين", [
          HadithResponse(
              1,
              "اللهم اجعل في قلبي نورًا، وفي بصري نورًا، وفي سمعي نورًا، وعن يميني نورًا، وعن يساري نورًا، وفوقي نورًا، وتحتي نورًا، وأمامي نورًا، وخلفي نورًا، واجعل لي نورًا. ",
              "متفق عليه (البخاري 6316، مسلم 763)",
              1,
              0),
          HadithResponse(
              2,
              "اللَّهمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كثِيرًا، وَلا يَغْفِر الذُّنوبَ إِلَّا أَنْتَ، فَاغْفِر لي مغْفِرَةً مِن عِنْدِكَ، وَارحَمْني، إِنَّكَ أَنْتَ الْغَفور الرَّحِيم. ",
              "متفق عليه (البخاري 834، مسلم2705)",
              1,
              0),
          HadithResponse(
              3,
              "اللَّهمَّ اغْفِر لي خَطِيئَتي وجَهْلي، وإِسْرَافي في أَمْري، وما أَنْتَ أَعلَم بِهِ مِنِّي، اللَّهمَّ اغفِرْ لي جِدِّي وَهَزْلي، وَخَطَئي وَعمْدِي، وَكلُّ ذلِكَ عِنْدِي، اللَّهُمَّ اغْفِرْ لي مَا قَدَّمْتُ وَمَا أَخَّرْتُ، وَما أَسْررْتُ وَمَا أَعْلَنْتُ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، أَنْت المقَدِّمُ، وَأَنْتَ المُؤَخِّرُ، وَأَنْتَ عَلى كلِّ شَيْءٍ قَدِيرٌ.",
              "متفق عليه (البخاري 6398، مسلم 2719)",
              1,
              0),
          HadithResponse(
              4,
              "اللَّهُمَّ لَكَ أسْلَمْتُ، وبِكَ آمنْتُ، وعليكَ توَكَّلْتُ، وإلَيكَ أنَبْتُ، وبِكَ خاصَمْتُ، اللَّهُمَّ أعُوذُ بِعِزَّتِكَ، لا إلَه إلَّا أنْتَ أنْ تُضِلَّنِي، أنْت الْحيُّ الَّذي لا تمُوتُ، وَالْجِنُّ وَالإِنْسُ يمُوتُونَ.",
              "متفق عليه (البخاري 7383، مسلم 2717)",
              1,
              0),
          HadithResponse(
              5,
              "اللهُمَّ لك الحمد، أنت ربُّ السماوات والأرض، لك الحمد، أنت قيِّم السماوات والأرض ومَن فيهنَّ، لك الحمد أنت نور السماوات والأرض، قولك الحق، ووعدُك الحق، ولقاؤك حق، والجنة حق، والنار حق، والساعة حق، اللهُمَّ لك أسلمتُ، وبك آمنت، وعليك توكَّلت، وإليك أنبْتُ، وبك خاصمتُ، وإليك حاكمتُ؛ فاغفر لي ما قدَّمت وما أخَّرت، وأسررتُ وأعلنت، أنت إلهي لا إله لي غيرك.",
              "متفق عليه (البخاري 7385، مسلم769)",
              1,
              0),
          HadithResponse(
              6,
              "اللهُمَّ إني أعوذ بك من الكسل والهرَم، والمأثم والمغرَم، ومن فتنة القبر وعذابِ القبر، ومن فتنة النار وعذاب النار، ومن شرِّ فتنة الغِنى، وأعوذ بك من فتنة الفقر، وأعوذ بك من فتنة المسيح الدَّجَّال، اللهم اغسل عني خطايايَ بماء الثلج والبَرَد، ونقِّ قلبي من الخطايا كما نقَّيْتَ الثوب الأبيض من الدَّنَس، وباعِدْ بيني وبين خطاياي كما باعدتَ بين المشرق والمغرب.",
              "متفق عليه (البخاري 6368، مسلم 589)",
              1,
              0),
          HadithResponse(
              7,
              "عن النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وسَلَّم قَالَ: (( تَعَوَّذُوا بِاللَّهِ مِنْ جَهْدِ الْبَلاءِ، وَدَرَكِ الشَّقَاءِ، وَسُوءِ الْقَضَاءِ، وَشَماتَةِ الأَعْدَاءِ))",
              "متفق عليه (البخاري 6616، مسلم 2707)",
              1,
              0),
          HadithResponse(
              8,
              "اللهُمَّ إني أعوذُ بك من فتنة النار، ومن عذاب النار، وأعوذ بك من فتنة القبر، وأعوذ بك من عذاب القبر، وأعوذ بك من فتنة الغِنى، وأعوذ بك من فتنة الفقر، وأعوذ بك من فتنة المسيح الدَّجَّال.",
              "متفق عليه (البخاري 6376، مسلم 589)",
              1,
              0),
          HadithResponse(
              9,
              "كانَ أَكْثَرُ دُعَاءِ النبيِّ صَلَّى اللهُ عَلَيْهِ وسَلَّم: (( اللَّهُمَّ آتِنَا في الدُّنْيَا حَسَنَةً، وفي الآخِرةِ حَسنَةً، وَقِنَا عَذابَ النَّارِ))",
              "متفق عليه (البخاري 4522، مسلم 2690)",
              1,
              0),
          HadithResponse(
              10,
              "قَالَ النَّبِيُّ صلى الله عليه وسلم: (( لَا يَتَمَنَّيَنَّ أَحَدُكُمُ الْمَوْتَ مِنْ ضُرٍّ أَصَابَهُ، فَإِنْ كَانَ لَا بُدَّ فَاعِلًا فَلْيَقُلِ: اللَّهُمَّ أَحْيِنِي مَا كَانَتِ الْحَيَاةُ خَيْرًا لِي، وَتَوَفَّنِي إِذَا كَانَتِ الْوَفَاةُ خَيْرًا لِي))",
              "متفق عليه (البخاري 5671، مسلم 2680)",
              1,
              0),
          HadithResponse(
              11,
              "اللهُمَّ ربَّ الناس مُذهِبَ الباس، اشْفِ أنت الشافي، لا شافي إلا أنت، شفاءً لا يُغادر سقمًا.",
              "(البخاري 5742)",
              1,
              0),
          HadithResponse(
              12,
              "سيِّد الاستغفار أن تقول: (( اللهُمَّ أنت ربِّي، لا إله إلا أنت، خلقتني وأنا عبدك، وأنا على عهدك ووعدك ما استطعت، أعوذ بك من شَرِّ ما صنعت، أبوء لك بنعمتك عليَّ، وأبوء لك بذنبي، فاغفر لي، فإنه لا يغفر الذنوب إلا أنت))، قال: (( ومَنْ قالها من النهار موقِنًا بها، فمات من يومه قبل أن يُمْسي، فهو من أهل الجنة، ومَنْ قالَها مِنَ الليل وهو موقِن بها، فمات قبل أن يُصبِح، فهو من أهل الجنة))",
              "(البخاري 6306)",
              1,
              0),
          HadithResponse(
              13,
              "اللهُمَّ باعِدْ بيني وبين خطاياي كما باعدتَ بين المشرق والمغرب، اللهُمَّ نقِّني من خطاياي كما يُنقَّى الثوبُ الأبيضُ مِن الدَّنَس، اللهُمَّ اغسِلْني من خطاياي بالثلج والماء والبَرَد.",
              "متفق عليه (البخاري 744، مسلم 598)",
              1,
              0),
          HadithResponse(
              14,
              "اللهُمَّ أعوذ برضاك مِن سخَطِك، وبمعافاتك من عقوبتك، وأعوذ بك منك، لا أُحْصي ثناءً عليك، أنتَ كما أثنيت على نفسك.",
              "(مسلم 486)",
              1,
              0),
          HadithResponse(
              15, "ربِّ، قِني عذابَك يوم تبعثُ عبادَك.", "(مسلم 709)", 1, 0),
          HadithResponse(
              16,
              "أعوذ بكلماتِ اللهِ التامَّاتِ مِنْ شَرِّ ما خَلَق.",
              "(مسلم 2709)",
              1,
              0),
          HadithResponse(
              17,
              "أعوذُ باللهِ مِنَ الفِتَنِ؛ ما ظهَرَ منها وما بَطَن.",
              "(مسلم 2867)",
              1,
              0),
          HadithResponse(
              18,
              "اللهُمَّ ربَّ جبرائيل وميكائيل وإسرافيل، فاطر السموات والأرض، عالم الغيب والشهادة، أنت تحكم بين عبادك فيما كانوا فيه يختلفون، اهدِني لما اختُلِف فيه من الحقِّ بإذنك؛ إنك تهدي مَن تشاء إلى صراطٍ مستقيمٍ.",
              "(مسلم 770)",
              1,
              0),
          HadithResponse(
              19,
              "اللهُمَّ أنت الملك، لا إله إلا أنت، أنت ربي، وأنا عَبْدُك، ظلمتُ نفسي، واعترفت بذنبي، فاغفر لي ذنوبي جميعًا، إنه لا يغفر الذنوب إلا أنت، واهدِني لأحسن الأخلاق، لا يهدي لأحسنها إلا أنت، واصرِف عني سيِّئَها، لا يصرف عني سيئها إلا أنت، لبَّيْك وسعديك، والخير كلُّه في يديك، والشرُّ ليس إليك، أنا بكَ وإليك، تباركتَ وتعاليت، أستغفرك وأتوب إليك.",
              "(مسلم 771)",
              1,
              0),
          HadithResponse(
              20,
              "اللهُمَّ ربَّ السموات وربَّ الأرض وربَّ العرش العظيم، ربنا ورب كل شيءٍ، فالقَ الحَبِّ والنَّوى، ومنزلَ التوراة والإنجيل والفُرْقان، أعوذ بك من شرِّ كل شيءٍ أنت آخذٌ بناصيته.",
              "(مسلم 2713)",
              1,
              0),
          HadithResponse(
              21,
              "اللهُمَّ أنت الأوَّلُ فليس قبلك شيء، وأنت الآخِرُ فليس بعدك شيء، وأنت الظاهر فليس فوقك شيء، وأنت الباطن فليس دونك شيء؛ اقضِ عنا الدَّين، وأغنِنا من الفقر.",
              "(مسلم 2713)",
              1,
              0),
          HadithResponse(
              22,
              "اللهُمَّ مُنْزِلَ الكتاب، ومجرِيَ السحاب، وهازم الأحزاب، اهزمهم، وانصرنا عليهم.",
              "متفق عليه (البخاري 3025، مسلم 1742)",
              1,
              0),
          HadithResponse(
              23,
              "اللهُمَّ إني أعوذ بك من زوال نعمتك، وتحوُّل عافيتك، وفُجاءة نِقْمتك، وجميع سخَطك.",
              "(مسلم 2739)",
              1,
              0),
          HadithResponse(
              24,
              "اللهُمَّ إني أعوذ بك من شَرِّ ما عَمِلتُ، ومن شَرِّ ما لم أعمل.",
              "(مسلم 2716)",
              1,
              0),
          HadithResponse(25, "اللهُمَّ مُصرِّف القلوب، صرِّف قلوبنا على طاعتك.",
              "(مسلم 2654)", 1, 0),
          HadithResponse(
              26,
              "كان رسولُ اللَّه صلى الله عليه وسلم يُكْثِرُ أنْ يَقولَ قبْلَ أَنْ يَمُوتَ: (( سُبْحانَكَ اللَّهُمَّ وبِحْمدِكَ، أسْتَغْفِركَ وأتُوبُ إلَيْكَ))",
              "(مسلم 484)",
              1,
              0),
          HadithResponse(
              27,
              "قالَ رَسُولُ اللَّه صلى الله عليه وسلم: (( لأن أَقُولَ سبْحانَ اللَّهِ، وَالحَمْدُ للَّهِ، ولا إلَه إلَّا اللَّه، وَاللَّه أكْبرُ، أَحبُّ إليَّ مِمَّا طَلَعَت عليهِ الشَّمْسُ))",
              "(مسلم 2695)",
              1,
              0),
          HadithResponse(
              28,
              "جاءَ أَعْرَابي إلى رسُولِ اللَّه صلى الله عليه وسلم فقالَ: علِّمْني كَلامًا أَقُولُهُ، قالَ: (( قُل لا إله إلَّا اللَّه وحدَهُ لا شرِيكَ لهُ، اللَّه أَكْبَرُ كَبِيرًا، والحمْدُ للَّهِ كَثيرًا، وسُبْحانَ اللَّه ربِّ العالمِينَ، ولا حوْل وَلا قُوَّةَ إلَّا باللَّهِ العَزيز الحكيمِ))، قال: فَهؤلاء لِرَبِّي، فَما لي؟ قال: (( قُل: اللَّهُمَّ اغْفِرْ لي وارْحمني، واهْدِني، وارْزُقْني))",
              "(مسلم 2696)",
              1,
              0),
          HadithResponse(
              29,
              "َانَ الرَّجلُ إِذا أَسْلَمَ عَلَّمَهُ النَّبيُّ صلى الله عليه وسلم الصَّلاةَ، ثُمَّ أَمَرَهُ أَنْ يَدعُوَ بهَؤُلاءِ الكَلِمَاتِ: (( اللَّهُمَّ اغفِرْ لي، وَارْحمْني، واهْدِني، وعافِني، وارْزُقني))",
              "(مسلم 2697)",
              1,
              0),
          HadithResponse(
              30,
              "اللَّهُمَّ أَصْلِحْ لي دِيني الَّذي هُوَ عِصْمَةُ أَمْرِي، وأَصْلِحْ لِي دُنْيَايَ التي فِيهَا مَعَاشِي، وَأَصْلِحْ لي آخِرَتي الَّتي فِيها معادي، وَاجْعلِ الحيَاةَ زِيادَةً لي في كُلِّ خَيْرٍ، وَاجْعَلِ الموتَ راحَةً لي مِنْ كُلِّ شَرٍّ.",
              "(مسلم 2720)",
              1,
              0),
          HadithResponse(
              31,
              "عنْ عليٍّ رَضِيَ اللَّه عَنْهُ، قَالَ: قال لي رَسُولُ اللَّهِ صلى الله عليه وسلم: (( قُلْ: اللَّهُمَّ اهْدِني، وَسدِّدْني))\n وَفي رِوَايةٍ: (( اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدى، وَالسَّدَادَ))",
              "(مسلم 2725)",
              1,
              0),
          HadithResponse(
              32,
              "اللهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ العَجْزِ وَالكَسَلِ، والبُخْلِ وَالهَرم، وعَذَاب الْقَبْر، اللَّهُمَّ آتِ نَفْسِي تَقْوَاهَا، وَزَكِّهَا أَنْتَ خَيرُ مَنْ زَكَّاهَا، أَنْتَ ولِيُّهَا وَموْلاهَا، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عِلمٍ لا يَنْفَعُ، ومِنْ قَلْبٍ لا يخْشَعُ، وَمِنْ نَفْسٍ لا تَشبَعُ، ومِنْ دَعْوةٍ لا يُسْتجابُ لهَا.",
              "(مسلم 2722)",
              1,
              0),
          HadithResponse(
              33,
              "اللَّهُمَّ إِنِّـي أَعُوذُ بِكَ مِنَ الْعجْزِ والكَسَلِ وَالجُبْنِ وَالهَرَمِ، وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ عَذَابِ القبْرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ المَحْيا وَالمَمَاتِ.\nوفي رِوايةٍ: (( وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ))",
              "متفق عليه (البخاري 6369، مسلم 2706)",
              1,
              0),
          HadithResponse(
              34,
              "اللَّهُمَّ إِنِّي أَسْأَلُكَ الهُدَى، وَالتُّقَى، وَالعفَافَ، والغِنَى.",
              "(مسلم 2721)",
              1,
              0),
        ],),

      /// Prays
      ZikerResponse(7, 'ما كان يقرأ به ﷺ في الصلوات', []),
      ZikerResponse(8, 'ما كان يقرأ به ﷺ في صلاة الفجر', [
        HadithResponse(
          1,
          'كان يقرأ فيها ما بين الستين إلى المائة آية.(1) وكان يُطَوّل في الركعة الأولى، ويُقَصِّر في الثانية.(2)',
          '(1) متفق عليه: رواه الإمام البخاري (771)، ومسلم (647). عن أبي برزة الاسلمي \n' +
              '(2) عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ ، عَنْ أَبِيهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ فِي الظُّهْرِ فِي الْأُولَيَيْنِ بِأُمِّ الْكِتَابِ وَسُورَتَيْنِ، وَفِي الرَّكْعَتَيْنِ الْأُخْرَيَيْنِ بِأُمِّ الْكِتَابِ، وَيُسْمِعُنَا الْآيَةَ، وَيُطَوِّلُ فِي الرَّكْعَةِ الْأُولَى مَا لَا يُطَوِّلُ فِي الرَّكْعَةِ الثَّانِيَةِ، وَهَكَذَا فِي الْعَصْرِ، وَهَكَذَا فِي الصُّبْحِ.( متفق عليه )، البخاري برقم (776) ومسلم برقم (451)',
          1,
          0,
        ),
        HadithResponse(
            2,
            'سورة (المؤمنون)\n' +
                'عن عبد الله بن السائب \uFD41 قال: صلى لنا النبي ﷺ الصبح بمكة فاستفتح سورة «المؤمنين» حتى جاء ذكر موسى وهارون– أو ذكر عيسى– أخذت النبي ﷺ سعلةٌ فركع.(1)',
            '(1) رواه الامام مسلم برقم (455) والامام ابن ماجه برقم(820).',
            1,
            0,
            hasTitle: true),
        HadithResponse(
            3,
            'سورة (الروم)\n' +
                'عن شبيب أبي روح ، عن رجل من أصحاب النبي ﷺ عن النبي ﷺ، أنه صلى صلاة الصبح فقرأ الروم، فالتبس عليه، فلما صلى قال : " ما بال أقوام يصلون معنا، لا يحسنون الطهور، فإنما يلبس علينا القرآن أولئك.(1) ',
            '(1) حسن : رواه الامام أحمد برقم (15872 ،15873) والنسائي (947).',
            1,
            0,
            hasTitle: true),
        HadithResponse(
            4,
            'سورة (يس)\n' +
                'عن جابر بن سَمُرة \uFD41 أن النيي ﷺ كان يقرأ في الصبح بـ: {يس}.(1)',
            '(1) رواه الطبراني في " الأوسط "، ورجاله رجال " الصحيح ". كذا " المجمع " (2/119) . وقال الامام الالباني رحمه الله في صفة صلاة النبي ﷺ ( 2/440) : {وسنده جيد. هذا هو الذي استقر عليه الرأي أخيراً؛ خلافاً لما كنت ذكرته في " تمام المنة "(ص 180) وغيره؛ فليُعلم} .',
            1,
            0,
            hasTitle: true),
        HadithResponse(
            5,
            'سورة (الصافات)\n' +
                'عن ابن عمر \uFD44 قال: إن كان رسول الله صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ليأمرنا بالتخفيف، وإن كان لَيَؤُمُّنا بـ: {الصَّافَّات} قال يزيد :في الصبح.(1)',
            '(1) اسناده حسن ، أخرجه الامام أحمد برقم (4989) ، وأبو يعلى [5/42/5422]',
            1,
            0,
            hasTitle: true),
        HadithResponse(
            6,
            'سورة (ق)\n' +
                'عن قطبة بن مالك \uFD41 قال: صليت وصلى بنا رسول الله ﷺ فقرأ: {قَ وَالْقُرْآنِ الْمَجِيدِ} حتى قرأ : {وَالنّخْلَ بَاسِقَاتٍ ...}.(1) ' +
                '\n عن جابر بن سمرة \uFD41 أن النبي ﷺ كان يقرأ في الفجر بــ {قَ وَالْقُرْآنِ الْمَجِيدِ}، وَكَانَ صَلَاتُهُ بَعْدُ تَخْفِيفًا.(2)',
            '(1) رواه الامام مسلم برقم (457).' +
                '\n (2) رواه الامام مسلم في صحيحه برقم (458).',
            1,
            0,
            hasTitle: true),
        HadithResponse(
            7,
            'سورة (الطور)\n' +
                'عن أم سلمة \uFD42 قالت: إن رسول الله ﷺ «قال لها - لما شكت لـه - إذا أقيمت صلاة الصبح - فطوفي على بعيرك والناس يصلون» . وورد التصريح بالسورة التي كان يقرأ بها ﷺ في الصحيحين في رواية قالت: فطفت ورسول الله ﷺ حينئذ يصلي إلى جنب البيت وهو يقرأ: {وَالطّورِ * وَكِتَابٍ مّسْطُورٍ }. أخرجه البخاري ومسلم.(1)',
            '(1) رواه الامام البخاري برقم (1626). رواها الامام البخاري برقم (1619) والامام مسلم برقم (1276).',
            1,
            0,
            hasTitle: true),
        HadithResponse(
            8,
            'سورة (الواقعة)\n' +
                'وعنه قال: كان النبي ﷺ يصلي نحواً من صلاتكم، لكنه كان يخفف الصلاة، كان يقرأ في صلاة الفجر بالواقعة ونحوها من السور.(1) ',
            '(1) رواه ابن خزيمة في صحيحه برقم (530).',
            1,
            0,
            hasTitle: true),
        HadithResponse(
            9,
            'سورة( التكوير )\n' +
                'عن عمــرو بن حـــريث \uFD41 أنـه سمع النبـي ﷺ يقـــرأ في الفجـــر {وَاللّيْلِ إِذَا عَسْعَسَ}.(1) ',
            '(1) اخرجه الامام برقم مسلم (456) وأبو داود برقم (817)، والنسائي وصرح باسم السورة برقم (951)',
            1,
            0,
            hasTitle: true),
        HadithResponse(
            10,
            'سورة ( الزلزلة ) في الركعتين كلتيهما\n' +
                'عن رجل من جهينة أنه سمع النبي ﷺ يقرأ في الصبح {إِذَا زُلْزِلَتِ الأرْضُ زِلْزَالَهَا} في الركعتين كلتيهما فلا أدري: أنسي رسول الله - ﷺ - أم قرأ ذلك عمداً؟.(1) ',
            '(1) حسن : رواه الامام أبو داود برقم (816).',
            1,
            0,
            hasTitle: true),
        HadithResponse(
            11,
            'سورة (الفلق والناس) المعوذتين ، قرأ بهما مرة في السفر\n' +
                'عن عقبة بن عامر \uFD41 قال: كنت أقود برسول الله ﷺ ناقته في السفر، فقال لي: (يا عقبة ألا أعلمك خير سورتين قرئتا)؟ فعلَّمني: {قُلْ أَعُوذُ بِرَبّ الْفَلَقِ} و{قُلْ أَعُوذُ بِرَبّ النّاسِ} قال: فلم يرني سُررت بهما جداً، قال: فلما نزل لصلاة الصبح صلّى بهما صلاة الصبح للناس، فلما فرغ رسول الله ﷺ من الصلاة التفت إليَّ فقال: (يا عقبة كيف رأيت؟).(1) ',
            '(1) صحيح رواه الامام أبو داود في سننه برقم (1462 و 1463).',
            1,
            0,
            hasTitle: true),
      ]),
      ZikerResponse(9, 'ما كان يقرأ به ﷺ في صلاتي الظهر والعصر', [
        HadithResponse(
            1,
            ' كان يقرأ قدر سورة السجدة أو قدر ثلاثين آية، ويُطَوِّلُ في الأولى ما لا يُطَوِّل في الثانية(1)\n' +
                '- عن أبي سعيد الخدري \uFD41 قال: كنا نحزر قيام رسول الله ﷺ في الظهر والعصر فحزرنا قيامه في الركعتين الأوليين من الظهر قدر قراءة: { الم * تَنزِيلُ ...} - السجدة – وحَزَرْنا قيامه في الأخريين قدر النصف من ذلك. وحَزَرْنا قيامه في الركعتين الأوليين من العصر على قدر قيامه في الأخريين من الظهر. وفي الأخريين من العصر على النصف من ذلك. وفي رواية قدر ثلاثين آية.(2)\n' +
                '- عن أبي قتادة \uFD41 قال: كان النبي ﷺ «يقرأ في الركعتين الأوليين من صلاة الظهر بفاتحة الكتاب وسورتين، وكان يُطوِّلُ في الأولى ويقصر في الثانية، ويُسِمعُ الآية أحياناً وكان يقرأ في صلاة العصر بفاتحة الكتاب وسورتين وكان يُطوِّلُ في الأولى، وكان يُطوِّلُ في الركعة الأولى من صلاة الصبح ويقصر في الثانية».(3)',
            '(*)كانوا يعرفون قراءته في الظهر والعصر باضطراب لحيته - ، و" كان يسمعهم الآية أحياناً ، قال الحافظ (2/194) :" واستُدل به على جواز الجهر في السرية، وأنه لا سجود سهو على من فعل ذلك؛ خلافاً لمن قال ذلك من الحنفية وغيرهم، سواء قلنا: كان يفعل ذلك عمداً؛ لبيان الجواز، أو بغير قصد؛ للاستغراق في التدبر. \nوفيه حجة على من زعم أن الإسرار شرط لصحة الصلاة السرية.\nوقوله: (أحياناً) : يدل على تَكرر ذلك منه ".صفة الصلاة (2/465)' +
                '(1) قال الامام الالباني في صفة الصلاة : هو من حديث أبي قتادة - \uFD41 أن النبي ﷺ كان يقرأ في الظهر في الأوليين بـ: {أم الكتاب} وسورتين، وفي الركعتين الأخريين بـ: {أم الكتاب} ، ويُسْمِعُنا الآية [أحياناً] ، ويطول في الركعة الأولى ما لا يطول في الركعة الثانية، وهكذا في العصر، وهكذا في الصبح. أخرجه البخاري في " صحيحه " (2/193 - 194 و 207) وفي " جزئه " (24) ،ومسلم (2/37) ، وأبو داود (1/127 - 128) ، والنسائي (1/153) ، والدارمي (1/296) ،وابن ماجه (1/274 - 275) ، والطحاوي (1/131) مختصراً، والبيهقي (2/59 و 63و65 - 66 و 193 و 347 - 348) ، وأحمد (5/295 و 297 و 300 و 301 و 305 و 307و311 و 4/383) من طرق عن يحيى بن أبي كثير عن عبد الله بن أبي قتادة عن أبيه به.' +
                '\n(2) رواه الامام مسلم (452) وأبو داود (804) وابن خزيمة (509)' +
                '\n(3) البخاري (759) ومسلم (451) وأبو داود (798).',
            1,
            0,
            hasTitle: true),
        HadithResponse(
            2,
            'سورة ( الأعلى والغاشية )\n' +
                '- عن أنس بن مالك \uFD41 عن النبي \uFD41 أنهم كانوا يسمعون منه النغمة في الظهر بــ {سَبّحِ اسْمَ رَبّكَ الأعْلَىَ} و {هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ}.(1) ' +
                '\n عن عمران بن حصين \uFD41 أن رسول الله ﷺ صلّى الظهر، فجعل رجلٌ يقرأ بــ {سَبّحِ اسْمَ رَبّكَ الأعْلَىَ}. فلما انصرف قال: أيكم قرأ أو أيكم القارئ؟ فقال رجل: أنا فقال: فقد ظننت أن بعضكم خالجنيها – نازعني قرائتها(2) ',
            '(1) رواه الامام ابن خزيمة برقم (512).' + '\n(2) أخرجه مسلم (398).',
            1,
            0,
            hasTitle: true),
        HadithResponse(
            3,
            'سورة ( الأعلى والشمس )\n' +
                'عن جابر بن سمرة \uFD41 «أن النبي - ﷺ - كان يقرأ في الظهر بــ {سَبّحِ اسْمَ رَبّكَ الأعْلَىَ} ، وفيه {وَالشّمْسِ وَضُحَاهَا} ونحوها، ...(1) \n',
            '(1) صحيح : رواه الامام ابن خزيمة في صحيحه برقم (510).',
            1,
            0,
            hasTitle: true),
        HadithResponse(
            4,
            'سورة ( الانشقاق ) ' +
                '\nعن بريدة الأسلمي \uFD41 أن النبي ﷺ كان يقرأ في الظهر بــ {إِذَا السّمَآءُ انشَقّتْ} ونحوها.(1)',
            '(1) رواه الامام ابن خزيمة في صحيحة برقم (511).',
            1,
            0,
            hasTitle: true),
        HadithResponse(
            5,
            'سورة ( البروج والطارق )' +
                '\nعن جابر بن سمرة \uFD41 أن رسول الله ﷺ كان يقرأ في الظهر والعصر بـــ {وَالسّمَآءِ ذَاتِ الْبُرُوجِ}و{وَالسّمَآءِ وَالطّارِقِ}.(1)',
            '(1) صحيح: رواه الامام الترمذي برقم (307) ، والامام النسائي برقم (979)',
            1,
            0,
            hasTitle: true),
        HadithResponse(
            6,
            'سورة ( الليل )' +
                '\nعن جابر بن سمرة \uFD41 قال: كان رسول الله ﷺ يقرأ في الظهر بــ {وَالْلّيْلِ إِذَا يَغْشَىَ} وفي العصر نحو ذلك، وفي الصبح أطول من ذلك.(1) ',
            '(1) رواه الامام مسلم برقم (459) ، والامام أبو داود برقم (806).',
            1,
            0,
            hasTitle: true),
      ]),
      ZikerResponse(10, 'ما كان يقرأ به ﷺ في صلاة المغرب', [
        HadithResponse(
            1,
            'سورة ( الاعراف )' +
                '\n-عن مروان بن الحكم قال: قال لي زيد بن ثابت \uFD41 مالك تقرأ في المغرب بقصارٍ؟ وقد سمعتُ النبي ﷺ يقرأ بطُولى الطوليين(1) ' +
                '\n-عن عائشة \uFD42 أن رسول الله ﷺ قرأ في صلاة المغرب سورة الأعراف فرقها في ركعتين(2). ',
            '(1) رواه الامام البخاري برقم (764) وأبو داود برقم (812). وطولى الطولين الاعراف ' +
                '\n(2) صحيح : رواه الامام النسائي برقم (991). ذهب أبو داود في سننه إلى نسخ التطويل في المغرب، ودلل ابن دقيق باستمرار العمل على التخفيف. ورد ذلك الحافظ في الفتح .',
            1,
            0,
            hasTitle: true),
        HadithResponse(
            2,
            'سورة ( الأنفال )' +
                '\nعن أبي أيوب الانصاري رضي الله عنه:أن النبي ﷺ كان يقرأ في المغرب سورة {الأَنْفَال}(1). ',
            '(1) رواه الطبراني في " الكبير " {بسندٍ صحيح} ، ورجاله رجال " الصحيح ".',
            1,
            0,
            hasTitle: true),
        HadithResponse(
            3,
            'سورة ( محمد ﷺ)' +
                '\nعن ابن عمر \uFD44 أن النبي ﷺ قرأ بهم في المغرب بـ: {الَّذِينَ كَفَرُوا وَصَدُّوا عَن سَبِيلِ اللَّهِ}.(1)',
            '(1) أخرجه الطبراني في " الصغير " (ص 23) وفي " الكبير " أيضاً، والمقدسي في" المختارة " من طريق الحسين بن حُرَيث المَرْوَزي: ثنا أبو مُعاوية محمد بن خازِم: ثنا عبيد الله بن عمر عن نافع عنه: قال الالباني : وهذا سند صحيح على شرط الشيخين.',
            1,
            0,
            hasTitle: true),
        HadithResponse(
            4,
            'سورة ( الطور )' +
                '\n عن جبير بن مطعم \uFD41 قال: سمعت رسول الله ﷺ قرأ في المغرب بالطور.(1) ',
            '(1) متفق عليه : رواه الامام البخاري برقم (765) ، والامام مسلم برقم (463).',
            1,
            0,
            hasTitle: true),
        HadithResponse(
            5,
            'سورة ( المرسلات )' +
                '\nعن ابن عباس \uFD41 قال: إن أم الفضل سمعته وهو يقرأ:{وَالْمُرْسَلاَتِ عُرْفاً} فقالت: يا بني ، والله لقد ذكرتني بقراءتك هذه السورة إنها لآخر ما سمعتُ من رسول الله ﷺ يقرأ بها في المغرب.(1)',
            '(1) متفق عليه : رواه الامام البخاري برقم (763)، والامام مسلم برقم (462).',
            1,
            0,
            hasTitle: true),
        HadithResponse(
            6,
            'قصار المفصل(1) \n' +
                'عَنْ سُلَيْمَانَ بْنِ يَسَارٍ ، عَنْ أَبِي هُرَيْرَةَ \uFD41 قَالَ : مَا صَلَّيْتُ وَرَاءَ أَحَدٍ أَشْبَهَ صَلَاةً بِرَسُولِ اللَّهِ ﷺ مِنْ فُلَانٍ. قَالَ سُلَيْمَانُ : كَانَ يُطِيلُ الرَّكْعَتَيْنِ الْأُولَيَيْنِ مِنَ الظُّهْرِ، وَيُخَفِّفُ الْأُخْرَيَيْنِ، وَيُخَفِّفُ الْعَصْرَ، وَيَقْرَأُ فِي الْمَغْرِبِ بِقِصَارِ الْمُفَصَّلِ، وَيَقْرَأُ فِي الْعِشَاءِ بِوَسَطِ الْمُفَصَّلِ، وَيَقْرَأُ فِي الصُّبْحِ بِطُوَلِ الْمُفَصَّلِ(2).(3)',
            '(1) سمي بالمفصل لأمور لما قاله ابن مفلح في الآداب الشرعية (2/283) : "وفي تسميته بالمفصل للعلماء أربعة أقوال: أحدها: لفصل بعضه عن بعض. والثاني: لكثرة الفصل بينها ببسم الله الرحمن الرحيم. الثالث: لإحكامه. والرابع : لقلة المنسوخ فيه".وقال النووي في شرح مسلم (3/368): "وسمي مفصلاً لقصر سوره وقرب انفصال بعضهن من بعض" وقال السيوطي في الإتقان(1/222): "سمي بذلك لكثرة الفصول التي بين السور بالبسملة، وقيل: لقلة المنسوخ منه، ولهذا يسمى المحكم أيضاً". وهذا الذي ذكره السيوطي قد رواه البخاري برقم (5035). عن سعيد بن جبير قال: "إن الذي تدعونه المفصل هو المحكم قال: وقال ابن عباس: توفي رسول الله ﷺ وأنا ابن عشر سنين وقد قرأت المحكم". ثالثاً : قال السيوطي في الإتقان:(1/223)."فائدة: للمفصل طوال وأوساط وقصار. قال ابن معن: فطواله إلى «عمّ» وأوساطه منها إلى «الضحى» ومنها إلى آخر القرآن قصاره، وهذا أقرب ما قيل".' +
                '\n(2) صحيح : رواه الامام النسائي برقم (982)' +
                '\n3 قال ابن القيم في الزاد:" وأما المغرب فكان هديه فيها خلاف عمل الناس اليوم فإنه صلاها مرة بـ (الأعراف) فرقها في الركعتين ومرة بـ (الطور) ومرة بـ (المرسلات) . قال أبو عمر بن عبد البر: روي عن النبي صلى الله عليه و سلم أنه قرأ في المغرب بـ (المص) وأنه قرأ فيها بـ (الصافات) وأنه قرأ فيها بـ (حم الدخان) وأنه قرأ فيها بـ (سبح اسم ربك الأعلى) وأنه قرأ فيها بـ (التين والزيتون) وأنه قرأ فيها بـ (المعوذتين) وأنه قرأ فيها بـ (المرسلات) وأنه كان يقرأ فيها بقصار المفصل قال: وهى كلها آثار صحاح مشهورة انتهى (زاد المعاد:1/ 203). حتى إنهم كانوا إذا صلَّوا معه، وسلَّم بهم؛ انصرف أحدهم وإنه ليُبْصِرُ مَواقعَ نَبْلِه . متفق عليه عن رافع بن خَدِيج قال: كنا نصلي المغرب مع النبي ﷺ ، فينصرف أحدنا وإنه ليبصر مواقع نبله. أخرجه البخاري (559) ، ومسلم (637)',
            1,
            0,
            hasTitle: true),
        HadithResponse(
            7,
            'سورة ( التين) قرأ بها ﷺ في الركعة الثانية في سفر' +
                '\nعن البراء بن عازب \uFD41 قال: كنت مع رسول الله ﷺ في سفر، فقرأ في المغرب في الركعة الثانية بـ: {التِّينِ وَالزَّيْتُونِ}(1).',
            '(1) قال الالباني في صفته (2/475) : أخرجه الطيالسي (99) قال: ثنا شعبة عن عدي بن ثابت سمع البراء قال :كنت مع رسول الله صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ في سفر، فقرأ في المغرب في الركعة الثانية بـ: {التِّينِ وَالزَّيْتُونِ} .وهذا سند صحيح على شرط الشيخين.',
            1,
            0,
            hasTitle: true),
      ]),
      ZikerResponse(11, 'ما كان يقرأ به ﷺ في صلاة العشاء', [
        HadithResponse(
            1,
            'سورة ( الانشقاق )' +
                '\n عن أبي رافع قال: صليتُ مع أبي هريرة \uFD41 العتمة – أي العشاء - فقرأ: {إِذَا السّمَآءُ انشَقّتْ} فسجد فقلت: ما هذه؟ قال: سجدت بها خلف أبي القاسم ﷺ فلا أزال أسجد بها حتى ألقاه(1). ',
            '(1) متفق عليه : رواه الامام البخاري برقم (768) ومسلم برقم (578).',
            1,
            0,
            hasTitle: true),
        HadithResponse(
            2,
            'سورة ( الاعلى والشمس و الليل )' +
                '\nعن جابر بن عبد الله \uFD44 أن رسول الله ﷺ قال لمعاذ في صلاة العشاء: فلولا صليت بــ {سَبّحِ اسْمَ رَبّكَ الأعْلَىَ} و{وَالشّمْسِ وَضُحَاهَا} و {وَالْلّيْلِ إِذَا يَغْشَىَ} فإنه يصلي وراءك الكبير والضعيف وذو الحاجة» أخرجه البخاري ومسلم(1).',
            '(1) البخاري (705) ومسلم (465).',
            1,
            0,
            hasTitle: true),
        HadithResponse(
            3,
            'سورة ( التين )' +
                '\nعن البراء بن عازب \uFD41 أن النبي ﷺ كان في سفرٍ فقرأ في العشاء في إحدى الركعتين بــ «التين والزيتون»(1). ',
            '(1) متفق عليه : رواه الامام البخاري برقم (767) ومسلم برقم (464).',
            1,
            0,
            hasTitle: true),
      ]),
      ZikerResponse(12, 'ما كان يقرأ به ﷺ في صلاة الوتر', [
        HadithResponse(
            1,
            'سورة ( الأعلى و الكافرون و الإخلاص)' +
                '\nعن أبيّ بن كعب - \uFD41 - : أن رسول الله - ﷺ - كان يقرأ في الأولى بـــ{سَبّحِ اسْمَ رَبّكَ الأعْلَىَ}. وفي الثانية بـــ{قُلْ يَأَيّهَا الْكَافِرُونَ}. وفي الثالثة بــ{قُلْ هُوَ اللّهُ أَحَدٌ}. فإذا فرغ قال عند فراغه: (سبحان الملك القدوس) ثلاث مرات يطيل آخرهن.(1) ',
            '(1) رواه الامام النسائي برقم (1699) وبرقم (1702) بنحوه عن ابن عباس ) وابن ماجه (1171، 1172 بنحوه عن ابن عباس).',
            1,
            0,
            hasTitle: true),
      ]),
      ZikerResponse(13, 'ما كان يقرأ به ﷺ في فجر الجمعة', [
        HadithResponse(
            1,
            'سورة ( السجدة والانسان )(1) ' +
                '\nعن أبي هريرة \uFD41 قال:كان النبي ﷺ يقرأ في الجمعة في صلاة الفجر{ الم * تَنزِيلُ ...} السجدة و {هَلْ أَتَىَ عَلَى الإِنسَانِ ...}(2). ',
            '(1) قال الشيخ الامام عبد العزيز بن باز -رحمه الله تعالى-: هذه سنة ثابتة عن النبيﷺ «فيشرع للإمام قراءة هاتين السورتين في فجر الجمعة وإن كره ذلك بعض الجماعة لكسلهم» . فتاوى ابن باز (12/393) .' +
                '\n(2) متفق عليه : رواه الامام البخاري برقم (1068) ومسلم برقم(880) .',
            1,
            0,
            hasTitle: true),
      ]),
      ZikerResponse(14, 'ما كان يقرأ به ﷺ في ركعتي الفجـر', [
        HadithResponse(
            1,
            'سورة ( الكافرون و الإخلاص)' +
                '\nعن أبي هريرة \uFD41 أن رسول الله ﷺ قرأ في ركعتي الفجر {قُلْ يَأَيّهَا الْكَافِرُونَ} و{قُلْ هُوَ اللّهُ أَحَدٌ}.(1) ',
            '(1) رواه الامام مسلم برقم (726) وأبو داود (1256) والنسائي (945) وابن ماجه (1148) ',
            1,
            0,
            hasTitle: true),
        HadithResponse(
            2,
            '(آية من سورة البقرة وآية من سورة آل عمران)' +
                '\n- {قُولُوَاْ آمَنّا بِاللّهِ وَمَآ أُنْزِلَ إِلَيْنَا وَمَآ أُنزِلَ إِلَىَ إِبْرَاهِيمَ وَإِسْمَاعِيلَ وَإِسْحَاقَ وَيَعْقُوبَ وَالأسْبَاطِ وَمَآ أُوتِيَ مُوسَىَ وَعِيسَىَ وَمَا أُوتِيَ النّبِيّونَ مِن رّبّهِمْ لاَ نُفَرّقُ بَيْنَ أَحَدٍ مّنْهُمْ وَنَحْنُ لَهُ مُسْلِمُونَ} .البقرة(1) ' +
                '\n- {قُلْ يَأَهْلَ الْكِتَابِ تَعَالَوْاْ إِلَىَ كَلَمَةٍ سَوَآءٍ بَيْنَنَا وَبَيْنَكُمْ أَلاّ نَعْبُدَ إِلاّ اللّهَ وَلاَ نُشْرِكَ بِهِ شَيْئاً وَلاَ يَتّخِذَ بَعْضُنَا بَعْضاً أَرْبَاباً مّن دُونِ اللّهِ فَإِن تَوَلّوْاْ فَقُولُواْ اشْهَدُواْ بِأَنّا مُسْلِمُونَ} .آل عمران(2)' +
                '\n- عن ابن عباس \uFD41 قال: كان رسول الله ﷺ يقرأ في ركعتي الفجر { قُولُوَاْ آمَنّا بِاللّهِ وَمَآ أُنْزِلَ إِلَيْنَا } والتي في آل عمران { تَعَالَوْاْ إِلَىَ كَلَمَةٍ سَوَآءٍ بَيْنَنَا وَبَيْنَكُمْ }(3). ',
            '(1) البقرة ( 136)' +
                '\n(2) آل عمران ( 64).' +
                '\n(3) رواه الامام مسلم برقم(727) وأبو داود (1259) والنسائي (944) ',
            1,
            0,
            hasTitle: true),
      ]),
      ZikerResponse(15, 'ما كان يقرأ به ﷺ في صلاة الجمعة', [
        HadithResponse(
            1,
            'سورة (الجمعة والمنافقون)' +
                '\n عن ابن أبي رافع قال: استخلف مروان أبا هريرة - \uFD41 - على المدينة، وخرج إلى مكة فصلى لنا أبو هريرة الجمعة فقرأ بعد سورة الجمعة في الركعة الآخرة: {إِذَا جَآءَكَ الْمُنَافِقُونَ ...}، قال: فأدركت أبا هريرة \uFD41 حين انصرف فقلت له: إنك قرأت بسورتين كان علي بن أبي طالب \uFD41 يقرأ بهما بالكوفة. فقال أبو هريرة رضي الله عنه: إني سمعت رسول الله ﷺ يقرأ بهما يوم الجمعة(1). ',
            '(1) رواه الامام مسلم برقم (877) وأبو داود برقم (1124).',
            1,
            0,
            hasTitle: true),
        HadithResponse(
            2,
            'سورة ( الاعلى و الغاشية)' +
                '\n- عن النعمان بن بشير \uFD44 قال: كان رسول الله ﷺ يقرأ في العيدين وفي الجمعة بــ{سَبّحِ اسْمَ رَبّكَ الأعْلَىَ} و{هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ} قال: وإذا اجتمع العيد والجمعة في يوم واحد يقرأ بهما أيضاً في الصلاتين(1)). ' +
                '\n- وعن سمرة بن جندب \uFD41 أن رسول الله ﷺ كان يقرأ في صلاة الجمعة بــ{سَبّحِ اسْمَ رَبّكَ الأعْلَىَ}(2) و{هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ}.',
            '(1) رواه الامام مسلم برقم (878) وأبو داود (1122) وابن خزيمة (1441).' +
                '\n(2) صحيح : رواه الامام أبوداود (1125) وابن خزيمة (1441) .',
            1,
            0,
            hasTitle: true),
      ]),
      ZikerResponse(16, 'ما كان يقرأ به ﷺ في صلاة العيدين', [
        HadithResponse(
            1,
            'سورة ( ق و القمر)' +
                '\nعن أبي واقد الليثي \uFD41 كان يقرأ ﷺ فيهما (الفطر والأضحى) بــ{قَ وَالْقُرْآنِ الْمَجِيدِ} و{اقْتَرَبَتِ السّاعَةُ وَانشَقّ الْقَمَرُ}(1) .',
            '(1) رواه الامام مسلم (891) وأبو داود (1154) وابن خزيمة (1440).',
            1,
            0,
            hasTitle: true),
        HadithResponse(
            2,
            'سورة ( الاعلى و الغاشية)' +
                '\nعن النعمان بن بشير \uFD44 قال: كان رسول الله ﷺ يقرأ في العيدين وفي الجمعة بــ{سَبّحِ اسْمَ رَبّكَ الأعْلَىَ} و{هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ} قال: وإذا اجتمع العيد والجمعة في يوم واحد يقرأ بهما أيضاً في الصلاتين).(1) ',
            '(1) رواه الامام مسلم برقم (878) وأبو داود (1122) وابن خزيمة (1441).',
            1,
            0,
            hasTitle: true),
      ]),
      ZikerResponse(17, 'ما كان يقرأ به ﷺ صلاة الكسوف والخسوف', [
        HadithResponse(
            1,
            '- كان ﷺ يقرأ الفاتحة في كل ركعة وليس في القراءة بعدها في صلاة الكسوف أو الخسوف شيء محدد ، بل يقرأ فيها بما تيسر له من القرآن.(1)' +
                '\nوالمستحب أن يطيل القراءة في الصلاة على طول مدة الكسوف أو الخسوف ، وقد أطال النبي ﷺ القراءة في صلاة الكسوف ، حتى كان القيام الأول بنحو سورة البقرة ،حتى ينتهي من الصلاة وقد انجلت الشمس . ' +
                '\n- قال عبد الله بن عباس \uFD44 : (خَسَفَتْ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالنَّاسُ مَعَهُ فَقَامَ قِيَامًا طَوِيلًا نَحْوًا مِنْ سُورَةِ الْبَقَرَةِ...)(2) ' +
                '\n- قال الشيخ ابن عثيمين رحمه الله : "لم يعين ، سورة البقرة ، أو آل عمران ، أو النساء ، فالمهم أن تكون سورة طويلة ؛ لأن الذي جاء في الحديث أنها طويلة أي : يختار أطول ما يكون ، وقد سبق أن بعض الصحابة كان يسقط مغشيا عليه من طول القيام(3)" ',
            '(1) قال البهوتي رحمه الله: ومهما قرأ به من السور جاز لعدم تعين القراءة " انتهى من "كشاف القناع" (2/63).' +
                '\n(2) متفق عليه : رواه الامام البخاري برقم (993) ومسلم (1512)، قال الشيخ المباركفوري رحمه الله: " في الحديث دليل على مشروعية تطويل القيام بقراءة سورة طويلة في صلاة الكسوف، وهو مستحب عند الجميع.." انتهى من "مرعاة المفاتيح شرح مشكاة المصابيح " (5/136).' +
                '\n(3) انتهى من "الشرح الممتع" (5/184) ',
            1,
            0),
      ]),
      ZikerResponse(18, 'ما كان يقرأ به ﷺ في صلاة الاستسقاء', [
        HadithResponse(
            1,
            'سورة ( الاعلى و الغاشية)\n' +
                'عن عبدِ اللهِ بن عبَّاسٍ رَضِيَ اللهُ عنهما، قال: ((خرَج النبيُّ صلَّى اللهُ عليه وسلَّم متواضعًا، متبذِّلًا، متخشِّعًا، مترسِّلًا، متضرِّعًا، فصلَّى رَكعتينِ كما يُصلِّي في العيد(1) ، لم يخطُبْ خُطبتَكم هذه ))(2) ',
            '(*) صلاةُ الاستسقاءِ ركعتانِ، يُكبِّر في الأولى سَبعًا، وفي الثانية خمسًا، وهذا مذهبُ الشافعيَّة، والحَنابِلَة، وبه قال بعضُ السَّلفِ، واختاره داودُ الظاهريُّ، وابنُ باز, وابنُ عثيمين ، والسُّنَّةُ الجهرُ بالقِراءةِ في صلاةِ الاستسقاءِ، وهو مذهب الجمهورِ: المالِكيَّة، والشَّافعيَّة، والحَنابِلَة، وحُكِي الإجماعُ على ذلك لأدلَّة منها :أولًا: عن عبدِ اللهِ بنِ زيدٍ، قال: ((رأيتُ النبيَّ صلَّى اللهُ عليه وسلَّم يوم خرَج يَستسقي، قال: فحوَّلَ إلى الناسِ ظَهرَه واستقبل القِبلةَ، ثم حوَّل رِداءَه، ثمَّ صلَّى لنا رَكعتينِ جهَر فيهما بالقِراءةِ )) ثانيًا: أنَّ هذه صلاةٌ شُرِعتْ لها الخُطبةُ؛ فكان مِن سُنَّتها الجهرُ كالجُمُعةِ والعِيدينِ ' +
                '\n(1) يقرأ في الأولى بعد تكبيرة الإحرام: الفاتحة وسورة الأعلى، وفي الثانية: الفاتحة وسورة الغاشية، يجهر فيهما بالقراءة، قال ابن قدامة في "المغني": واختلفت الرواية في صفتها، فروي أنه يكبر فيهما كتكبير العيد سبعا في الأولى، وخمسا في الثانية، وهو قول سعيد بن المسيب، والشافعي.' +
                '\n(2) رواه أبو داود (1165)، والترمذي (558)، والنسائي (1521)، وابن ماجه (1266). قال الترمذيُّ: حسن صحيح. واحتجَّ به ابنُ حزم في ((المحلى)) (5/94)، وصحَّحه النوويُّ في ((المجموع)) (5/66)، وابن الملقِّن في ((البدر المنير)) (5/143)، وحسَّنه ابن حجر في ((نتائج الأفكار)) (1/476)، والألبانيُّ في ((صحيح ابن ماجه)) (1053).',
            1,
            0,
            hasTitle: true),
      ]),

      ///      Al Haij
      ZikerResponse(19, 'الحج', []),
      ZikerResponse(20, 'ملخص أعمال الحج', [
        HadithResponse(
            1,
            'للحج ثلاثة أوجه تعرف بالانساك ، وأفضل هذه الأنساك التمتع لقول النبي ﷺ ((« لَوِ اسْتَقْبَلْتُ مِنْ أَمْرِى مَا اسْتَدْبَرْتُ مَا أَهْدَيْتُ ، وَلَوْلاَ أَنَّ مَعِى الْهَدْىَ لأَحْلَلْتُ »(1) وهذه الأنساك هي : \n- التمتع : هو أن يحرم بالعمرة في أشهر الحج وهي شوال وذو القعدة والعشر الأولى من ذي الحجة ، ثم يحرم بالحج في ذلك العام وعليه هدي \n - القران : هو أن يحرم بالعمرة والحج معا ولا يتحلل منهما إلا يوم النحر ، أو يحرم بالعمرة ثم يدخل عليها الحج قبل الشروع في طوافها\n - الإفراد : هو أن يحرم بالحج وحده ثم يظل على إحرامه إلى أن يتحلل منه\nوالقارن والمفرد عملهما واحد إلا أن المفرد ليس عليه هدي.',
            '(1) متفق عليه',
            1,
            0)
      ]),

      /// AL omra + Al Haj
      ZikerResponse(21, 'العمرة', []),
      ZikerResponse(22, 'المرحلة الرابعة الخروج من طيبة والتوجه إلي مكة المكرمة وصفة العمرة', [
        HadithResponse(
            1,
            'أركان العمرة ثلاثة الإحرام والطواف والسعي والحلق أو التقصير واجب\nوالحلق أفضل في حق الرجال وبيانها كالتالي:-',
            '',
            1,
            0)
      ]),
      ZikerResponse(23, 'الوصول إلي الميقات - ميقات ذي الحليفة- والإحرام منه', [
        HadithResponse(
            1,
            'المواقيت خمس وقد حد النبي ﷺ حدودا لا يجوز للمحرم أن يتجاوزها دون إحرام\n- عَنِ ابْنِ عَبَّاسٍ قَالَ إِنَّ النَّبِىَّ ﷺ وَقَّتَ لأَهْلِ الْمَدِينَةِ ذَا الْحُلَيْفَةِ ، وَلأَهْلِ الشَّأْمِ الْجُحْفَةَ ، وَلأَهْلِ نَجْدٍ قَرْنَ الْمَنَازِلِ ، وَلأَهْلِ الْيَمَنِ يَلَمْلَمَ ، هُنَّ لَهُنَّ وَلِمَنْ أَتَى عَلَيْهِنَّ مِنْ غَيْرِهِنَّ ، مِمَّنْ أَرَادَ الْحَجَّ وَالْعُمْرَةَ ، وَمَنْ كَانَ دُونَ ذَلِكَ فَمِنْ حَيْثُ أَنْشَأَ ، حَتَّى أَهْلُ مَكَّةَ مِنْ مَكَّةَ .(1)',
            '(1) متفق عليه وعند مسلم عن أَبُي الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ - رضى الله عنهما - يُسْأَلُ عَنِ الْمُهَلِّ فَقَالَ سَمِعْتُ - أَحْسِبُهُ رَفَعَ إِلَى النَّبِىِّ -صلى الله عليه وسلم- - فَقَالَ « مُهَلُّ أَهْلِ الْمَدِينَةِ مِنْ ذِى الْحُلَيْفَةِ وَالطَّرِيقُ الآخَرُ الْجُحْفَةُ وَمُهَلُّ أَهْلِ الْعِرَاقِ مِنْ ذَاتِ عِرْقٍ وَمُهَلُّ أَهْلِ نَجْدٍ مِنْ قَرْنٍ وَمُهَلُّ أَهْلِ الْيَمَنِ مِنْ يَلَمْلَمَ ». وعند البخاري عَنِ ابْنِ عُمَرَ - رضى الله عنهما - قَالَ لَمَّا فُتِحَ هَذَانِ الْمِصْرَانِ أَتَوْا عُمَرَ فَقَالُوا يَا أَمِيرَ الْمُؤْمِنِينَ ، إِنَّ رَسُولَ اللَّهِ - صلى الله عليه وسلم - حَدَّ لأَهْلِ نَجْدٍ قَرْنًا ، وَهُوَ جَوْرٌ عَنْ طَرِيقِنَا ، وَإِنَّا إِنْ أَرَدْنَا قَرْنًا شَقَّ عَلَيْنَا . قَالَ فَانْظُرُوا حَذْوَهَا مِنْ طَرِيقِكُمْ . فَحَدَّ لَهُمْ ذَاتَ عِرْقٍ . والخلاف قوي في تحديد من وقت ذات عرق فإن شئت التفصيل فأرجع مأجورا إلى كلام ابن حجر في الفتح.',
            1,
            0),
        HadithResponse(
            2,
            'فإذا وصلت إلي ميقات(1) أهل المدينة -وهو ميقات أيضا لمن جاء عليه وليس من أهلها - فيسن لك عند الوصول أمور :-\n- أ – الاغتسال للإحرام عَنْ خَارِجَةَ بْنِ زَيْدِ بْنِ ثَابِتٍ عَنْ أَبِيهِ أَنَّهُ رَأَى النَّبِىَّ ﷺ تَجَرَّدَ لإِهْلاَلِهِ وَاغْتَسَلَ.(2)\nتنتقب المرأة المحرمة ولا تلبس القفازين " (3) ويجوز للمرأة أن تستر وجهها بشيء كالخمار أو الجلباب تلقيه على رأسها وتسدله على وجهها وإن كان يمس الوجه على الصحيح ولكنها لا تشده عليها كما قال ابن تيمية رحمه الله تعالى وليس للمرأة لباس معين للإحرام كالأسود أو الأخضر كما يعتقد البعض .\nت- يأخذ من شاربه وأظفاره وعانته وإبطيه ما تدعو الحاجة لأخذه وليس هذا من خصائص الإحرام ولكن حتى لا يضطر للأخذ منها بعد الاحرام وهذا محرم ، أما اللحية فحرام حلقها لثبوت الامر بإعفائها والإجماع على حرمة حلقها(4)\nج- وله أن يلبس الإحرام قبل الميقات ولوفي بيته كما فعله رسول الله صلى الله عليه وسلم وأصحابه.وفي هذا تيسير على الذين يحجون بالطائرة ولا يمكنهم لبس الإحرام عند الميقات فيجوز لهم أن يصعدوا الطائرة في لباس الإحرام ولكنهم لا يحرمون إلا قبل الميقات بيسير حتى لا يفوتهم الميقات وهم غير محرمين (5)\nد – يسن له التطيب بأطيب الطيب في رأسه ولحيته .\nعَنْ عَائِشَةَ - رضى الله عنها - زَوْجِ النَّبِىِّ - - قَالَتْ كُنْتُ أُطَيِّبُ رَسُولَ اللَّهِ - صلى الله عليه وسلم - لإِحْرَامِهِ حِينَ يُحْرِمُ ، وَلِحِلِّهِ قَبْلَ أَنْ يَطُوفَ بِالْبَيْتِ.(6)',
            '(1) ميقات بلدك ولكني خصصت ذي الحليفة وفقا لتصور الرحلة من أولها .\n(2) رواه الترمذي في سننه في كتاب الحج - باب مَا جَاءَ فِى الاِغْتِسَالِ عِنْدَ الإِحْرَامِ. قال أبو عيسى هذا حديث حسن غريب وقد استحب قوم من أهل العلم الاغتسال عند الإحرام وبه يقول الشافعي قال الشيخ الألباني : صحيح\n(3) فهم البعض خطأ المخيط على انه ما فيه خيط وليس كذلك والصحيح الذي حيك عل قدر العضو المفصل على مقدار العضو , كالفنيلة والشراب والسروال ...الخ.\n هو القناع على مازن الأنف وهوعلى وجوه : إذا أدنت المرأة نقابها إلى عينها فتلك الوصوصة أوالبرقع فإن أنزلته إلى المحجر فهوالنقاب فإن كان على طرف الأنف فهواللكفام . وسمي نقاب المرأة لأنه يستر نقابها أي لونها بلون النقاب . انتهى ملخصا من " لسان العرب " ( 2 / 265 266 ) قاله الامام الالباني في منسكه\n قال شيخ الإسلام ابن تيمية في " منسكه " ( ص 365 ) : ( والقفازات غلاف يصنع لليد كما يفعله حملة البزاة " . والبزاة جمع باز . وهونوع من الصقور يستخدم في الصيد. قاله الامام الالباني في منسكه\n(4) متفق عليه " صحيح أبي داود " ( 1600 ) \nنقل الإجماع شيخ الإسلام والنووي وابن حزم وابن عبد البر رحمة الله تعالى عليهم جميعا.\n(5) وهذا لمن كانت وجهته البيت الحرام مباشرة من بلده أما من أحدث عمرة في المدينة فمن ميقات أهلها كما بينت\n(6) متفق عليه',
            1,
            0),
        HadithResponse(
            3,
            '- ليس للإحرام صلاة مخصوصة كما يظن البعض ولكن يصلى المفروضة إن وافق وقتها الإحرام أو يصلي سنة الوضوء.لان النبي ﷺ صلى الظهر ثم أحرم ويستحب له أن يصلي في ذي الحليفة ان كانت ميقاته لا لخصوص الإحرام وإنما لخصوص المكان وبركته .\nفقد روى البخاري عن عمر رضي الله عنه قال : سمعت رسول الله بوادي العقيق يقول : " أتاني الليلة آت من ربي فقال : صل في هذا الوادي المبارك وقل : عمرة في ( وفي رواية : عمرة و حجة ) وعن ابن عمر عن النبي صلى الله عليه و سلم " أنه رؤي ( وفي رواية : أري ) وهو معرس (1) بذي الحليفة ببطن الوادي قيل له : إنك ببطحاء مباركة " (2)',
            '(1) من التعريس وهونزول المسافر آخر الليل نزلة للنوم والاستراحة . " نهاية "\n(2) " صحيح أبي داود " ( 1579 ) و قال الحافظ في " الفتح " ( 3 / 311 ) : ( في الحديث فضل العقيق كفضل المدينة وفضل الصلاة فيه . . . )',
            1,
            0),
        HadithResponse(
            4,
            'اسم من أسماء المدينة ففي قصة الجساسة ( وَإِنَّ عَلَى كُلِّ نَقْبٍ مِنْهَا مَلاَئِكَةً يَحْرُسُونَهَا قَالَتْ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- وَطَعَنَ بِمِخْصَرَتِهِ فِى الْمِنْبَرِ « هَذِهِ طَيْبَةُ هَذِهِ طَيْبَةُ هَذِهِ طَيْبَةُ ». يَعْنِى الْمَدِينَةَ أخرجه مسلم 119 - ( 2942 )',
            '',
            1,
            0),
        HadithResponse(
            5,
            'اذا كانت وجهتك مكة مباشرة فعليك الاحرام من ميقاتك كما سأبين قريبا إن شاء الله',
            '',
            1,
            0),
        HadithResponse(
            6,
            'وهو المسمى بأبيار على وقد غلبتنا الشيعة عاملهم الله بما يستحقونه على هذه التسمية',
            '',
            1,
            0)
      ]),
      ZikerResponse(24, 'أما الركن الأول الإحرام', [
        HadithResponse(
            1,
            '- وهو نية الدخول في العمرة ويستحب أن يتلفظ المعتمر بقول ( لبيك عمرة ) عند إحرامه.\n- التلبيه:يلبي الحاج او المعتمر بعد ان يحرم فقول) "لَبَّيْكَ اللَّهُمَّ لَبَّيْك، لَبّيْك لا شَرِيكَ لك لَبَّيْك إنَّ الحَمْدَ، والنِّعْمَةَ، لَكَ والمُلْك، لا شريك لك"(1) ويستمر في التلبيه ولا يقطعها الا عندما يشرع في رمي جمرة العقبه يوم العيد للحاج ،وعند الشروع في الطواف للمعتمر ويرفع بها الرجال أصواتهم , أما النساء فيخفض أصواتهن بها.',
            '(1) متفق عليه وزاد بعض الصحابة كما قال جابر والناس يزيدون لبيك ذا المعارج لبيك ذا الفواضل',
            1,
            0),
        HadithResponse(
            2,
            '- بعد الفراغ من الصلاة يتوجه الى مركوبه سيارة أو خلافه وبعد أن يستوي عليه يحرم مستفبلا القبلة(1) ينوي بقلبه الدخول في النسك ويتلفظ بنوع النسك مثاله:-لبيك عمرة أواللهم لبيك عمرة وكَانَ ابْنُ عُمَرَ -رضى الله عنهما- إِذَا صَلَّى بِالْغَدَاةِ بِذِى الْحُلَيْفَةِ أَمَرَ بِرَاحِلَتِهِ فَرُحِلَتْ ثُمَّ رَكِبَ ، فَإِذَا اسْتَوَتْ بِهِ اسْتَقْبَلَ الْقِبْلَةَ قَائِمًا ، ثُمَّ يُلَبِّى حَتَّى يَبْلُغَ الْمَحْرَمَ ، ثُمَّ يُمْسِكُ حَتَّى إِذَا جَاءَ ذَا طُوًى بَاتَ بِهِ حَتَّى يُصْبِحَ ، فَإِذَا صَلَّى الْغَدَاةَ اغْتَسَلَ ، وَزَعَمَ أَنَّ رَسُولَ اللَّهِ - صلى الله عليه وسلم - فَعَلَ ذَلِكَ .(2)',
            '(1) منسك النووي ص 11 ومنسك الالباني ص 16\n(2) متفق عليه',
            1,
            0),
        HadithResponse(
            3,
            '- له أن يشترط إن خاف على نفسه عارض فعَنْ عَائِشَةَ قَالَتْ دَخَلَ رَسُولُ اللَّهِ - - عَلَى ضُبَاعَةَ بِنْتِ الزُّبَيْرِ فَقَالَ لَهَا « لَعَلَّكِ أَرَدْتِ الْحَجَّ » . قَالَتْ وَاللَّهِ لاَ أَجِدُنِى إِلاَّ وَجِعَةً . فَقَالَ لَهَا « حُجِّى وَاشْتَرِطِى ، قُولِى اللَّهُمَّ مَحِلِّى حَيْثُ حَبَسْتَنِى » .(1)',
            '(1) متفق عليه',
            1,
            0)
      ]),
      ZikerResponse(25, 'محظورات الإحرام', [
        HadithResponse(
            1,
            '- ويحظر على المحرم بعض المحظورات كالطيب والأخذ من الشعر ولبس المخيط وتقليم الأظافر وتغطية الرأس،والصيد والجماع ومقدماته وعقد الزواج ويحظر على المرأة النقاب ولبس القفازين ولكن تتقي الرجال بخمارها أو نحوه ولا تكشف وجهها للرجال.\n- لا يجوز للمرأة المحرمة أن تلبس القفازين أو النقاب لأنهما مفصلان على مقدار العضو لقوله صلى الله عليه وسلم (لا تنتقب المحرمة ولا تلبس القفازين) رواه البخاري ولكنها تستر وجهها ويديها عن الأجانب بغير القفازين والنقاب ولا يلبس القلنسوة والعمامة ونحوهما مما يستر الرأس مباشرة.قال ﷺ: " لا يلبس المحرم القميص ولا العمامة ولا البرنس ولا السراويل ولا ثوبا مسه ورس ولا زعفران ولا الخفين إلا أن لا يجد نعلين فيلبس الخفين \nلا يضع في ثياب إحرامه طيب ولا يضر بقاء الطيب بعد الإحرام.(2)وفي الحديث : وَلاَ تَلْبَسُوا مِنَ الثِّيَابِ شَيْئًا مَسَّهُ الزَّعْفَرَانُ أَوْ وَرْسٌ » . (3)',
            '(1) قال شيخ الإسلام ابن تيمية في " منسكه " : ( وليس عليه أن يقطعهما دون الكعبين فإن النبي صلى الله عليه وسلم أمر بالقطع أولا ثم رخص بعد ذلك في عرفات في لبس السراويل لمن لم يجد إزارا ورخص في لبس الخفين لمن لم يجد نعلين هذا أصح قولي العلماء )\n(2) طيب الرجال ما ظهر ريحه وخفي لونه وطيب النساء ما ظهر لونه وخفي ريحه.\n(3) متفق عليه',
            1,
            0)
      ]),
      ZikerResponse(26, 'الوصول للبلد الحرام ( مكة المكرمة )', [
        HadithResponse(
            1,
            ' - 1- ضع أمتعتك في مكان سكنك ولاحظ انك محرم فإياك والجدال والفسوق وعليك بالرفق والصبروكن عونالإخوانك ولاسيما الشيوخ والعجائز ، فعَنْ أَبِى هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ ﷺ « مَنْ نَفَّسَ عَنْ مُؤْمِنٍ كُرْبَةً مِنْ كُرَبِ\nالدُّنْيَا نَفَّسَ اللَّهُ عَنْهُ كُرْبَةً مِنْ كُرَبِ يَوْمِ الْقِيَامَةِ وَمَنْ يَسَّرَ عَلَى مُعْسِرٍ يَسَّرَ اللَّهُ عَلَيْهِ فِى الدُّنْيَا وَالآخِرَةِ وَمَنْ سَتَرَ مُسْلِمًا سَتَرَهُ اللَّهُ فِى الدُّنْيَا وَالآخِرَةِ وَاللَّهُ فِى عَوْنِ الْعَبْدِ مَا كَانَ الْعَبْدُ فِى عَوْنِ أَخِيهِ.........الحديث (1)',
            '(1) رواه مسلم',
            1,
            0),
        HadithResponse(
            2,
            '-2- لا بأس أن تغتسل أو تتوضأ -وتنجب الطيب أو الصابون المعطر في الغسل- وأحظر المناديل المعطرة أثناء التنشيف ولا عليك إن سقط من راسك شعر أو نحوه بدون قصد فالمحظور الأخذ منه عمدا متذكرا فإذا ارتكب المحرم محظورا من محظورات الإحرام ناسيا أو جاهلا الحكم فلا حرج عليه والله أعلم .\n-3- لا حرج إذا أراد المحرم تغيير ملابس إحرامه خلافا لما يعتقده العامة.\n-4-لا بأس بأن يأخذ المحرم قسطا من الراحة بنية التقوي على العبادة فكثيرا ما نرى العمار يتعبون ولا يستطيعون إكمال المناسك نظرا لطول فترة السفر مع الصيام أحيانا.(1)',
            '(1) ولا ينبغي للمحرم أن يشق على نفسه بالصيام حال السفر إذا كان الصيام يمنعه عن فعل الواجبات لقول النبي ﷺ: عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ - رضى الله عنهما - قَالَ كَانَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- فِى سَفَرٍ فَرَأَى رَجُلاً قَدِ اجْتَمَعَ النَّاسُ عَلَيْهِ وَقَدْ ظُلِّلَ عَلَيْهِ فَقَالَ « مَا لَهُ ». قَالُوا رَجُلٌ صَائِمٌ. فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « لَيْسَ مِنَ الْبِرِّ أَنْ تَصُومُوا فِى السَّفَرِ ». متفق عليه . وإذا لم يكن يشق عليه فيجوز لحديث عَائِشَةَ - رضى الله عنها - زَوْجِ النَّبِىِّ - صلى الله عليه وسلم - أَنَّ حَمْزَةَ بْنَ عَمْرٍو الأَسْلَمِىَّ قَالَ لِلنَّبِىِّ - صلى الله عليه وسلم - أَأَصُومُ فِى السَّفَرِ وَكَانَ كَثِيرَ الصِّيَامِ . فَقَالَ « إِنْ شِئْتَ فَصُمْ ، وَإِنْ شِئْتَ فَأَفْطِرْ » .متفق عليه',
            1,
            0),
        HadithResponse(
            3,
            '-5- التوجه لبيت الله الحرم (1) والدخول بالرجل اليمنى وقول "بسم الله والصلاة والسلامُ على رسُول ، اللَّهُمَّ اغفِر لي ذُنُوبِي" .\n"اللَّهُمَّ افْتَحْ لي أبْوابَ رَحْمَتِك"."أعُوذُ بالله العظيم وبِوَجْهِهِ الكريم وسُلْطَانِهِ القَديم مِنْ الشَيطانِ الرَّجِيم"(2) ،بعض العمار يتكلف الدخول من أبواب معينة ظنا أن في الدخول فيها مزيد فضل وربما يعرض نفسه للضياع عند خروجه ، فالدخول من أقرب باب تجاه سكنه يجزئه(3).',
            '(1) يحسن لك أن تتذكر مكان سكنك أو تأخذ عنوانه حتى لاتدخل نفسك في التيه ،وهذه نصيحة مجرب فعَنْ تَمِيمٍ الدَّارِىِّ أَنَّ النَّبِىَّ ﷺ قَالَ « الدِّينُ النَّصِيحَةُ » قُلْنَا لِمَنْ قَالَ « لِلَّهِ وَلِكِتَابِهِ وَلِرَسُولِهِ وَلأَئِمَّةِ الْمُسْلِمِينَ وَعَامَّتِهِمْ ».متفق عليه\n(2) مر معنا قريبا\n(3) قال صاحب زاد المستقنع باب ذكر دخول مكة يسن: من أعلاها والمسجد من باب بني شيبة.قال الشيخ العثيمين رحمه الله تعالى في الشرح الممتع : قوله: "باب دخول مكة" ، أي: للحاج، كيف يدخل مكة؟ ومن أين يدخلها؟ ومتى يدخلها؟الأفضل أن يدخلها في أول النهار؛ لأن النبي صلّى الله عليه وسلّم دخلها ضحى ، ولكن إذا لم يتيسر له ذلك فليدخلها على الوجه الذي يتيسر له.\nقوله: "يُسَنُّ من أعلاها" ، أي: من أعلى مكة من الحجون، وهل هذا سنة مقصودة، أو وقع اتفاقاً؟ بمعنى هل يتعمد الإنسان أن يذهب ليدخل من أعلاها، أو نقول إذا كان طريقه من أعلاها، فالأفضل ألا يعدل عنه إلى مكان آخر؟ظاهر كلام المؤلف أنه يسن قصد الدخول من أعلاها؛ لأن النبي صلّى الله عليه وسلّم دخلها من أعلاها .\nولكن الذي يظهر أنه يسن إذا كان ذلك أرفق لدخوله، ودليل هذا أن النبي صلّى الله عليه وسلّم لم يأمر أن يدخل الناس من أعلاها.\nقوله: "والمسجد من باب بني شيبة" ، يعني يسن أن يدخل المسجد من باب بني شيبة .وباب بني شيبة الآن عفا عليه الدهر، ولا يوجد له أثر.لكننا أدركنا طوق باب مقوساً في مكان قريب من مقام إبراهيم، يقال: إن هذا هو باب بني شيبة.وكان الذي يدخل من باب السلام، ويتجه إلى الكعبة يدخل من هذا الباب، وهل الدخول من باب بني شيبة، لو قدر وجوده أو إعادته، من السنن المقصودة أو التي وقعت اتفاقاً؟الجواب: يقال فيه ما يقال في دخول مكة.',
            1,
            0),
        HadithResponse(
            4,
            '-6- كثير من عوام المسلمين إذا رأي البيت الحرام ذكر هذا الدعاء " اللَّهُمَّ زِدْ هذا البَيْتَ تَشْرِيفاً وَتَكْرِيماً وَتَعْظِيماً وَمَهابَةً وزِدْ من شَرَفِهِ وكَرَمِهِ مِمَّنْ حَجَّهُ واعْتَمَرَهُ تَشْرِيفاً وَتَكْرِيماً وَتَعْظِيماً وبِرًّا.(1) وذكره البيهقي وغيره في السنن باب ما يقال عند رؤية البيت وذكره ثم قال : هَذَا مُنْقَطِعٌ، أهـ.وقال الإمام الألباني في دفاع عن الحديث النبوي والسيرة وهذا ضعيف جدا بل موضوع .',
            '(1) رواه ابن أبي شيبة في المصنف 7/102 والأزرقي في أخباره 1/381 والبيهقي في الكبرى:ج5/ص73 ح8995 ومسند الشافعي:ج1/ص125 ح0',
            1,
            0),
        HadithResponse(
            5,
            '-7- يبادر المحرم – الرجال فقط دون النساء - بكشف كتفه الأيمن قبل الشروع في الطواف وهذه سنة النبي ﷺ وتسمى الاضطباع ،ثم يذهب إلى الحجر الأسود إذا نزل المطاف وليتجنب المحرم السير عكس طواف الطائفين ليصل للحجر من أقرب نقطة ولكن يسير مع الطائفين حتى يأتي الحجر الأسود أو حذائه ولا يعد هذا الشوط شيئأ ، فيستلمه ويقبله ويسجد عليه إن استطاع وليتجنب إيذاء المسلمين بالمزاحمة لان استلامه محض مستحب ومزاحمة المسلمين المؤدي الى الايذاء فحرام.',
            '',
            1,
            0)
      ]),
      ZikerResponse(27, 'محظورات الإحرام', [
        HadithResponse(
            1,
            '- ويحظر على المحرم بعض المحظورات كالطيب والأخذ من الشعر ولبس المخيط وتقليم الأظافر وتغطية الرأس،والصيد والجماع ومقدماته وعقد الزواج ويحظر على المرأة النقاب ولبس القفازين ولكن تتقي الرجال بخمارها أو نحوه ولا تكشف وجهها للرجال.\n- لا يجوز للمرأة المحرمة أن تلبس القفازين أو النقاب لأنهما مفصلان على مقدار العضو لقوله صلى الله عليه وسلم (لا تنتقب المحرمة ولا تلبس القفازين) رواه البخاري ولكنها تستر وجهها ويديها عن الأجانب بغير القفازين والنقاب ولا يلبس القلنسوة والعمامة ونحوهما مما يستر الرأس مباشرة.قال ﷺ: " لا يلبس المحرم القميص ولا العمامة ولا البرنس ولا السراويل ولا ثوبا مسه ورس ولا زعفران ولا الخفين إلا أن لا يجد نعلين فيلبس الخفين \nلا يضع في ثياب إحرامه طيب ولا يضر بقاء الطيب بعد الإحرام.(2)وفي الحديث : وَلاَ تَلْبَسُوا مِنَ الثِّيَابِ شَيْئًا مَسَّهُ الزَّعْفَرَانُ أَوْ وَرْسٌ » . (3)',
            '(1) قال شيخ الإسلام ابن تيمية في " منسكه " : ( وليس عليه أن يقطعهما دون الكعبين فإن النبي صلى الله عليه وسلم أمر بالقطع أولا ثم رخص بعد ذلك في عرفات في لبس السراويل لمن لم يجد إزارا ورخص في لبس الخفين لمن لم يجد نعلين هذا أصح قولي العلماء )\n(2) طيب الرجال ما ظهر ريحه وخفي لونه وطيب النساء ما ظهر لونه وخفي ريحه.\n(3) متفق عليه',
            1,
            0)
      ]),
      ZikerResponse(28, 'الوصول للبلد الحرام ( مكة المكرمة )', [
        HadithResponse(
            1,
            ' - 1- ضع أمتعتك في مكان سكنك ولاحظ انك محرم فإياك والجدال والفسوق وعليك بالرفق والصبروكن عونالإخوانك ولاسيما الشيوخ والعجائز ، فعَنْ أَبِى هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ ﷺ « مَنْ نَفَّسَ عَنْ مُؤْمِنٍ كُرْبَةً مِنْ كُرَبِ\nالدُّنْيَا نَفَّسَ اللَّهُ عَنْهُ كُرْبَةً مِنْ كُرَبِ يَوْمِ الْقِيَامَةِ وَمَنْ يَسَّرَ عَلَى مُعْسِرٍ يَسَّرَ اللَّهُ عَلَيْهِ فِى الدُّنْيَا وَالآخِرَةِ وَمَنْ سَتَرَ مُسْلِمًا سَتَرَهُ اللَّهُ فِى الدُّنْيَا وَالآخِرَةِ وَاللَّهُ فِى عَوْنِ الْعَبْدِ مَا كَانَ الْعَبْدُ فِى عَوْنِ أَخِيهِ.........الحديث (1)',
            '(1) رواه مسلم',
            1,
            0),
        HadithResponse(
            2,
            '-2- لا بأس أن تغتسل أو تتوضأ -وتنجب الطيب أو الصابون المعطر في الغسل- وأحظر المناديل المعطرة أثناء التنشيف ولا عليك إن سقط من راسك شعر أو نحوه بدون قصد فالمحظور الأخذ منه عمدا متذكرا فإذا ارتكب المحرم محظورا من محظورات الإحرام ناسيا أو جاهلا الحكم فلا حرج عليه والله أعلم .\n-3- لا حرج إذا أراد المحرم تغيير ملابس إحرامه خلافا لما يعتقده العامة.\n-4-لا بأس بأن يأخذ المحرم قسطا من الراحة بنية التقوي على العبادة فكثيرا ما نرى العمار يتعبون ولا يستطيعون إكمال المناسك نظرا لطول فترة السفر مع الصيام أحيانا.(1)',
            '(1) ولا ينبغي للمحرم أن يشق على نفسه بالصيام حال السفر إذا كان الصيام يمنعه عن فعل الواجبات لقول النبي ﷺ: عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ - رضى الله عنهما - قَالَ كَانَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- فِى سَفَرٍ فَرَأَى رَجُلاً قَدِ اجْتَمَعَ النَّاسُ عَلَيْهِ وَقَدْ ظُلِّلَ عَلَيْهِ فَقَالَ « مَا لَهُ ». قَالُوا رَجُلٌ صَائِمٌ. فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « لَيْسَ مِنَ الْبِرِّ أَنْ تَصُومُوا فِى السَّفَرِ ». متفق عليه . وإذا لم يكن يشق عليه فيجوز لحديث عَائِشَةَ - رضى الله عنها - زَوْجِ النَّبِىِّ - صلى الله عليه وسلم - أَنَّ حَمْزَةَ بْنَ عَمْرٍو الأَسْلَمِىَّ قَالَ لِلنَّبِىِّ - صلى الله عليه وسلم - أَأَصُومُ فِى السَّفَرِ وَكَانَ كَثِيرَ الصِّيَامِ . فَقَالَ « إِنْ شِئْتَ فَصُمْ ، وَإِنْ شِئْتَ فَأَفْطِرْ » .متفق عليه',
            1,
            0),
        HadithResponse(
            3,
            '-5- التوجه لبيت الله الحرم (1) والدخول بالرجل اليمنى وقول "بسم الله والصلاة والسلامُ على رسُول ، اللَّهُمَّ اغفِر لي ذُنُوبِي" .\n"اللَّهُمَّ افْتَحْ لي أبْوابَ رَحْمَتِك"."أعُوذُ بالله العظيم وبِوَجْهِهِ الكريم وسُلْطَانِهِ القَديم مِنْ الشَيطانِ الرَّجِيم"(2) ،بعض العمار يتكلف الدخول من أبواب معينة ظنا أن في الدخول فيها مزيد فضل وربما يعرض نفسه للضياع عند خروجه ، فالدخول من أقرب باب تجاه سكنه يجزئه(3).',
            '(1) يحسن لك أن تتذكر مكان سكنك أو تأخذ عنوانه حتى لاتدخل نفسك في التيه ،وهذه نصيحة مجرب فعَنْ تَمِيمٍ الدَّارِىِّ أَنَّ النَّبِىَّ ﷺ قَالَ « الدِّينُ النَّصِيحَةُ » قُلْنَا لِمَنْ قَالَ « لِلَّهِ وَلِكِتَابِهِ وَلِرَسُولِهِ وَلأَئِمَّةِ الْمُسْلِمِينَ وَعَامَّتِهِمْ ».متفق عليه\n(2) مر معنا قريبا\n(3) قال صاحب زاد المستقنع باب ذكر دخول مكة يسن: من أعلاها والمسجد من باب بني شيبة.قال الشيخ العثيمين رحمه الله تعالى في الشرح الممتع : قوله: "باب دخول مكة" ، أي: للحاج، كيف يدخل مكة؟ ومن أين يدخلها؟ ومتى يدخلها؟الأفضل أن يدخلها في أول النهار؛ لأن النبي صلّى الله عليه وسلّم دخلها ضحى ، ولكن إذا لم يتيسر له ذلك فليدخلها على الوجه الذي يتيسر له.\nقوله: "يُسَنُّ من أعلاها" ، أي: من أعلى مكة من الحجون، وهل هذا سنة مقصودة، أو وقع اتفاقاً؟ بمعنى هل يتعمد الإنسان أن يذهب ليدخل من أعلاها، أو نقول إذا كان طريقه من أعلاها، فالأفضل ألا يعدل عنه إلى مكان آخر؟ظاهر كلام المؤلف أنه يسن قصد الدخول من أعلاها؛ لأن النبي صلّى الله عليه وسلّم دخلها من أعلاها .\nولكن الذي يظهر أنه يسن إذا كان ذلك أرفق لدخوله، ودليل هذا أن النبي صلّى الله عليه وسلّم لم يأمر أن يدخل الناس من أعلاها.\nقوله: "والمسجد من باب بني شيبة" ، يعني يسن أن يدخل المسجد من باب بني شيبة .وباب بني شيبة الآن عفا عليه الدهر، ولا يوجد له أثر.لكننا أدركنا طوق باب مقوساً في مكان قريب من مقام إبراهيم، يقال: إن هذا هو باب بني شيبة.وكان الذي يدخل من باب السلام، ويتجه إلى الكعبة يدخل من هذا الباب، وهل الدخول من باب بني شيبة، لو قدر وجوده أو إعادته، من السنن المقصودة أو التي وقعت اتفاقاً؟الجواب: يقال فيه ما يقال في دخول مكة.',
            1,
            0),
        HadithResponse(
            4,
            '-6- كثير من عوام المسلمين إذا رأي البيت الحرام ذكر هذا الدعاء " اللَّهُمَّ زِدْ هذا البَيْتَ تَشْرِيفاً وَتَكْرِيماً وَتَعْظِيماً وَمَهابَةً وزِدْ من شَرَفِهِ وكَرَمِهِ مِمَّنْ حَجَّهُ واعْتَمَرَهُ تَشْرِيفاً وَتَكْرِيماً وَتَعْظِيماً وبِرًّا.(1) وذكره البيهقي وغيره في السنن باب ما يقال عند رؤية البيت وذكره ثم قال : هَذَا مُنْقَطِعٌ، أهـ.وقال الإمام الألباني في دفاع عن الحديث النبوي والسيرة وهذا ضعيف جدا بل موضوع .',
            '(1) رواه ابن أبي شيبة في المصنف 7/102 والأزرقي في أخباره 1/381 والبيهقي في الكبرى:ج5/ص73 ح8995 ومسند الشافعي:ج1/ص125 ح0',
            1,
            0),
        HadithResponse(
            5,
            '-7- يبادر المحرم – الرجال فقط دون النساء - بكشف كتفه الأيمن قبل الشروع في الطواف وهذه سنة النبي ﷺ وتسمى الاضطباع ،ثم يذهب إلى الحجر الأسود إذا نزل المطاف وليتجنب المحرم السير عكس طواف الطائفين ليصل للحجر من أقرب نقطة ولكن يسير مع الطائفين حتى يأتي الحجر الأسود أو حذائه ولا يعد هذا الشوط شيئأ ، فيستلمه ويقبله ويسجد عليه إن استطاع وليتجنب إيذاء المسلمين بالمزاحمة لان استلامه محض مستحب ومزاحمة المسلمين المؤدي الى الايذاء فحرام.',
            '',
            1,
            0)
      ]),
      ZikerResponse(29, 'أما الركن الثالث وهو السعي', [
        HadithResponse(
            1,
            '- السعي سبعة أشواط بين الصفا والمروة يبدأ من الصفا وينتهي بالمروة و يسن عند قربه من الصفا في بداية الشوط الأول أن يقرأ قوله تعالى : ((إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ فَمَنْ حَجَّ الْبَيْتَ أَوْ اعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا وَمَنْ تَطَوَّعَ خَيْرًا فَإِنَّ اللَّهَ شَاكِرٌ عَلِيمٌ )\nثم يقول بعدها ( أبدأ بما بدأ الله به ) ولا يقول هذا إلا في بداية الشوط الأول من السعي .',
            '',
            1,
            0),
        HadithResponse(
            2,
            '- يسن أن يرقى المعتمر على الصفا حتى يرى الكعبة فيستقبلها - لا يشترط أن يرقى الساعي على أعلى الصفا والمروة , بل لو لمست رجلاه بداية ارتفاعها فهو جائز- ويرفع يديه كما يرفعها عند الدعاء قائلاً ( الله أكبر الله لأكبر الله أكبر, لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير لا إله إلا الله وحده لا شريك له أنجز وعده ونصر عبده وهزم الأحزاب وحده )(1)ثم يدعو بما شاء من الدعاء ثم يعيد الذكر السابق , ثم يدعو بما شاء , ثم يعيد الذكر السابق مرة ثالثة كما يسن أن يرفع صوته بالتكبير والذكر السابق ويُسر صوته بالدعاء ثم يسعى إلى المروة . وفي طريقه الى المروة يسن إذا وصل بين الميلين الأخضرين أن يُسرع في المشي وهو الهرولة أما في بقية المسعى فإنه يمشي مشياً عادياً.',
            '(1) رواه مسلم',
            1,
            0),
        HadithResponse(
            3,
            '- يفعل المعتمر على المروة مثلما فعل على الصفا من التكبير (3مرات ) والذكر السابق (3 مرات ) والدعاء بين الأذكار (مرتين ) مع رفع يديه متوجهاً\nللكعبة .ولا يوجد ذكر خاص بالسعي , فلو قرأ القرآن أو ذكر الله أودعاه بما يتيسر فهو جائز .',
            '',
            1,
            0),
        HadithResponse(
            4,
            '- إذا أقيمت الصلاة وهو يسعى فإنه يصلي مع الجماعة في المسعى ثم يكمل سعيه .',
            '',
            1,
            0),
        HadithResponse(
            5,
            '- و طواف النساء و سعيهن مشي كله، قال ابن المنذر: أجمع أهل العلم على أنه لا رمل على النساء حول البيت، و لا بين الصفا و المروة، و ليس عليهن اضطباع. و ذلك لأن الأصل فيهما إظهار الجَلَد، و لا يقصد ذلك في حق النساء، لأن النساء يقصد فيهن الستر، و في الرمل و الاضطباع تعرض للكشف".',
            '',
            1,
            0)
      ]),
      ZikerResponse(30, 'أما الحلق أو التقصير فهو واجب', [
        HadithResponse(
            1,
            '- والحلق أفضل للمعتمر فعَنْ أَبِى هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ ﷺ « اللَّهُمَّ اغْفِرْ لِلْمُحَلِّقِينَ ». قَالُوا يَا رَسُولَ اللَّهِ وَلِلْمُقَصِّرِينَ قَالَ « اللَّهُمَّ اغْفِرْ لِلْمُحَلِّقِينَ ». قَالُوا يَا رَسُولَ اللَّهِ وَلِلْمُقَصِّرِينَ قَالَ « اللَّهُمَّ اغْفِرْ لِلْمُحَلِّقِينَ ». قَالُوا يَا رَسُولَ اللَّهِ وَلِلْمُقَصِّرِينَ قَالَ « وَلِلْمُقَصِّرِينَ ».(1) والتقصير للحاج أفضل حتى يجد ما يحلقه عند التحلل من الحج و يجب أن يستوعب التقصير جميع أنحاء الرأس ، فلا يكفي أن يقصر جهة ويترك أخرى .\nولا يجوز للمرأة أن تحلق شعر رأسها لقوله ﷺ ( ليس على النساء حلق إنما على النساء التقصير )) ((.',
            '(1) متفق عليه',
            1,
            0),
        HadithResponse(
            2,
            'بهذا قد انتهى الحاج المتمتع (1) من نسك العمرة ويحل له الحل كله ويقر في مكة وليحرص على أداء الصلاة جماعة ، ولا سيما في المسجد الحرام ، لقوله ﷺ « صَلاَةٌ فِى مَسْجِدِى هَذَا خَيْرٌ مِنْ أَلْفِ صَلاَةٍ فِيمَا سِوَاهُ إِلاَّ الْمَسْجِدَ الْحَرَامَ ».(2) وقال : « صَلاَةٌ فِى مَسْجِدِى أَفْضَلُ مِنْ أَلْفِ صَلاَةٍ فِيمَا سِوَاهُ إِلاَّ الْمَسْجِدَ الْحَرَامَ وَصَلاَةٌ فِى الْمَسْجِدِ الْحَرَامِ أَفْضَلُ مِنْ مِائَةِ أَلْفِ صَلاَةٍ فِيمَا سِوَاهُ ».(3)',
            '(1) أما القارن فيظل على إحرامه حتى يوم الثامن من ذي الحجة وهو يوم التروية ويهل بالحج كما سيأتي بيانه إن شاء الله قريبا.\n(2) متفق عليه عن أبي هريرة \n(3) رواه أحمد وابن ماجة عن جابر ﷺ وهو ( صحيح ) انظر حديث رقم : 3838 في صحيح الجامع .',
            1,
            0),
        HadithResponse(
            3,
            '-تنبيه:-\nقال ابن القيم :\n( ولم يكن في عمره ( عمرة واحدة خارجاً من مكة كما يفعل كثير من الناس اليوم ، وإنما كانت عمره كلها داخلاً إلى مكة ) .لذلك لا ينبغي تكرار العمرة من التنعيم .',
            '',
            1,
            0),
        HadithResponse(4, 'صحيح أبي داود (174)', '', 1, 0)
      ]),
      ZikerResponse(31, 'في فضائل المدينة المنورة', [
        HadithResponse(
            1,
            '- أ- عن عباد بن تميم عن عمه إن رسول الله ﷺ قال: " أَنَّ إِبْرَاهِيمَ حَرَّمَ مَكَّةَ ، وَدَعَا لَهَا ، وَحَرَّمْتُ الْمَدِينَةَ كَمَا حَرَّمَ إِبْرَاهِيمُ مَكَّةَ ، وَدَعَوْتُ لَهَا فِى مُدِّهَا وَصَاعِهَا ، مِثْلَ مَا دَعَا إِبْرَاهِيمُ - عَلَيْهِ السَّلاَمُ - لِمَكَّةَ " (1)',
            '(1) البخاري 2/749، ومسلم 2/991',
            1,
            0),
        HadithResponse(
            2,
            '- ب- عن أبي هريرة قال: " حَرَّمَ رَسُولُ اللَّهِ ﷺ مَا بَيْنَ لاَبَتَىِ الْمَدِينَةِ. قَالَ أَبُو هُرَيْرَةَ فَلَوْ وَجَدْتُ الظِّبَاءَ مَا بَيْنَ لاَبَتَيْهَا (1)مَا ذَعَرْتُهَا. وَجَعَلَ اثْنَىْ عَشَرَ مِيلاً حَوْلَ الْمَدِينَةِ حِمًى. " (2)',
            '(1) اللابة : أرض ذات حجارة سود كثيرة والمدينة بين لابتين\n(2) مسلم 2/999',
            1,
            0),
        HadithResponse(
            3,
            ' - ت- وعن أنس أن النبي ﷺ قال: " اللَّهُمَّ إِنِّى أُحَرِّمُ مَا بَيْنَ جَبَلَيْهَا مِثْلَ مَا حَرَّمَ بِهِ إِبْرَاهِيمُ مَكَّةَ ، اللَّهُمَّ بَارِكْ لَهُمْ فِى مُدِّهِمْ وَصَاعِهِمْ » " (1)',
            '(1) البخاري 3/1059، ومسلم 2/993',
            1,
            0)
      ]),
      ZikerResponse(32, 'في فضل المسجد النبوي', [
        HadithResponse(
            1,
            ' - أ- عن أبي هريرة ﷺ ، أن النبي ﷺ قال: " لاَ تُشَدُّ الرِّحَالُ إِلاَّ إِلَى ثَلاَثَةِ مَسَاجِدَ الْمَسْجِدِ الْحَرَامِ ، وَمَسْجِدِ الرَّسُولِ ﷺ وَمَسْجِدِ الأَقْصَى"(1)',
            '(1) البخاري 3/63، مسلم 2/1014، 1015 إلا أنه قال: ((تشد الرحال إلى ثلاثة مساجد...))، وأبو يعلى10/283 بلفظ: "لا تشدوا الرحال"',
            1,
            0),
        HadithResponse(
            2,
            'ب- عن أبي هريرة ﷺ أن النبي ﷺ قال: " صَلاَةٌ فِى مَسْجِدِى هَذَا خَيْرٌ مِنْ أَلْفِ صَلاَةٍ فِيمَا سِوَاهُ إِلاَّ الْمَسْجِدَ الْحَرَامَ "(1) فينبغي للزائر أن يحافظ على الصلوات في المسجد النبوي حتى لا يضيع هذا الأجر العظيم.',
            '(1) البخاري 1/398، ومسلم 1/1012',
            1,
            0),
        HadithResponse(
            3,
            'ت- عن أبي سعيد الخدري قال: دَخَلْتُ عَلَى رَسُولِ اللَّهِ ﷺ فِى بَيْتِ بَعْضِ نِسَائِهِ فَقُلْتُ يَا رَسُولَ اللَّهِ أَىُّ الْمَسْجِدَيْنِ الَّذِى أُسِّسَ عَلَى التَّقْوَى قَالَ فَأَخَذَ كَفًّا مِنْ حَصْبَاءَ فَضَرَبَ بِهِ الأَرْضَ ثُمَّ قَالَ « هُوَ مَسْجِدُكُمْ هَذَا ». - لِمَسْجِدِ الْمَدِينَةِ – (1)',
            '(1) مسلم 2/1015',
            1,
            0),
        HadithResponse(
            4,
            'ث- عن أبي هريرة رضي الله عنه قال: سمعت رسول الله ﷺ يقول: "من جاء مسجدي هذا لم يأته إلا لخير يتعلمه أو يعلمه فهو بمنزلة المجاهد في سبيل الله . ومن جاء لغير ذلك فهو بمنزلة الرجل ينظر إلى متاع غيره" (1)',
            '(1) سنن ابن ماجه والحاكم ( صحيح ) انظر حديث رقم : 6184 في صحيح الجامع',
            1,
            0)
      ]),
      ZikerResponse(33, 'فضل الروضة', [
        HadithResponse(
            1,
            '- « مَا بَيْنَ بَيْتِى وَمِنْبَرِى رَوْضَةٌ مِنْ رِيَاضِ الْجَنَّةِ »(1).\nويكفيك المرور فيها أو الجلوس ولو لدقائق أما ما يحدث وما نراه من تمسح بنحاس المنبر وببناء المحراب وإيذاء المسلمين حتى أني رأيت مسلمين يتشاجران\nفيها ويتسابان بجوار قبر النبي صلى الله عليه وسلم وقد اخرج البخاري عن السَّائِبِ بْنِ يَزِيدَ قَالَ كُنْتُ قَائِمًا فِى الْمَسْجِدِ فَحَصَبَنِى رَجُلٌ ، فَنَظَرْتُ فَإِذَا عُمَرُ بْنُ الْخَطَّابِ فَقَالَ اذْهَبْ فَأْتِنِى بِهَذَيْنِ . فَجِئْتُهُ بِهِمَا . قَالَ مَنْ أَنْتُمَا - أَوْ مِنْ أَيْنَ أَنْتُمَا قَالاَ مِنْ أَهْلِ الطَّائِفِ . قَالَ لَوْ كُنْتُمَا مِنْ أَهْلِ الْبَلَدِ لأَوْجَعْتُكُمَا ، تَرْفَعَانِ أَصْوَاتَكُمَا فِى مَسْجِدِ رَسُولِ اللَّهِ ﷺ',
            '(1) البخاري ومسلم عن عبدالله بن زيد المازني',
            1,
            0)
      ]),
      ZikerResponse(34, 'التوجه إلى قبر رسول الله صلى الله عليه وسلم', [
        HadithResponse(
            1,
            'قف أمام القبر وسلم عليه بصوت منخفض وقل : السلام عليك يا رسول الله ورحمة الله وبركاته لحديث أبي هريرة أن رسول الله ﷺ قال :\n- «مَا مِنْ أَحَدٍ يُسَلِّمُ عَلَىَّ إِلاَّ رَدَّ اللَّهُ عَلَىَّ رُوحِى حَتَّى أَرُدَّ عَلَيْهِ السَّلاَمَ».(1)',
            '(1) ( حسن ) رواه أبو داود انظر حديث رقم : 5679 في صحيح الجامع .',
            1,
            0),
        HadithResponse(
            2,
            '- قال :« لا تَجْعَلُوا قَبْرِي عِيداً ، وَصَلُّوا عَلَيَّ ، فَإنَّ صَلاَتَكُمْ تَبْلُغُنِي حَيْثُ كُنْتُمْ ».(1).',
            '(1) أبو داود (2042) حسن مشكاة المصابيح926',
            1,
            0),
        HadithResponse(
            3,
            'بعد السلام على الرسول صلى الله عليه وسلم(1) ينحرف إلى اليمين قليلا ليقف أمام قبر أبي بكر الصديق رضي الله عنه فيسلم عليه ويدعو له ويترضى عنه ،ثم يتحول قليلا إلى اليمين مرة أخرى ليقف أمام قبر عمر بن الخطاب رضي الله عنه فيسلم عليه ويدعو له ويترضى عنه(2) ،وقد كان ابن عمر رضي\nالله عنهما إذا سلم على الرسول صلى الله عليه وسلم وصاحبيه رضي الله عنهما لا يزيد على قوله : السلام عليك يا رسول الله السلام عليك يا أبا بكر السلام عليك يا أبتاه ثم ينصرف .\nوإن أراد أن يدعو فيستقبل القبلة ويدعو لنفسه ووالديه ولمن أوصاه بالدعاء ولجميع المسلمين بما شاء ثم ينصرف، ولا فرق في هذا بين الرجال والنساء.\n(واحذر من صرف بعض العبادات لغير الله تعالى كالإخبات والتوبة والخوف والخضوع والتذلل ) ولا بأس في البكاء إذا اشتقت إليه ولا ترفع يديك بالدعاء مستقبلا القبر وإذا أردت أن تدعو فبعد التسليم عليه صلى الله عليه وسلم استقبل القبلة وادعوا، قال تعالى : وَقَالَ رَبُّكُمُ ادْعُونِي أَسْتَجِبْ لَكُمْ إِنَّ الَّذِينَ يَسْتَكْبِرُونَ عَنْ عِبَادَتِي سَيَدْخُلُونَ جَهَنَّمَ دَاخِرِينَ (60  ) غافر\nوقال تعالى :وَمَنْ أَضَلُّ مِمَّنْ يَدْعُو مِنْ دُونِ اللَّهِ مَنْ لَا يَسْتَجِيبُ لَهُ إِلَى يَوْمِ الْقِيَامَةِ وَهُمْ عَنْ دُعَائِهِمْ غَافِلُونَ ( 5 ) الأحقاف\nوقال تعالى : أَمَّنْ يُجِيبُ الْمُضْطَرَّ إِذَا دَعَاهُ وَيَكْشِفُ السُّوءَ وَيَجْعَلُكُمْ خُلَفَاءَ الْأَرْضِ أَإِلَهٌ مَعَ اللَّهِ قَلِيلًا مَا تَذَكَّرُونَ ( 62 ) النمل\nوإياك أخي المسلم أن تدعو النبي من دون الله فتطلب منه المغفرة أو العفو ونحوه فهذا شرك أكبر مخرج من الملة عياذا بالله العظيم قال تعالى :\nقُلْ لَا أَمْلِكُ لِنَفْسِي نَفْعًا وَلَا ضَرًّا إِلَّا مَا شَاءَ اللَّهُ وَلَوْ كُنْتُ أَعْلَمُ الْغَيْبَ لَاسْتَكْثَرْتُ مِنَ الْخَيْرِ وَمَا مَسَّنِيَ السُّوءُ إِنْ أَنَا إِلَّا نَذِيرٌ وَبَشِيرٌ لِقَوْمٍ يُؤْمِنُونَ ( 188 ) الأعراف .\nقُلْ إِنَّمَا أَدْعُو رَبِّي وَلَا أُشْرِكُ بِهِ أَحَدًا ( 20 ) قُلْ إِنِّي لَا أَمْلِكُ لَكُمْ ضَرًّا وَلَا رَشَدًا ( 21 ) قُلْ إِنِّي لَنْ يُجِيرَنِي مِنَ اللَّهِ أَحَدٌ وَلَنْ أَجِدَ مِنْ دُونِهِ مُلْتَحَدًا ( 22 ) الجن .\nفانظر -رحمك الله تعالى - هذا النبي ﷺ وهو من هو ، لا يملك لنا ولا لنفسه جلب النفع و دفع الضر فكيف ندعوه من دون الله العظيم .',
            '(1) بعض الناس يرسل مع الحجاج والزوار إلى النبي صلى الله عليه وسلم سلامهم إليه ،وهذا ليس صحيحا والصحيح ما قله النبي مَا مِنْ أَحَدٍ يُسَلِّمُ عَلَيَّ إِلاَّ رَدَّ اللَّهُ إِلَيَّ رُوحِي حَتَّى أَرُدَّ عَلَيْهِ السَّلامَ. ولم يقيد ذلك بمكان والله أعلم\n(2) واعلم علمك الله الخير انه ليس هناك ذكر اودعاء ثابت عند الوقوف على قبر الصاحبين وكل الأدعية الواردة في ذلك كانت على سبيل تعليم العامي فقط فانتبه',
            1,
            0)
      ]),
      ZikerResponse(35, 'المزارات في المدينة النبوية', [
        HadithResponse(
            1,
            'جرت العادة عند منظمي حملات الحج والعمرة أن يضعوا برنامج لزيارة أماكن بعينيها، وليعلم أنه لم يكن هذا من هدى السلف الصالح يعني الزيادة على المشروع في الزيارة كما يطلقون عليها الآن ولكن يشرع للزائر أن يتجه إلى هذه الأماكن:- \nأ-مسجد قباء:\nويستحب أن يصلي فيه صلاة فرضا كان أو نفلا ودليله:-\n- عَنِ ابْنِ عُمَرَ - رضى الله عنهما - قَالَ كَانَ النَّبِىُّ - صلى الله عليه وسلم - يَأْتِى قُبَاءً رَاكِبًا وَمَاشِيًا . زَادَ ابْنُ نُمَيْرٍ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ فَيُصَلِّى فِيهِ رَكْعَتَيْنِ .(1)\n- وعن سهل بن حنيف رضي الله عنه قال : قال رسول الله ﷺ: "من تطهر في بيته ثم أتى مسجد قباء فصلى فيه صلاة كان له كأجر عمرة "(2)\nوهذا ليس من باب شد الرحل لانه "لا تشد الرحال إلا إلى ثلاثة مساجد: المسجد الحرام، ومسجدي هذا، والمسجد الأقصى"(3)ولكن من باب قصده كما يقصد الرجل مسجد مصره(4) أما المساجد الثلاثة اتفق العلماء على استحباب إتيانها للصلاة.',
            '(1) متفق عليه\n(2) النسائي 2/37 وصحيح الجامع 6154\n(3) متفق عليه\n(4) اقتضاء الصراط المستقيم 1/432',
            1,
            0),
        HadithResponse(
            2,
            'ب – البقيع  (1):\n- ويشرع له زيارة قبور البقيع فعَنْ عَائِشَةَ أَنَّهَا قَالَتْ كَانَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- كُلَّمَا كَانَ لَيْلَتُهَا مِنْ رَسُولِ اللَّهِ -صلى الله عليه وسلم- - يَخْرُجُ مِنْ آخِرِ اللَّيْلِ إِلَى الْبَقِيعِ فَيَقُولُ « السَّلاَمُ عَلَيْكُمْ دَارَ قَوْمٍ مُؤْمِنِينَ وَأَتَاكُمْ مَا تُوعَدُونَ غَدًا مُؤَجَّلُونَ وَإِنَّا إِنْ شَاءَ اللَّهُ بِكُمْ لاَحِقُونَ اللَّهُمَّ اغْفِرْ لأَهْلِ بَقِيعِ الْغَرْقَدِ »(2).\n- وعَنِ ابْنِ بُرَيْدَةَ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ ﷺ « نَهَيْتُكُمْ عَنْ زِيَارَةِ الْقُبُورِ فَزُورُوهَا(3)\nوكذلك قبور الشهداء وقبر حمزة رضي الله عنه ; لأن النبي صلى الله عليه وسلم كان يزورهم , ويدعو لهم، ولقوله صلى الله عليه وسلم : "زوروا القبور فإنها تذكركم الآخرة "(4).\n- وكان النبي صلى الله عليه وسلم يعلم أصحابه إذا زاروا القبور أن يقولوا : "السلام عليكم أهل الديار من المؤمنين والمسلمين , وإنا إن شاء الله بكم لاحقون، نسأل الله لنا ولكم العافية"(5).',
            '(1) قبور أهل المدينة "والبَقِيْعُ من الأرض: مَوْضِعٌ فيه أرُوْمُ شَجَرٍ، وبه سمَيَ بَقِيْعُ الغَرْقَد".قاله صاحب المحيط في اللغة\n(2) مسلم والنسائي 2038\n(3) مسلم\n(4) مسلم 2/671\n(5) مسلم 2/671 وقال صاحب مغني المحتاج 1/512\nاستحب بعض العلماء زيارة المشاهد في المدينة والتي أوصلها بعضهم إلى نحو ثلاثين موضعا واستحبوا أن يأتي بئر أريس فيشرب منها ويتوضأ وكذلك بقية الآبار السبعة.قلت :وهذا ليس عليه دليل من السنة ولو كان خيرا لفعله الصحابة فقد سبقونا بكل خير وما لم يكن يومئذ دينا فلا يصلح اليوم أن يكون دينا، ولعل الدافع لزيارة هذه الأماكن التبرك وهذا لا يجوز شرعا وان ذهب إليها قاصدا التعبد فبدعة منكرة،وإذا تمسح بها فحرام لا يجوز.وقال بعض أهل العلم إن كانت على سبيل المعرفة فجائزة لا بأس فيها.',
            1,
            0)
      ]),
      ZikerResponse(36, 'تنبيه: أحاديث ضعيفة وموضوعة', [
        HadithResponse(
            1,
            'هناك بعض الأحاديث المروية ولا تثبت عن رسول الله ومنها:\n(( مَن حَجَّ ولَم يَزُرْنِي فقد جَفانِي ))\n(( مَن زارني بعد مَمَاتي فكأنَّمَا زارَني في حياتي ))\n(( مَن زارني وزارَ أبي إبراهيم في عامٍ واحد ضَمِنْتُ له على الله الجَنَّةَ ))\n(( مَن زار قَبري وَجَبتْ له شفاعَتِي ))\nوهذه الأحاديث موضوعةٌ أو ضعيفةٌ جدًّا كما نَبَّه على ذلك الحفاظُ كالدارقطني والعُقيلي والبيهقي وابن تيمية وابن حجر رحمهم الله تعالى.',
            '',
            1,
            0)
      ]),

      /// remaining Haij
      ZikerResponse(37, 'صباح يوم الثامن من ذي الحجة - يوم التروية', [
        HadithResponse(
            1,
            '-ينوي الحج بقلبه ويلبي قائلاً: ((لبيك حجاً)) وإن كان خائفاً من عائق يمنعه من إتمام حجه اشترط فعن عَائِشَةَ قَالَتْ دَخَلَ رَسُولُ اللَّهِ ﷺ عَلَى ضُبَاعَةَ بِنْتِ الزُّبَيْرِ فَقَالَ لَهَا « لَعَلَّكِ أَرَدْتِ الْحَجَّ » . قَالَتْ وَاللَّهِ لاَ أَجِدُنِى إِلاَّ وَجِعَةً (1).\nفَقَالَ لَهَا « حُجِّى وَاشْتَرِطِى (2)، قُولِى اللَّهُمَّ مَحِلِّى حَيْثُ حَبَسْتَنِى (3)» . (4)\n وإن كان حاجاً عن غيره نوى بقلبه ثم قال: لبيك حجاً عن فلانٍ ذكر أو أنثى.',
            '(1) وجعة : مريضة\n(2) اشترط : وضع شرطا أن يحل إحرامه إذا منعه مانع عن آداء الفريضة\n(3) حبستني : منعتني بقدرك عن الوصول وأخرتني عن الحج\n(4) متفق عليه',
            1,
            0),
        HadithResponse(
            2,
            '- الاغتسال و التطيب، و لبس الإزار و الرداء والإحرام من محل الإقامة (1) والإهلال بالحج والذهاب إلى منى مع التلبية ويظل يلبي إلى أن يرمي الجمرة يوم النحر.',
            '(1) يحرم من الموضع الذي هو نازل فيه، حتى أهل مكة يحرمون من مكة.',
            1,
            0),
        HadithResponse(
            3,
            '- لا تنسى الصلاة أخي الحاج في وقتها تصلي الظهر ركعتين والعصر ركعتين والمغرب ثلاث ركعات والعشاء ركعتين والفجر ركعتين كل صلاة في وقتها تصلى قصر .',
            '',
            1,
            0),
        HadithResponse(
            4,
            '- يستحب للحاج أن يبيت بمنى ليلة عرفة؛ لفعله ﷺ فإذا صلى الفجر مكث حتى تطلع الشمس (1)فإذا طلعت سار من منى إلى عرفات ملبياً أو مكبراً؛ لقول أنس - رضي الله عنه - ((كان يهل منا المهل فلا ينكر عليه ويكبر منا المكبر فلا يُنكر عليه)) (2). وقد أقرَّهم النبي - صلى الله عليه وسلم - على ذلك، لكن الأفضل لزوم التلبية؛ لأن النبي - صلى الله عليه وسلم - لازمها.',
            '(1) رواه مسلم\n(2) متفق عليه',
            1,
            0)
      ]),
      ZikerResponse(38, 'صباح يوم التاسع من ذي الحجة - يوم عرفة', [
        HadithResponse(
            1,
            '- بعد فجر يوم التاسع التوجه إلى عرفات ويلبي ويكبر (1) يلبي الملبي فلا ينكر عليه، و يكبر المكبر فلا ينكر عليه وصلاة الظهر والعصر قصرا وجمع تقديم يؤذن لهما أذاناً واحداً ويقيم لهما إقامتين واحدة بعد الاخرى و لا يصلي بينهما شيئاً.ويجوز أن يصليهما الحاج وحده إن لم يستطيع أن يصلى مع الإمام. وخطبة للإمام بمسجد نمرة (2) ثم الرجوع إلى مكانك بعرفة ، ومن السنة الوقوف عند الصخرات أسفل جبل الرحمة، إن تيسر له ذلك، و إلا فعرفة كلها موقف.ويستقبل القبلة ويرفع يديه ويدعو ويلبي ويكثر من التهليل فإنه خير الدعاء يوم عرفة',
            '(1) أخرجه الشيخان.\n(2) مكان قريب من عرفات، و ليس منها، و يظل بها إلى ما قبل الزوال.',
            1,
            0),
        HadithResponse(
            2,
            '- قَالَ ﷺ « خَيْرُ الدُّعَاءِ دُعَاءُ يَوْمِ عَرَفَةَ وَخَيْرُ مَا قُلْتُ أَنَا وَالنَّبِيُّونَ مِنْ قَبْلِى لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ ».(1). وينبغي على الحاج أن يفرغ قلبه من مشاغل الدنيا ويتعلق قلبه بالآخرة في هذا اليوم الكريم يوم المباهاة والعتق من النار.',
            '(1) رواه الترمذي وهو صحيح',
            1,
            0),
        HadithResponse(
            3,
            '- عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ ﷺ قَالَ « مَا مِنْ يَوْمٍ أَكْثَرَ مِنْ أَنْ يَعْتِقَ اللَّهُ عَزَّ وَجَلَّ فِيهِ عَبْدًا أَوْ أَمَةً مِنَ النَّارِ مِنْ يَوْمِ عَرَفَةَ إِنَّهُ لَيَدْنُو ثُمَّ يُبَاهِى بِهِمُ الْمَلاَئِكَةَ وَيَقُولُ مَا أَرَادَ هَؤُلاَءِ ».(1)',
            '(1) رواه مسلم وأبو داود والنسائي',
            1,
            0),
        HadithResponse(
            4,
            '- عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ أَنَّ النَّبِىَّ ﷺ كَانَ يَقُولُ « إِنَّ اللَّهَ عَزَّ وَجَلَّ يُبَاهِى مَلاَئِكَتَهُ عَشِيَّةَ عَرَفَةَ بِأَهْلِ عَرَفَةَ فَيَقُولُ انْظُرُوا إِلَى عِبَادِى أَتَوْنِى شُعْثاً غُبْراً ».(1)',
            '(1) رواه مسلم',
            1,
            0),
        HadithResponse(
            5,
            'فينبغي الإكثار من هذا الذكر وتكراره بخشوع وحضور قلب وينبغي الإكثار أيضا من الأذكار والأدعية الواردة في الشرع في كل وقت ولا سيما في هذا الموضع في هذا اليوم العظيم ويختار جوامع الذكر والدعاء ومن ذلك :\n" سبحان الله وبحمده سبحان الله العظيم "\n{ لَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ } [ الأنبياء : 87 ]\n" لا إله إلا الله ولا نعبد إلا إياه له النعمة وله الفضل وله الثناء الحسن لا إله إلا الله مخلصين له الدين ولو كره الكافرون " لا حول ولا قوة إلا بالله \nرَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ ." اللهم أصلح لي ديني الذي هو عصمة أمري وأصلح لي دنياي التي فيها معاشي وأصلح لي آخرتي التي فيها معادي واجعل الحياة زيادة لي في كل خير والموت راحة لي من كل شر "" أعوذ بالله من جهد البلاء ودرك الشقاء وسوء القضاء وشماتة الأعداء "و" اللهم إني أعوذ بك من الهم والحزن ومن العجز والكسل ومن الجبن والبخل ومن المأثم والمغرم ومن غلبة الدين وقهر الرجال . أعوذ بك اللهم من البرص والجنون والجذام ومن سيئ الأسقام .اللهم إني أسألك العفو والعافية في الدنيا والآخرة اللهم إني أسألك العفو والعافية في ديني ودنياي وأهلي ومالي .\nاللهم استر عوراتي وآمن روعاتي واحفظني من بين يدي ومن خلفي وعن يميني وعن شمالي ومن فوقي وأعوذ بعظمتك أن أغتال من تحتي اللهم اغفر لي خطيئتي وجهلي وإسرافي في أمري وما أنت أعلم به مني .اللهم اغفر لي جدي وهزلي وخطئي وعمدي وكل ذلك عندي .اللهم اغفر لي ما قدمت وما أخرت وما أسررت وما أعلنت وما أنت أعلم به مني . أنت المقدم وأنت المؤخر وأنت على كل شيء قدير .اللهم إني أسألك الثبات في الأمر والعزيمة على الرشد . وأسألك شكر نعمتك وحسن عبادتك . وأسألك قلبا سليما ولسانا صادقا . وأسألك من خير ما تعلم . وأعوذ بك من شر ما تعلم وأستغفرك لما تعلم إنك علام الغيوب .اللهم رب النبي محمد عليه الصلاة والسلام اغفر لي ذنبي وأذهب غيظ قلبي وأعذني من مضلات الفتن ما أبقيتني .اللهم رب السماوات ورب الأرض ورب العرش العظيم ربنا ورب كل شيء فالق الحب والنوى منزل التوراة والإنجيل والقرآن أعوذ بك من شر كل شيء أنت آخذ بناصيته أنت الأول فليس قبلك شيء وأنت الآخر فليس بعدك شيء وأنت الظاهر فليس فوقك شيء وأنت الباطن فليس دونك شيء اقض عني الدين وأغنني من الفقر .اللهم أعط نفسي تقواها وزكها أنت خير من زكاها أنت وليها ومولاها .اللهم إني أعوذ بك من العجز والكسل وأعوذ بك من الجبن والهرم والبخل وأعوذ بك من عذاب القبر .اللهم لك أسلمت وبك آمنت وعليك توكلت وإليك أنبت وبك خاصمت أعوذ بعزتك أن تضلني لا إله إلا أنت . أنت الحي الذي لا يموت والجن والإنس يموتون .اللهم إني أعوذ بك من علم لا ينفع ومن قلب لا يخشع ومن نفس لا تشبع ومن دعوة لا يستجاب لها .\nاللهم جنبني منكرات الأخلاق والأعمال والأهواء والأدواء .اللهم ألهمني رشدي وأعذني من شر نفسي .\nاللهم اكفني بحلالك عن حرامك وأغنني بفضلك عمن سواك .اللهم إني أسألك الهدى والتقى والعفاف والغنى .\nاللهم إني أسألك الهدى والسداد .اللهم إني أسألك من الخير كله عاجله وآجله ما علمت منه وما لم أعلم وأعوذ بك من الشر كله عاجله وآجله ما علمت منه وما لم أعلم وأسألك من خير ما سألك منه عبدك ونبيك محمد صلى الله عليه وسلم . وأعوذ بك من شر ما استعاذ منه عبدك ونبيك محمد صلى الله عليه وسلم .اللهم إني أسألك الجنة وما قرب إليها من قول أو عمل وأعوذ بك من النار وما قرب إليها من قول أو عمل وأسألك أن تجعل كل قضاء قضيته لي خيرا .لا إله إلا الله وحده لا شريك له ، له الملك وله الحمد يحيي ويميت بيده الخير وهو على كل شيء قدير . سبحان الله والحمد لله ولا إله إلا الله والله أكبر ولا حول ولا قوة إلا بالله العلي العظيم .اللهم صل على محمد وعلى آل محمد كما صليت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد وبارك على محمد وعلى آل محمد كما باركت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد " .\nرَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ .ويستحب في هذا الموقف العظيم أن يكرر الحاج ما تقدم من الأذكار والأدعية وما كان في معناها من الذكر والدعاء والصلاة على النبي صلى الله عليه وسلم ويلح في الدعاء . ويسأل ربه من خيري الدنيا والآخرة .\nوكان النبي صلى الله عليه وسلم إذا دعا كرر الدعاء ثلاثا فينبغي التأسي به في ذلك عليه الصلاة والسلام . ويكون المسلم في هذا الموقف مخبتا لربه سبحانه متواضعا له خاضعا لجنابه منكسرا بين يديه يرجو رحمته ومغفرته ، ويخاف عذابه ومقته ، ويحاسب نفسه ويجدد توبة نصوحا ؛ لأن هذا يوم عظيم ، ومجمع كبير ، يجود الله فيه على عباده ، ويباهي بهم ملائكته ، ويكثر فيه العتق من النار ، وما رئي الشيطان في يوم هو فيه أدحر ولا أصغر ولا أحقر منه في يوم عرفة إلا ما رئي يوم بدر ، وذلك لما يرى من جود الله على عباده وإحسانه إليهم وكثرة إعتاقه ومغفرته .(1)',
            '(1) مستفاد من كتاب : التحقيق والإيضاح لكثير من مسائل الحج والعمرة والزيارةللشيخ عبد العزيز بن عبد الله بن بازالطبعة : الثانية والعشرون صـ48وما بعدها',
            1,
            0),
        HadithResponse(
            6,
            '- من الأفضل أن يكون الحاجُّ يوم عرفة مفطراً وفي إفطار الحاج يوم عرفة من الفوائد: أنه يتقوَّى بذلك على الدعاء، والتضرع، والتذلل لله تعالى، ويزيد نشاطه في هذا الموقف العظيم ، و اقتداءً بالنبي - صلى الله عليه وسلم -، فعن أم الفضل بنت الحارث رضي اللَّه عنها: ((أن ناساً تماروا عندها يوم عرفه في صوم النبي ﷺ، فقال بعضهم: هو صائم، وقال بعضهم: ليس بصائم،\nفأرسلتْ إليه بقدح لبنٍ وهو واقف على بعيره فشربه)) (1).وعن ميمونه رضي اللَّه عنها: أن ناساً شكَّوا في صيام النبي ﷺ يوم عرفة، فأرسلت إليه بحلابٍ (2) وهو واقف في الموقف، فشرب منه والناس ينظرون)) (3).',
            '(1) متفق عليه\n(2) الحلاب: الإناء الذي يحلب فيه. [النهاية في غريب الحديث لابن الأثير، 1/ 421].\n(3) متفق عليه',
            1,
            0)
      ]),
      ZikerResponse(39, 'بعد غروب يوم التاسع ليلة العاشر من ذي الحجة - الإفاضة من عرفة والمبيت بمزدلفة', [
        HadithResponse(
            1,
            '- إذا غربت الشمس أفاض الحجيج من عرفات إلى مزدلفة بهدوء ، وسكينة ولا يزاحم إخوانه والرفق بالكبار والعجائز والنساء ،قال ﷺ ((أيها الناس السكينةَ السكينةَ)) (1).\nوقال حينما سمع زجراً شديداً وضرباً وصوتاً للإبل: ((أيها الناس عليكم السكينة فإن البر ليس بالإيضاع(2)) (3) . ولا تنسى التلبية.',
            '(1) مسلم، كتاب الحج، باب حجة النبي - صلى الله عليه وسلم -، برقم 1218.\n(2) ( بالإيضاع ) هو حمل الدابة على إسراعها في السير . واستشهد البخاري لهذا المعنى بقوله تعالى { لأوضعوا خلالكم } التوبة 47. واستشهد لتفسيره الخلال بقوله تعالى { وفجرنا خلالهما نهرا } / الكهف 33 / ] \n(3) البخاري، كتاب الحج، باب أمر النبي - صلى الله عليه وسلم - بالسكينة عند الإفاضة وإشارته',
            1,
            0),
        HadithResponse(
            2,
            '- عند الوصول إلى مزدلفة (1) أذن و أقام و صلى المغرب والعشاء جمع تقديم فإن تعسر فجمع تأخير المغرب والعشاء ركعتين بأذآن واحد أقامتين .ثم ينام حتى الفجر. فإذا تبين له الفجر صلى في أول وقته بأذان و إقامة.',
            '(1) وتسمى أيضا جمع',
            1,
            0),
        HadithResponse(
            3,
            '- عَنْ أُسَامَةَ بْنِ زَيْدٍ أَنَّهُ سَمِعَهُ يَقُولُ دَفَعَ رَسُولُ اللَّهِ - ﷺ - مِنْ عَرَفَةَ حَتَّى إِذَا كَانَ بِالشِّعْبِ نَزَلَ فَبَالَ ، ثُمَّ تَوَضَّأَ وَلَمْ يُسْبِغِ الْوُضُوءَ . فَقُلْتُ الصَّلاَةَ يَا رَسُولَ\nاللَّهِ . فَقَالَ « الصَّلاَةُ أَمَامَكَ » . فَرَكِبَ ، فَلَمَّا جَاءَ الْمُزْدَلِفَةَ نَزَلَ فَتَوَضَّأَ ، فَأَسْبَغَ الْوُضُوءَ ، ثُمَّ أُقِيمَتِ الصَّلاَةُ فَصَلَّى الْمَغْرِبَ ، ثُمَّ أَنَاخَ كُلُّ إِنْسَانٍ بَعِيرَهُ فِى مَنْزِلِهِ ، ثُمَّ أُقِيمَتِ الْعِشَاءُ فَصَلَّى وَلَمْ يُصَلِّ بَيْنَهُمَا .(1)',
            '(1) متفق عليه',
            1,
            0),
        HadithResponse(
            4,
            '- رخص النبي ﷺ للضعفة من النساء والصبيان في عدم المبيت فيها والانصراف منها قبل الفجر للأحاديث الآتية :- \n** قَالَ سَالِمٌ وَكَانَ عَبْدُ اللَّهِ بْنُ عُمَرَ - رضى الله عنهما - يُقَدِّمُ ضَعَفَةَ أَهْلِهِ ، فَيَقِفُونَ عِنْدَ الْمَشْعَرِ الْحَرَامِ بِالْمُزْدَلِفَةِ بِلَيْلٍ ، فَيَذْكُرُونَ اللَّهَ مَا بَدَا لَهُمْ ، ثُمَّ يَرْجِعُونَ قَبْلَ أَنْ يَقِفَ الإِمَامُ ، وَقَبْلَ أَنْ يَدْفَعَ ، فَمِنْهُمْ مَنْ يَقْدَمُ مِنًى لِصَلاَةِ الْفَجْرِ ، وَمِنْهُمْ مَنْ يَقْدَمُ بَعْدَ ذَلِكَ ، فَإِذَا قَدِمُوا رَمَوُا الْجَمْرَةَ ، وَكَانَ ابْنُ عُمَرَ - رضى الله عنهما - يَقُولُ أَرْخَصَ فِى أُولَئِكَ رَسُولُ اللَّهِ ﷺ (1)\n** عن عبد اللَّه مولى أسماء أنها نزلت ليلة جمعٍ عند المزدلفة، ثم قالت: يا بني هل غاب القمر؟ قلت: نعم، قالت: فارتحلوا، فارتحلنا ومضينا حتى رمت جمرة العقبة، ثم رجعت فصلت الصبح في منزلها، فقلت لها: ما أرانا إلا قد غلّسنا؟ قالت: ((يا بني إن رسول اللَّه - ﷺ - أذن للظعن))(2)\n** وعن ابن عباس رضي اللَّه عنهما قال: ((أنا ممن قدَّمَ رسول اللَّه ﷺ ليلة المزدلفة في ضعفة أهله)) (3)، وفي لفظٍ: ((بعثني رسول اللَّه ﷺ من جمعٍ بليلٍ))، وفي لفظ لمسلم: ((بعث بي رسول اللَّه بسحرٍ من جمعٍ)).\n** وعن عائشة رضي اللَّه عنها قالت: ((استأذنت سودة رسول اللَّه ﷺ ليلة جمع أن تدفع قبل حطمة الناس، وكانت امرأة ثبطةً - يعني ثقيلة - فأذِنَ لها، وفي لفظ: ((استأذنت النبي ﷺ سودة: أن تدفع قبل حطمة الناس - وكانت امرأة بطيئة - فأذِنَ لها، فدفعت قبل حطمة الناس، وأقمنا حتى أصبحنا نحن، ثم دفعنا بدفعه، فلأن أكون استأذنتُ رسول اللَّه - - كما استأذنت سودةُ أحبَّ إليَّ من مفروح به)) (4)',
            '(1) متفق عليه\n(2) متفق عليه\n(3) متفق عليه\n(4) متفق عليه',
            1,
            0)
      ]),
      ZikerResponse(40, 'أعمال يوم النحر وأيام التشريق', [
        HadithResponse(
            1,
            '- صلاة الفجر في أول وقته بأذان وإقامة ثم يأتي المشعر الحرام (1) ويقف ويستقبل القبلة ويدعو طويلا ففي حديث حجة النبي ﷺ وفيه ((حَتَّى طَلَعَ الْفَجْرُ وَصَلَّى الْفَجْرَ - حِينَ تَبَيَّنَ لَهُ الصُّبْحُ - بِأَذَانٍ وَإِقَامَةٍ ثُمَّ رَكِبَ الْقَصْوَاءَ حَتَّى أَتَى الْمَشْعَرَ الْحَرَامَ فَاسْتَقْبَلَ الْقِبْلَةَ فَدَعَاهُ وَكَبَّرَهُ وَهَلَّلَهُ وَوَحَّدَهُ فَلَمْ يَزَلْ وَاقِفًا حَتَّى أَسْفَرَ جِدًّا فَدَفَعَ قَبْلَ أَنْ تَطْلُعَ الشَّمْسُ...)) ثم ينطلق قبل طلوع الشمس إلى منى .',
            '(1) ( المشعر الحرام ) جبل صغير في آخر المزدلفة سمي بالمشعر لأنه معلم للعبادة وبالحرام لأنه من الحرم وإذا لم يأته جاز له أن يقف في أي مكان في مزدلفة',
            1,
            0),
        HadithResponse(
            2,
            ' - يرمي جمرة العقبة - يجعل مكة عن يساره، و منى عن يمينه- سبع حصيات يكبر مع كل حصاه(1) ولا يجزئه إذا رمى بها كلها دفعة واحدة إنما تحسب له واحدة وأحذر أخي الحاج من التنطع والتشدد وعليك بهدي رسول الله ﷺ (2) فإذا انتهى من رمي جمرة العقبة قطع التلبية(3)',
            '(1) ((فَرَمَى بِسَبْعِ حَصَيَاتٍ ، يُكَبِّرُ مَعَ كُلِّ حَصَاةٍ )) متفق عليه عن ابن مسعود \n(2) فمن التنطع ما يفعله البعض برمي زجاجات المياه الفرغة مكان الجمرات و مصاحبة الرمي بالسب والشتم للشيطان وقد نهانا النبي ﷺ عن ذلك فقال ﷺ: ((لا تسبوا الشيطان و تعوذوا بالله من شره )). رواه أبو طاهر المخلص ( 9 / 196 / 2 ) و عنه الديلمي ( 4 / 148 ) عن أبي هريرة . وهو ( صحيح ) انظر حديث رقم : 7318 في صحيح الجامع .\n(3) (( لَمْ يَزَلِ النَّبِىُّ - صلى الله عليه وسلم - يُلَبِّى ، حَتَّى رَمَى جَمْرَةَ الْعَقَبَةِ )) متفق عليه',
            1,
            0),
        HadithResponse(
            3,
            '- ثم نحر هديه و يحلق رأسه أو يقصره والحلق أفضل كما مر معنا في العمرة ، والحلق للرجال فقط أما النساء فليس عليهن حلق إنما التقصير(1) تأخذ من ضفائرها قدر أنملة أو تجمع شعرها إن لم يكن ضفائر وتأخذ منه ذاك القدر.',
            '(1) عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ النَّبِيَّ ﷺ قَالَ : { لَيْسَ عَلَى النِّسَاءِ حَلْقٌ ، وَإِنَّمَا يُقَصِّرْنَ } ( صحيح ) انظر حديث رقم : 5403 في صحيح الجامع .',
            1,
            0),
        HadithResponse(
            4,
            '- فإن فعل ما ذكر حل له كل شيء عدا جماع النساء وهو ما يسمى التحلل الأصغر فله أن يغير ثياب الإحرام بقميص مثلا ويضع طيبا ويقلم أظفاره وهكذا.',
            '',
            1,
            0),
        HadithResponse(
            5,
            '- فإذا طاف طواف الإفاضة (1) وسعى بين الصفا والمروة (2) حل له كل شيء حتى النساء وهو ما يسمى بالتحلل الأكبر، وله أن يصلي الظهر بمكة فإن لم يستطع فبمنى.وله أن يؤخر طواف الإفاضة إن تعذر عليه أداؤه في يوم النحر لمرض أو نحوه .',
            '(1) فيطوف بالبيت سبعاً كما تقدم معنا في طواف القدوم إلا أنه لا يضطبع ولا يَرْمُل . ويسن أن يصلي ركعتين عند المقام بعد الطواف.\n(2) خلافاً للقارن و المفرد ، فيكفيهما السعي الأول .',
            1,
            0),
        HadithResponse(
            6,
            '- يرجع الحاج إلى منى فيمكث بها أيام التشريق بلياليها، ويرمي الجمرات الثلاث كل يوم بسبع حصيات لكل جمرة ويبدأ بالصغرى بعد زوال الشمس فإذا فرغ من رميها ، تقدم قليلاً عن يمينه ، فيقوم مستقبلاً القبلة قياماً طويلاً ويدعو ، ويرفع يديه ثم يأتي الجمرة الثانية ، فيرميها كذلك ثم يأخذ ذات الشمال ، فيقوم مستقبل القبلة قياماً طويلاً ، ويدعو ، ويرفع يديه ثم يأتي الجمرة الثالثة ، وهي جمرة العقبة ، فيرميها كذلك ، ويجعل البيت عن يساره ، ومنى عن يمينه ، ولا يقف عندها ثم يرمي اليوم الثاني ، واليوم الثالث كذلك .ويصلى الصلوات الخمس في جماعة والأفضل أن يصلي في مسجد الخَيف إن تيسر له.كل صلاة في وقتها مع قصر الرباعية ولا يجمع فإن أراد التعجل خرج من منى قبل غروب يوم الثاني عشر من ذي الحجة.',
            '',
            1,
            0),
        HadithResponse(
            7,
            '- طواف الوداع سبعة أشواط مبتدأه بالحجر الأسود مع تقبيله أو استلامه أو الإشارة إليه ويشرع استلام الركن اليماني ولا يشرع تقبيله ولا الإشارة إليه، لقوله ﷺ فعَنِ ابْنِ عَبَّاسٍ قَالَ كَانَ النَّاسُ يَنْصَرِفُونَ فِى كُلِّ وَجْهٍ فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « لاَ يَنْفِرَنَّ أَحَدٌ حَتَّى يَكُونَ آخِرُ عَهْدِهِ بِالْبَيْتِ ».(1)وهذا إذا عزم على الرحيل والرجوع الى بلده .',
            '(1) رواه البخاري',
            1,
            0),
        HadithResponse(
            8,
            'وقال شيخ الإسلام ابن تيمية: (1)\n " وإن أحب أن يأتي الملتزم (2)- وهوما بين الحجر الأسود والباب فيضع عليه صدره ووجهه وذراعيه وكفيه ويدعو ويسأل الله تعالى حاجته - فعل ذلك . وله أن يفعل ذلك قبل طواف الوداع فإن هذا الالتزام لا فرق بين أن يكون حال الوداع اوغيره والصحابة كانوا يفعلون ذلك حين يدخلون مكة . . . ولووقف عند الباب ودعا هناك من غير التزام للبيت كان حسنا فإذا ولى لا يقف ولا يلتفت ولا يمشي القهقرى " \n أما الحائض فقد رخص لها في تركه إذا حان أوان مغادرتها مع رفقتها وقد طافت طواف الإفاضة \nعَنِ ابْنِ عَبَّاسٍ قَالَ رُخِّصَ لِلْحَائِضِ أَنْ تَنْفِرَ إِذَا حَاضَتْ .(3)\nعَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- ذَكَرَ صَفِيَّةَ بِنْتَ حُيَىٍّ فَقِيلَ إِنَّهَا قَدْ حَاضَتْ. فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « لَعَلَّهَا حَابِسَتُنَا ». فَقَالُوا يَا رَسُولَ اللَّهِ إِنَّهَا قَدْ أَفَاضَتْ. فَقَالَ « فَلاَ إِذًا ».(4)',
            '(1) في " منسكه " ( ص 387 )\n(2) طفت مع عبد الله فلما جئنا دبر الكعبة قلت ألا تتعوذ قال نعوذ بالله من النار ثم مضى حتى استلم الحجر وأقام بين الركن والباب فوضع صدره ووجهه وذراعيه وكفيه هكذا وبسطهما بسطا ثم قال هكذا رأيت رسول الله صلى الله عليه وسلم يفعله ) سنن أبي داود " 1899 " قال ( ضعيف )\nوفي الصحيحة ( 2138) حسنه الشيخ رحمه الله لعدة طرق وجدها للحديث .ولفظه (كان يضع صدره ووجهه وذراعيه وكفيه بين الركن والباب . يعني في الطواف)\nوفي الضعيفة تحت حديث (( 4865 ) قال الشيخ رحمه الله : وقد روي الالتزام من فعله صلى الله عليه وسلم من طرق يقوي بعضها بعضا ولذلك أوردته في صحيح الجامع الصغير برقم " 4888 " - وهو برقم " 5012 " الطبعة الثالثة بلفظ (كان يلزق صدره ووجهه بالملتزم )- وخرجته في الصحيحة 2138 وذكرت له شواهد موقوفة صحيحة عن جمع من الصحابة رضي الله عنه .\nوهو في سنن ابن ماجه برقم ( 2963 ) وحكم عليه بالحسن في الطبعة التي اعتنى بها الشيخ مشهور أل سلمان حفظه الله .\nو في مناسك الحج والعمرة ، قال : ( 38 - وله أن يلتزم ما بين الركن والباب فيضع صدره ووجهه وذراعيه عليه ( 3 ) ( 3 ) روي ذلك عن النبي صلى الله عليه وسلم من طريقين يرتقي الحديث بهما إلى مرتبة الحسن ويزداد قوة بثبوت العمل به عن جمع من الصحابة منهم ابن عباس رضي الله عنه وقال : " هذا الملتزم بين الركن والباب " وصح من فعل عروة بن الزبير أيضا وكل ذلك مخرج في " الأحاديث الصحيحة " ( 2138 )وهذا حديث ضعفه الشيخ رحمه الله ثم حسنه.\n(3) رواه البخاري وأبو داود \n(4) رواه مسلم',
            1,
            0)
      ]),


      ZikerResponse(41, 'إذا غادر منزله يودع الأهل والأحباب والأصحاب عند السفر', [
        HadithResponse(
            1,
            'عَنْ أَبِى هُرَيْرَةَ قَالَ : وَدَّعَنِى رَسُولُ اللَّهِ ﷺ فَقَالَ « أَسْتَوْدِعُكَ اللَّهَ الَّذِى لاَ تَضِيعُ وَدَائِعُهُ ».(1)',
            '(1) صحيح ابن ماجه : 2295',
            1,
            0)
      ]),
      ZikerResponse(42, 'ما يقوله الأهل والأقارب والمقيم للمسافر', [
        HadithResponse(
            1,
            '" أستودع الله دينكَ وأَمَانَتكَ وأخِر عَمَلِكَ" وفي رواية "وخَواتِيم عَمَلِك" .(1)',
            '(1) صحيح (صحيح الترمذي 3/155) وصحيح ابن ماجه والصحيحة ( 16 ) عن ابن عمر رضي الله عنهما.',
            1,
            0)
      ]),
      ZikerResponse(43, 'إذا خرج من المنزل', [
        HadithResponse(
            1,
            'مَنْ قَالَ - يَعْنِى إِذَا خَرَجَ مِنْ بَيْتِهِ - بِسْمِ اللَّهِ تَوَكَّلْتُ عَلَى اللَّهِ لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ. يُقَالُ لَهُ كُفِيتَ وَوُقِيتَ. وَتَنَحَّى عَنْهُ الشَّيْطَانُ (1)',
            '(1) صحيح ، صحيح أخرجه الترمذي وأبو داود و المشكاة ( 2443 التحقيق الثاني ) التعليق الرغيب (2 / 264) ، الكلم الطيب ( 58 / 49 )',
            1,
            0),
        HadithResponse(
            2,
            '"اللهُمَّ إِنِّي أعُوذُ بكَ أنْ أضِلَّ أوْ أُضَلَّ، أوْ أَزِلَّ أوْ أُزَلَّ، أوْ أَظْلِم أوْ أُظْلَم، أوْ أَجْهَلَ أوْ يَجْهَلَ عَلَيَّ" .(1)',
            '(1) صحيح (صحيح سنن أبي داود 3/959) و صحيح ابن ماجة ( 3884 ) عن ام سلمة رضي الله عنها قالت كان صلى الله عليه وسلم إذا خرج من بيته (رفع طرفه إلى السماء) فقال: اللهم إني أعوذ بك أن أضل أو أضل أو أزل أو أزل أو أظلم أو أظلم أو أجهل أو يجهل علي. الكلم الطيب (59) ط3. وفي ط:المعارف (60) قال الشيخ الألباني :: ((لكن رفع الطرف شاذ!))، وانظر الصحيحة (3163)، المشكاة (2442)، الهداية (2376).',
            1,
            0)
      ]),
      ZikerResponse(44, 'عند ركوب السيارة أو الطائرة أو الباخرة', [
        HadithResponse(
            1,
            'ـ إذا وضع رجله فيها قَالَ : بِسمِ الله .\nـ إذا ركب فيها قَالَ : الحَمْدُ لله.\nـ ثُمَّ قال : (سُبْحَان الَّذِي سخَّر لَنَا هَذَا وَمَا كُنَّا لَهُ مُقرِنين (1)وإنا إلىَ رَبِّنَا لَمُنْقَلِبُون (2)ـ ثُمَّ قال : الحَمْدُ لله، ثلاث مَرات .ـ ثُمَّ قَالَ: سُبْحَانَكَ إنّي ظَلَمْتُ نَفْسي ، فاغْفِرْ لي ، إنّه لا يَغْفِرُ الذُّنُوبَ إلاَّ أَنْتَ .(3)',
            '(1) [ مقرنين ] : مطيقين أي ما كنا نطيق قهره واستعماله لولا تسخير الله تعالى إياه لنا .\n(2) (الزخرف: 13ـ14) .\n(3) صحيح (صحيح الترمذي 3/156)',
            1,
            0)
      ]),
      ZikerResponse(45, 'دعاء السفر', [
        HadithResponse(
            1,
            '"الله أكبرُ، الله أكبَرُ، سُبْحَانَ الَّذِي سخَّر لَنَا هذا وما كُنَّا لَهُ مُقْرنين وإنَّا إلى رَبِّنا لَمُنْقَلِبُون. اللَّهُمَّ إنَّا نسألُكَ فِي سَفرِنا هذا البرَّ والتَّقوى ، ومِنَ العَمَل ما ترْضى، اللَّهُمَّ هَوِّن عَليْنا سَفَرنا هذا و اطو عنَّا بُعْدهُ، اللَّهُمَّ أَنْتَ الصَّاحِبُ في السَّفَر، والخليفةُ في الأهل، اللَّهُمَّ إنِّي أعُوذُ بك من وعْثاءِ السفر (1)، وكآبةِ (2) المنظر وسُوء الْمُنْقَلبِ (3)في المال والأهل" وإذا رجع قالهن وزاد فيهن "آيبون ، تائبُونَ، عابِدونَ ، لربِّنَا حامِدُون" .(4)',
            '(1) [ وعثاء السفر ] شدته ومشقته .\n(2) [ الكآبة ] تغير النفس والانكسار من الحزن والهم .\n(3) [ المنقلب ] المرجع ، ومعناه : أن يرجع من سفره فيجد أهله أصيبوا بمصيبة .\n(4) رواه مسلم',
            1,
            0)
      ]),
      ZikerResponse(46, 'التكبير عند الصعود والتسبيح عند الهبوط والنزول', [
        HadithResponse(
            1,
            '- عن جابر قال : "كنا إذا صعدنا كبّرنا ، وإذا نزلنا سَبّحْنا" .(1)',
            '(1) (البخاري ـ الفتح 6/135)',
            1,
            0),
        HadithResponse(
            2,
            '- عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ - رضى الله عنهما - أَنَّ رَسُولَ اللَّهِ - - كَانَ إِذَا قَفَلَ مِنْ غَزْوٍ أَوْ حَجٍّ أَوْ عُمْرَةٍ يُكَبِّرُ عَلَى كُلِّ شَرَفٍ مِنَ الأَرْضِ ثَلاَثَ تَكْبِيرَاتٍ ، ثُمَّ يَقُولُ « لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ ، لَهُ الْمُلْكُ ، وَلَهُ الْحَمْدُ ، وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ ، آيِبُونَ تَائِبُونَ عَابِدُونَ سَاجِدُونَ لِرَبِّنَا حَامِدُونَ ، صَدَقَ اللَّهُ وَعْدَهُ وَنَصَرَ عَبْدَهُ وَهَزَمَ الأَحْزَابَ وَحْدَهُ » .(1)',
            '(1) رواه البخاري',
            1,
            0),
        HadithResponse(
            3,
            '- وعن أبي هريرة : أن رجلاً قال : يا رسول الله إني أريد أن أسافر فأوصني، قال: "عليك بتقوى الله، والتكبيرِ على كلِّ شَرَفٍ ، فلما أن وَلَّى الرجلُ ، قال: اللَّهمَّ اطْوِ لَهُ البُعْدَ ، وهوِّن عليه السفرَ». (1)',
            '(1) صحيح الترمذي (رقم : 2740)',
            1,
            0)
      ]),
      ZikerResponse(47, 'عند سماع المؤذن', [
        HadithResponse(
            1,
            '- يقول مثل ما يقول المؤذن وعند قوله "حي على الصلاة، وحي على الفلاح" يقول: "لا حول ولا قوة إلا بالله" .(1) وعند أذان الفجر الثاني عندما يقول المؤذن "الصلاة خير من النوم ، تقول كما يقول المؤذن الصلاة خير من النوم"',
            '(1) متفق عليه',
            1,
            0)
      ]),
      ZikerResponse(48, 'أذكار بعد الأذان', [
        HadithResponse(
            1,
            '- منْ قالَ حين يَسْمَعُ النِّداء : "اللَّهُمَّ ربَّ هذه الدعوةِ التامَّةِ والصلاةِ القائمة آتِ مُحَمَّداً الوسيلة والفضيلةَ وابعثهُ مقاماً مَحْمُوداً الذي وَعَدْتَهُ، حَلَّت لَهُ شفاعتي يوم القيامة" (1)',
            '(1) (رواه البخاري 1/252)',
            1,
            0),
        HadithResponse(
            2,
            '- "يُصلي على النَّبي بَعْد فراغه مِنْ إجَابَةِ المُؤذِّنِ" .(1)',
            '(1) (مسلم 1/288)',
            1,
            0),
        HadithResponse(
            3,
            '- "من قال حين يسمع المؤذن :"أشهدُ (وفي رواية وأنا أشهد) أنْ لا إلهَ إلا الله، وحْدَهُ لا شَريكَ لَهُ، وأنَّ مُحَمَّداً عَبْدُهُ ورسولهُ، رضيتُ بالله ربّاً، وبِمُحمدٍ رسولاً وبالإسلامِ ديناً" غُفِرَ لَهُ ذَنْبُهُ" .(1)',
            '(1) (رواه مسلم 1/290)',
            1,
            0)
      ]),
      ZikerResponse(49, 'عند الذهاب إلى المسجد', [
        HadithResponse(
            1,
            '- اللَّهُمَّ اجْعَلْ في قَلْبي نوراً، وفي لساني نُوراً، واجْعَل في سَمعي نوراً ، واجْعَل في بَصرِي نوراً، واجْعَل من خلْفِي نُوراً، ومن أمامي نُوراً، واجْعَلْ مِنْ فَوقِي نَوراً ومِنْ تحتي نُوراً، اللَّهُمَّ أعْطِنِي نُوراً" .(1)',
            '(1) متفق عليه',
            1,
            0)
      ]),
      ZikerResponse(50, 'عند دخول المسجد', [
        HadithResponse(
            1,
            '- بسم الله [والصلاة] والسلامُ على رسُول ، اللَّهُمَّ اغفِر لي ذُنُوبِي" .(1)',
            '(1) صحيح (صحيح ابن ماجه 1/128) الزيادة لابن السني وحسنه الألباني',
            1,
            0),
        HadithResponse(2, '- اللَّهُمَّ افْتَحْ لي أبْوابَ رَحْمَتِك" .(1)',
            '(1) (رواه مسلم 1/494)', 1, 0),
        HadithResponse(
            3,
            '- أعُوذُ بالله العظيم وبِوَجْهِهِ الكريم وسُلْطَانِهِ القَديم مِنْ الشَيطانِ الرَّجِيم" (1)',
            '(1) صحيح (صحيح سنن أبي داود 1/93)',
            1,
            0)
      ]),
      ZikerResponse(51, 'بين الأذان والإقامة', [
        HadithResponse(
            1,
            '- عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ -- « لاَ يُرَدُّ الدُّعَاءُ بَيْنَ الأَذَانِ وَالإِقَامَةِ ».(1)',
            '(1) صحيح ، المشكاة ( 671 ) ، الإرواء ( 244 ) ، صحيح أبي داود ( 534 ) ابن ماجة ( 1163 )',
            1,
            0)
      ]),
      ZikerResponse(52, 'عند الخروج من المسجد', [
        HadithResponse(
            1,
            '- بسم الله [والصلاة] والسلامُ على رسُول الله، اللَّهُمّ اغفِر لي ذُنُوبي" .(1)',
            '(1) صحيح (صحيح ابن ماجه 1/128) الزيادة لابن السني وحسنه الألباني',
            1,
            0),
        HadithResponse(2, '- اللَّهُمَّ إِني أسألُك مِنْ فَضْلك"(1)',
            '(1) (رواه مسلم 1/994)', 1, 0),
        HadithResponse(3, '- اللَّهُمَّ اعصِمنِي من الشيطان الرجيم" .(1)',
            '(1) صحيح (صحيح ابن ماجه 1/129)', 1, 0)
      ]),
      ZikerResponse(53, 'إذا دخل وقت السحر(1) في السفر', [
        HadithResponse(
            1,
            'عَنْ أَبِى هُرَيْرَةَ أَنَّ النَّبِىَّ ﷺ كَانَ إِذَا كَانَ فِى سَفَرٍ وَأَسْحَرَ يَقُولُ « سَمَّعَ سَامِعٌ (2) بِحَمْدِ اللَّهِ وَحُسْنِ بَلاَئِهِ عَلَيْنَا رَبَّنَا صَاحِبْنَا وَأَفْضِلْ عَلَيْنَا (3) عَائِذًا بِاللَّهِ مِنَ النَّارِ ».(4)',
            '(1) آخر ساعة في الليل\n(2) أي شهد شاهد على حمدنا لله تعالى على نعمه وحسن بلائه\n(3) أحفظنا وحُطنا ، وأكلانا وأفضل علينا بجميل نعمك واصرف عنا كل مكروه\n(4) مسلم (4/2086)',
            1,
            0)
      ]),
      ZikerResponse(54, 'الذكر عند نزول استراحة أو المطار أو الميناء أو غيرها', [
        HadithResponse(
            1,
            'من نزل منزلاً ثم قال : "أعُوذُ بِكَلِماتِ الله التاماتِ من شرِّ ما خلق" لم يضره شيء حتى يرحل من منزله ذلك.(1)',
            '(1) (رواه مسلم 4/2080)',
            1,
            0)
      ]),
      ZikerResponse(55, 'من مستحبات السفر', [
        HadithResponse(
            1,
            'أثناء الطريق في السفر يستحب التجمع عند النزول للراحة\n'
                'عَنْ أَبُي ثَعْلَبَةَ الْخُشَنِىُّ قَالَ كَانَ النَّاسُ إِذَا نَزَلُوا مَنْزِلاً - قَالَ عَمْرٌو كَانَ النَّاسُ إِذَا نَزَلَ رَسُولُ اللَّهِ ﷺ مَنْزِلاً - تَفَرَّقُوا فِى الشِّعَابِ وَالأَوْدِيَةِ فَقَالَ رَسُولُ اللَّهِ ﷺ « إِنَّ تَفَرُّقَكُمْ فِى هَذِهِ الشِّعَابِ وَالأَوْدِيَةِ إِنَّمَا ذَلِكُمْ مِنَ الشَّيْطَانِ (1)». فَلَمْ يَنْزِلْ بَعْدَ ذَلِكَ مَنْزِلاً إِلاَّ انْضَمَّ بَعْضُهُمْ إِلَى بَعْضٍ حَتَّى يُقَالُ لَوْ بُسِطَ عَلَيْهِمْ ثَوْبٌ لَعَمَّهُمْ.(2) وفي زماننا يتأكد هذا خشية الضيعة لأحد الحجاج أو العمار وفقدان كثير من الوقت للبحث عن التائهين.',
            '(1) [ إنما ذلكم من الشيطان ] أي تفرقكم .\n(2) رواه أبو داود وهو صحيح',
            1,
            0,
            hasTitle: true)
      ]),
      ZikerResponse(56, 'التسليم(1) على من تمر عليهم من المسلمين والأخلاط(2)', [
        HadithResponse(
            1,
            '- عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو أَنَّ رَجُلاً سَأَلَ النَّبِىَّ - صلى الله عليه وسلم - أَىُّ الإِسْلاَمِ خَيْرٌ قَالَ « تُطْعِمُ الطَّعَامَ ، وَتَقْرَأُ السَّلاَمَ عَلَى مَنْ عَرَفْتَ ، وَعَلَى مَنْ لَمْ تَعْرِفْ » .(3)',
            '(1) أرى كثيرا من المسلمين لا سيما في الحرم في الطرقات والأروقة و درجات السلم وفي كل مكان يلقى احدهم اخاه وينظر إليه ولا يسلم عليه حتى انني أذكر مرة ألقيت السلام في الحرم على جمع فنظر لى بعضهم في دهش كأني أتيت بغريب ثم سرعان ما أفاق من الدهشة. والله المستعان' +
                '\n' +
                '(2) الجمع من الناس فيهم المسلم  وغيره وهذا يحدث في المطارات كثيرا' +
                '\n' +
                '(3) متفق عليه.',
            1,
            0),
        HadithResponse(
            2,
            '- عَنْ أَبِى هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « لاَ تَدْخُلُونَ الْجَنَّةَ حَتَّى تُؤْمِنُوا وَلاَ تُؤْمِنُوا حَتَّى تَحَابُّوا.أَوَلاَ أَدُلُّكُمْ عَلَى شَىْءٍ إِذَا فَعَلْتُمُوهُ تَحَابَبْتُمْ أَفْشُوا السَّلاَمَ بَيْنَكُمْ ».(3)',
            '(1) أرى كثيرا من المسلمين لا سيما في الحرم في الطرقات والأروقة و درجات السلم وفي كل مكان يلقى احدهم اخاه وينظر إليه ولا يسلم عليه حتى انني أذكر مرة ألقيت السلام في الحرم على جمع فنظر لى بعضهم في دهش كأني أتيت بغريب ثم سرعان ما أفاق من الدهشة. والله المستعان' +
                '\n' +
                '(2) الجمع من الناس فيهم المسلم  وغيره وهذا يحدث في المطارات كثيرا' +
                '\n'
                    '(3) رواه مسلم .',
            1,
            0),
        HadithResponse(
            3,
            '- وعن أبي هريرة أن النبي قال : " « خَمْسٌ تَجِبُ لِلْمُسْلِمِ عَلَى أَخِيهِ رَدُّ السَّلاَمِ وَتَشْمِيتُ الْعَاطِسِ وَإِجَابَةُ الدَّعْوَةِ وَعِيَادَةُ الْمَرِيضِ وَاتِّبَاعُ الْجَنَائِزِ ». " (3)',
            '(1) أرى كثيرا من المسلمين لا سيما في الحرم في الطرقات والأروقة و درجات السلم وفي كل مكان يلقى احدهم اخاه وينظر إليه ولا يسلم عليه حتى انني أذكر مرة ألقيت السلام في الحرم على جمع فنظر لى بعضهم في دهش كأني أتيت بغريب ثم سرعان ما أفاق من الدهشة. والله المستعان' +
                '\n' +
                '(2) الجمع من الناس فيهم المسلم  وغيره وهذا يحدث في المطارات كثيرا' +
                '\n'
                    '(3) متفق عليه .',
            1,
            0),
        HadithResponse(
            4,
            '- وعن أبي هريرة عن النبي أنه قال :«حَقُّ الْمُسْلِمِ عَلَى الْمُسْلِمِ سِتٌّ».\nقِيلَ مَا هُنَّ يَا رَسُولَ اللَّهِ قَالَ « إِذَا لَقِيتَهُ فَسَلِّمْ عَلَيْهِ وَإِذَا دَعَاكَ فَأَجِبْهُ وَإِذَا اسْتَنْصَحَكَ فَانْصَحْ لَهُ وَإِذَا عَطَسَ فَحَمِدَ اللَّهَ فَشَمِّتْهُ (3) وَإِذَا مَرِضَ فَعُدْهُ وَإِذَا مَاتَ فَاتَّبِعْهُ ».. (4)',
            '(1) أرى كثيرا من المسلمين لا سيما في الحرم في الطرقات والأروقة و درجات السلم وفي كل مكان يلقى احدهم اخاه وينظر إليه ولا يسلم عليه حتى انني أذكر مرة ألقيت السلام في الحرم على جمع فنظر لى بعضهم في دهش كأني أتيت بغريب ثم سرعان ما أفاق من الدهشة. والله المستعان' +
                '\n' +
                '(2) الجمع من الناس فيهم المسلم  وغيره وهذا يحدث في المطارات كثيرا' +
                '\n'
                    '(3) شمت : ادع له والتشميت الدعاء بالخير والبركة\n(4) رواه مسلم .',
            1,
            0),
        HadithResponse(
            5,
            'أرى كثيرا من المسلمين لا سيما في الحرم في الطرقات والأروقة و درجات السلم وفي كل مكان يلقى احدهم اخاه وينظر إليه ولا يسلم عليه حتى انني أذكر مرة ألقيت السلام في الحرم على جمع فنظر لى بعضهم في دهش كأني أتيت بغريب ثم سرعان ما أفاق من الدهشة. والله المستعان(3)',
            '(1) أرى كثيرا من المسلمين لا سيما في الحرم في الطرقات والأروقة و درجات السلم وفي كل مكان يلقى احدهم اخاه وينظر إليه ولا يسلم عليه حتى انني أذكر مرة ألقيت السلام في الحرم على جمع فنظر لى بعضهم في دهش كأني أتيت بغريب ثم سرعان ما أفاق من الدهشة. والله المستعان' +
                '\n' +
                '(2) الجمع من الناس فيهم المسلم  وغيره وهذا يحدث في المطارات كثيرا' +
                '\n'
                    '(3) الجمع من الناس فيهم المسلم وغيره وهذا يحدث في المطارات كثيرا',
            1,
            0)
      ]),
      ZikerResponse(57,'الذكر في مجلسك وانتظارك وانشغل بالتسبيح والتهليل والتكبير والحمد والاستغفار', [
            HadithResponse(
                1,
                '- قال : " مَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ ، لَهُ الْمُلْكُ ، وَلَهُ الْحَمْدُ ، وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ . فِى يَوْمٍ مِائَةَ مَرَّةٍ ، كَانَتْ لَهُ عَدْلَ عَشْرِ رِقَابٍ ، وَكُتِبَتْ لَهُ مِائَةُ حَسَنَةٍ ، وَمُحِيَتْ عَنْهُ مِائَةُ سَيِّئَةٍ ، وَكَانَتْ لَهُ حِرْزًا مِنَ الشَّيْطَانِ يَوْمَهُ ذَلِكَ حَتَّى يُمْسِىَ ، وَلَمْ يَأْتِ أَحَدٌ بِأَفْضَلَ مِمَّا جَاءَ بِهِ ، إِلاَّ أَحَدٌ عَمِلَ أَكْثَرَ مِنْ ذَلِكَ " .(1)',
                '(1) متفق عليه.',
                1,
                0),
            HadithResponse(
                2,
                '- قال رسول الله : " مَنْ قَالَ سُبْحَانَ اللَّهِ وَبِحَمْدِهِ . فِى يَوْمٍ مِائَةَ مَرَّةٍ حُطَّتْ خَطَايَاهُ ، وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ ".(1)',
                '(1) متفق عليه',
                1,
                0),
            HadithResponse(
                3,
                '- وقال رسول الله :( كَلِمَتَانِ خَفِيفَتَانِ عَلَى اللِّسَانِ ، ثَقِيلَتَانِ فِى الْمِيزَانِ ، حَبِيبَتَانِ إِلَى الرَّحْمَنِ ، سُبْحَانَ اللَّهِ الْعَظِيمِ ، سُبْحَانَ اللَّهِ وَبِحَمْدِهِ) (1)',
                '(1) متفق عليه عن أبي هريرة',
                1,
                0)
          ]),
      ZikerResponse(58, 'إذا كثر اللغط في مجلسك فقل دعاء كفارة المجلس', [
        HadithResponse(
            1,
            '- من جلس في مجلس فكثر فيه لغطه؟ فقال قبل أن يقوم من مجلسه ذلك: "سُبْحَانَكَ اللَّهُمَّ وبِحَمْدِكَ، أشْهَدُ أن لاَ إلَهَ إلاَّ أنْتَ أستغفِرُك وأتُوبُ إليك"، إلا غفر له ما كان في مجلسه ذلك"(1)',
            '(1) صحيح (صحيح الترمذي 3/153)',
            1,
            0)
      ]),
      ZikerResponse(59, 'تجنب الغضب وإذا استغضبت فقل', [
        HadithResponse(1, '- "أعُوذُ بالله منَ الشَّيْطانِ الرَّجيم"(1)',
            '(1) رواه مسلم 4/2015', 1, 0)
      ]),
      ZikerResponse(60, 'عند الكرب(1) تذكر هذا الذكر', [
        HadithResponse(
            1,
            '- "لا إلهَ إلا الله العظيمُ الحَليمُ، لا إله إلاَّ الله رَبُّ العَرشِ العظيم، لاَ إله إلا الله رَبُّ السمواتِ ورَبِّ الأرْضِ ورَبُّ العَرْشِ الكريم" .(2)',
            '(1) كضياع' +
                '\n'
                    '(2) متفق عليه',
            1,
            0)
      ]),
      ZikerResponse(61, 'عند ركوب السيارة أو الطائرة أو الباخرة', [
        HadithResponse(
            1,
            '- اذا وضع رجله فيها قَالَ : بِسمِ الله .ـ إذا ركب فيها قَالَ : الحَمْدُ لله.\n- ثُمَّ قال : (سُبْحَان الَّذِي سخَّر لَنَا هَذَا وَمَا كُنَّا لَهُ مُقرِنين وإنا إلىَ رَبِّنَا لَمُنْقَلِبُون (1) ثُمَّ قال : الحَمْدُ لله، ثلاث مَرات .ثُمَّ قَالَ: سُبْحَانَكَ إنّي ظَلَمْتُ نَفْسي ، فاغْفِرْ لي ، إنّه لا يَغْفِرُ الذُّنُوبَ إلاَّ أَنْتَ',
            '(1) . (الزخرف: 13ـ14) .',
            1,
            0)
      ]),
      ZikerResponse(62, 'أذكار الطعام', [
        HadithResponse(
            1,
            '- "إذا أكلَ أحدُكُمْ طعَاماً فليَقُلْ: بسم الله، فإن نسي في أولِهِ فليقُل: بسم الله في أولِهِ وآخِرِهِ" (1)',
            '(1) صحيح (صحيح الترمذي 2/167)',
            1,
            0),
        HadithResponse(
            2,
            '- "منْ أطعَمَهُ الله الطعام فليَقُلْ : "اللهُمَّ بَارِكْ لنا فِيهِ وأطْعِمْنَا خَيْراً مِنْهُ". ومن سقاهُ الله لبناً فليَقُلْ : "اللهُمَّ بارك لنا فيه وزدنا منه" .(1)',
            '(1) حسن (صحيح الترمذي 3/159)',
            1,
            0)
      ]),
      ZikerResponse(63, 'عند الفراغ من الطعام', [
        HadithResponse(
            1,
            '- "مَنْ أكَلَ طعاماً ثم قال : الحَمْدُ لله الذي أطْعَمني هذا الطعامَ ورَزقنيهِ مِنْ غَير حوْلٍ منِّي ولا قُوة غُفِر لهُ ما تقدم من ذَنبه" .(1)',
            '(1) حسن (صحيح سنن أبي داود 2/760)',
            1,
            0),
        HadithResponse(
            2,
            '- "الحمدُ لله الذي أطَعمَ وسَقَى وسَوَّغَهُ وجَعَل لهُ مَخْرَجاً" .(1)',
            '(1) صحيح (صحيح سنن أبي داود 2/730)',
            1,
            0),
        HadithResponse(
            3,
            '- "الحمدُ لله كثيراً طيباً (1) مباركاً فيهِ، غيْرَ مَكْفيٍ (2) ، ولا مُوَدَع (3) ، ولا مُستَغنَى (4) عَنْهُ رَبَّنا" . (5)',
            '(1) ( طيبا ) خالصا\n(2) ( غير مكفي ) أي ما أكلناه ليس كافيا عما بعده بل نعمك مستمرة علينا غير منقطعة طول أعمارنا .\n(3) ( ولا مودع ) من الوداع أي ليس آخر طعامنا\n(4) لا يستغني عنه أحد .\n(5) (روه البخاري ـ الفتح 7/148)',
            1,
            0),
        HadithResponse(
            4,
            '- "اللهم أطعمت وأسقيت وأقنيت (1) وهديت وأحييت ، فلك الحمد على ما أعطيت" . (2)',
            '(1) أي مَلّكت المال وغيره .\n(2) رواه أحمد وصححه الألباني "الصحيحة رقم17"',
            1,
            0)
      ]),
      ZikerResponse(64, 'الوصول إلى ارض المطار أو الميناء ورؤية ما يسره(2) أو يكرهه(1)', [
        HadithResponse(
            1,
            '- "كان إذا أتاه أمر يسره قال : "الحَمْدُ لله الَّذِي بِنِعْمَتِهِ تتمُّ الصَّالِحَاتُ"، وإذا أتاه أمر يكرهُهُ قال : "الحَمْدُ لله عَلَى كُلِّ حالٍ" .(3)',
            '(1) من مناظر الحجاج والعمار مثلا وكثرة المسلمين وعزتهم.' +
                '\n'
                    '(2) من المناظر التى عليها بعض الوفود غير مسلمة ونحوه.' +
                '\n'
                    '(3) صحيح (صحيح الجامع 4/201)',
            1,
            0),
        HadithResponse(
            2,
            '- "كان النبي ﷺ إذا أتاه أمر يَسُرُّه أو يُسَرُّ به خرَّ ساجداً شكراً لله تبارك وتعالى".(1)"سبحان الله". (2) "الله أكبر" . (2) عند التعجب أو السرور',
            '(1) حسن (صحيح ابن ماجه 1/233)\n(2) متفق عليه',
            1,
            0)
      ]),
      ZikerResponse(65, 'كيفية الصلاة على الميت', [
        HadithResponse(
            1,
            '1 - يصلى على الميت المسلم صغيرا كان أم كبيرا ذكرا أم أنثى .\n2 - يصلى على الحمل إذا سقط وقد بلغ أربعة أشهر ويفعل به كما يفعل بالكبير فيغسل ويكفن قبل الصلاة عليه.\n3 - لا يصلى على الحمل إذا سقط قبل تمام أربعة أشهر لأنه لم تنفخ فيه الروح ، ولا يغسل ولا يكفن وإنما يدفن في أي مكان .\n4 - يقف الإمام في الصلاة على الميت عند رأس الرجل ووسط المرأة ويصلي الناس وراءه(1)\n5 - يكبر في الصلاة على الميت أربع تكبيرات(2) يقرأ في التكبيرة الأولى بعد التعوذ والبسملة سورة الفاتحة ويصلى على النبي ، صلى الله عليه وسلم بعد التكبيرة الثانية فيقول : اللهم صل على محمد وعلى آل محمد كما صليت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد . وبارك على محمد وعلى آل محمد كما باركت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد .\nويدعو للميت بعد التكبيرة الثالثة والأفضل أن يدعو بما ورد عن النبي ، ، في ذلك وإن لم يعرفه دعا بما يعرف . ويقف بعد الرابعة قليلا ثم يسلم ، وإن قال قبل السلام : ربنا آتنا في الدنيا حسنة وفي الآخرة حسنة وقنا عذاب النار فلا بأس بذلك .',
            '(1) من الأحكام الفقهية في الطهارة والصلاة والجنائز- الشيخ العثيمين رحمه الله تعالى\nومن أراد مزيد بسط فليراجع كتاب الجنائز في الكتب الفقهية\n(2) أو خمس أو ست أو ثماني أوتسع تكبيرات كما ورد « إِنَّمَا جُعِلَ الإِمَامُ لِيُؤْتَمَّ بِهِ ، فَإِذَا كَبَّرَ فَكَبِّرُوا ....الحديث » . متفق عليه عن أنس وقال ابن مسعود: انظروا جنائزكم فكبروا عليها ما كبر أئمتكم، لا وقت ولا عدد ".أخرجه ابن حزم في " المحلى " (5، 126) بهذا التمام، وقال: " وهذا إسناد غاية في الصحة ".راجع أحكام الجنائزللألباني رحمه الله ص:112',
            1,
            0)
      ]),
      ZikerResponse(66, 'الدعاء للميت والصلاة عليه', [
        HadithResponse(
            1,
            '- "اللَّهُمَّ اغْفِرْ لَهُ وارحمْهُ وعافِهِ واعفُ عنه وأكرم نُزُله ووسِّع مُدْخَله، واغسله بالماء والثلجِ والبرد، ونَقِّه من الخطايا كما نقَّيْتَ الثوبَ الأبيض من الدّنَس،\nوأبدِلْهُ داراً خيراً من دارِهِ، وأهلاً خيراً من أهله وزوجاً خيراً من زوجه وأدْخِلهُ الجنَّة وأعِذه من عذاب القبرِ (ومن عذاب النَّار)"(1)',
            '(1) (رواه مسلم 2/663)',
            1,
            0),
        HadithResponse(
            2,
            '- "اللَّهُمَّ إن فُلانَ بن فَلان في ذِمَّتِك، وحبْلِ جِوارِكَ، فَقِهِ من فتنة القبر وعذاب النَّار، وأنت أهلُ الوفاءِ والحقِّ ، فاغفِرْ لَهُ وارحمْهُ إنَّك أنتَ الغفورُ الرَّحيم" .(1)',
            '(1) صحيح (صحيح ابن ماجه 1/251)',
            1,
            0),
        HadithResponse(
            3,
            'وإن كان الميت صبيّاً : "اللَّهُمَّ أعِذه من عذاب القبر" (1).',
            '(1) حسن (أحكام الجنائز للألباني ص 161)',
            1,
            0),
        HadithResponse(4, '- ( اللَّهُمَّ اجعله فرطاً وسلفاً، وأجراً ).(1)',
            '(1) البخاري تعليقاً- موقوف على الحسن', 1, 0)
      ]),
      ZikerResponse(67, 'عند إدخال الميت القبر', [
        HadithResponse(
            1,
            '- "بِسْمِ الله وبِالله، وَعَلَى مِلَّةِ رَسُولِ الله (أو على سُنَّة رسول الله).(1)',
            '(1) صحيح (صحيح الترمذي 1/306)',
            1,
            0)
      ]),
      ZikerResponse(68, 'ما يقال عند الدفن', [
        HadithResponse(
            1,
            '- "كان النبي ﷺ (إذا فرغ من دفن الميت وَقَفَ عليه فقال: استغْفِرُوا لأخيكم وسلوا له التثبيتَ فإنهُ الآن يُسأل ).(1)',
            '(1) صحيح (صحيح سنن أبي داود 2/620)',
            1,
            0)
      ]),
      ZikerResponse(69, 'دعاء التعزية', [
        HadithResponse(
            1,
            '"إن لله ما أخَذَ ولَهُ ما أعْطَى، وكُلُّ شيءٍ عِنْدَهُ بِأجلٍ مُسمى.. فلتصبر ولتحتسب".(1)',
            '(1) متفق عليه .',
            1,
            0),
        HadithResponse(
            2,
            '-تنبيه:-\nهناك بعض الأحاديث المروية ولا تثبت عن رسول الله ومنها:\n(( مَن حَجَّ ولَم يَزُرْنِي فقد جَفانِي ))\n(( مَن زارني بعد مَمَاتي فكأنَّمَا زارَني في حياتي ))\n(( مَن زارني وزارَ أبي إبراهيم في عامٍ واحد ضَمِنْتُ له على الله الجَنَّةَ ))\n(( مَن زار قَبري وَجَبتْ له شفاعَتِي ))\nوهذه الأحاديث موضوعةٌ أو ضعيفةٌ جدًّا كما نَبَّه على ذلك الحفاظُ كالدارقطني والعُقيلي والبيهقي وابن تيمية وابن حجر رحمهم الله تعالى.',
            '',
            1,
            0)
      ]),
      ZikerResponse(70, 'عند الذهاب إلى المسجد', [
        HadithResponse(
            1,
            '- "اللَّهُمَّ اجْعَلْ في قَلْبي نوراً، وفي لساني نُوراً، واجْعَل في سَمعي نوراً ، واجْعَل في بَصرِي نوراً، واجْعَل من خلْفِي نُوراً، ومن أمامي نُوراً، واجْعَلْ مِنْ فَوقِي نَوراً ومِنْ تحتي نُوراً، اللَّهُمَّ أعْطِنِي نُوراً" .(1)',
            '(2) متفق عليه',
            1,
            0),
        HadithResponse(
            1,
            '- "فيسن تقديم الرجل اليمنى عند الدخول(1)',
            '(1) مر معنا عند الذكر رقم عشرة والتكرار لمراعاة ترتيب أعمال الحاج أو المعتمر',
            1,
            0),
        HadithResponse(
            2,
            '- "بسم الله [والصلاة] والسلامُ على رسُول ، اللَّهُمَّ اغفِر لي ذُنُوبِي" .(1)',
            '(1) صحيح (صحيح ابن ماجه 1/128) الزيادة لابن السني وحسنه الألباني',
            1,
            0),
        HadithResponse(3, '- "اللَّهُمَّ افْتَحْ لي أبْوابَ رَحْمَتِك" .(1)',
            '(1) رواه مسلم 1/494', 1, 0),
        HadithResponse(
            4,
            '- "أعُوذُ بالله العظيم وبِوَجْهِهِ الكريم وسُلْطَانِهِ القَديم مِنْ الشَيطانِ الرَّجِيم" (1)',
            '(1) صحيح (صحيح سنن أبي داود 1/93)',
            1,
            0),
        HadithResponse(
            5,
            'ثم يصلي الصلاة المفروضة' +
                '\n'
                    'عَنِ الْوَلِيدِ بْنِ الْعَيْزَارِ أَنَّهُ سَمِعَ أَبَا عَمْرٍو الشَّيْبَانِىَّ قَالَ حَدَّثَنِى صَاحِبُ هَذِهِ الدَّارِ - وَأَشَارَ إِلَى دَارِ عَبْدِ اللَّهِ - قَالَ سَأَلْتُ رَسُولَ اللَّهِ -صلى الله عليه وسلم- أَىُّ الأَعْمَالِ أَحَبُّ إِلَى اللَّهِ قَالَ « الصَّلاَةُ عَلَى وَقْتِهَا ». قُلْتُ ثُمَّ أَىٌّ قَالَ « ثُمَّ بِرُّ الْوَالِدَيْنِ ». قُلْتُ ثُمَّ أَىٌّ قَالَ « ثُمَّ الْجِهَادُ فِى سَبِيلِ اللَّهِ » قَالَ حَدَّثَنِى بِهِنَّ وَلَوِ اسْتَزَدْتُهُ لَزَادَنِى.(1)',
            '(1) متفق عليه',
            1,
            0,
            hasTitle: true),
      ]),
      ZikerResponse(71, 'الذكر بعد السلام من الوتر', [
        HadithResponse(
            1,
            '- "سبحان الملك القدوس ، ثلاث مرات متتالية، يجهر بها ويمد بها صوته"، ويقول في الثالثة رب الملائكة والروح(1)',
            '(2) رواه النسائي والدارقطني وما بين المعكوفتين للدارقطني، انظر قيام رمضان للألباني',
            1,
            0),
        HadithResponse(
            2,
            'فقد كان النبي ﷺ يوتر على راحلته فعَنِ ابْنِ عُمَرَ قَالَ كَانَ النَّبِىُّ ﷺ يُصَلِّى فِى السَّفَرِ عَلَى رَاحِلَتِهِ ، حَيْثُ تَوَجَّهَتْ بِهِ ، يُومِئُ إِيمَاءً ، صَلاَةَ اللَّيْلِ إِلاَّ الْفَرَائِضَ ، وَيُوتِرُ عَلَى رَاحِلَتِهِ .',
            'متفق عليه',
            1,
            0)
      ]),
      ZikerResponse(72, 'استحباب تعجيل الرجوع من السفر', [
        HadithResponse(
            1,
            'قَالَ ﷺ: « السَّفَرُ قِطْعَةٌ مِنَ الْعَذَابِ ، يَمْنَعُ أَحَدَكُمْ طَعَامَهُ وَشَرَابَهُ وَنَوْمَهُ ، فَإِذَا قَضَى نَهْمَتَهُ (1) فَلْيُعَجِّلْ إِلَى أَهْلِهِ »(2) \nوالمقصود في هذا الحديث استحباب تعجيل الرجوع إلى الأهل بعد قضاء شغله ولا يتأخر بما ليس له بمهم.',
            '(1) [ نهمته ] أي الحاجة .\n(2) متفق عليه عَنْ أَبِى هُرَيْرَةَ',
            1,
            0)
      ]),
      ZikerResponse(73, 'يستحب أن يقول الدعاء الوارد إذا نزل منزلاً', [
        HadithResponse(
            1,
            'عن خولة بنت حكيم قالت : قال رسول الله ﷺ: « مَنْ نَزَلَ مَنْزِلاً ثُمَّ قَالَ أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ. لَمْ يَضُرُّهُ شَىْءٌ حَتَّى يَرْتَحِلَ مِنْ مَنْزِلِهِ ذَلِكَ ».(1)',
            '(1) رواه مسلم',
            1,
            0)
      ]),
      ZikerResponse(74, 'إستحباب الدعاء في السفر لاسيما وأنت في سفر طاعة', [
        HadithResponse(
            1,
            'عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ:"ثَلاثُ دَعَوَاتٍ مُسْتَجَابَاتٌ لا شَكَّ فِيهِنَّ: دَعْوَةُ الْمَظْلُومِ، وَدَعْوَةُ الْوَالِدِ عَلَى وَلَدِهِ، وَدَعْوَةُ الْمُسَافِرِ".(1)',
            '(1) رواه أبو داود والترمذي والنسائي وهو حسن أنظر السلسلة الصحيحة رقم 596',
            1,
            0)
      ]),
      ZikerResponse(75, 'النهي عن الطروق ليلاً', [
        HadithResponse(
            1,
            'عَنْ أَنَسٍ ﷺ قَالَ : ( كَانَ النَّبِىُّ ﷺ لاَ يَطْرُقُ (1) أَهْلَهُ ، كَانَ لاَ يَدْخُلُ إِلاَّ غُدْوَةً (2) أَوْ عَشِيَّةً (3). (4) عَنِ الشَّعْبِىِّ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ قَالَ رَسُولُ اللَّهِ ﷺ: « إِذَا أَطَالَ أَحَدُكُمُ الْغَيْبَةَ فَلاَ يَطْرُقْ أَهْلَهُ لَيْلاً » (5) والسبب في ذلك يبينه قوله ﷺ « إِذَا دَخَلْتَ لَيْلاً فَلاَ تَدْخُلْ عَلَى أَهْلِكَ حَتَّى تَسْتَحِدَّ (6) الْمُغِيبَةُ (7) وَتَمْتَشِطَ الشَّعِثَةُ (8) »(9)',
            '(1) ( لا يطرق أهله ) من الطروق وهو الإتيان بالليل يعني أنه لا يدخل على أهله ليلا إذا قدم من سفر .\n(2) ( غدوة ) من صلاة الفجر إلى طلوع الشمس .\n(3) ( عشية ) من زوال الشمس إلى غروبها ويطلق أيضا على ما بعد الغروب إلى العتمة والمراد هنا الأول\n(4) متفق عليه\n(5) متفق عليه\n(6) ( تستحد ) تستعمل الحديدة في إزالة شعر الإبط والعانة ونحو ذلك .\n(7) ( المغيبة ) المرأة التي غاب عنها زوجها \n(8) ( الشعثة ) غير المتزينة وهي منتشرة الشعر مغبرة الرأس .\n(9) متفق عليه',
            1,
            0)
      ]),
      ZikerResponse(76, 'دعاء ما يقوله إذا رجع ورأى بلدته', [
        HadithResponse(
            1,
            'قَالَ أَنَسُ بْنُ مَالِكٍ أَقْبَلْنَا مَعَ النَّبِىِّ ﷺ أَنَا وَأَبُو طَلْحَةَ. وَصَفِيَّةُ رَدِيفَتُهُ عَلَى نَاقَتِهِ حَتَّى إِذَا كُنَّا بِظَهْرِ الْمَدِينَةِ قَالَ « آيِبُونَ تَائِبُونَ عَابِدُونَ لِرَبِّنَا حَامِدُونَ ». فَلَمْ يَزَلْ يَقُولُ ذَلِكَ حَتَّى قَدِمْنَا الْمَدِينَةَ.(1)',
            '(1) رواه البخاري',
            1,
            0),
        HadithResponse(
            2,
            'وعن ابن عُمَرَ عَلَّمَهُمْ أَنَّ رَسُولَ اللَّهِ ﷺ كَانَ إِذَا اسْتَوَى عَلَى بَعِيرِهِ خَارِجًا إِلَى سَفَرٍ كَبَّرَ ثَلاَثًا ثُمَّ قَالَ « سُبْحَانَ الَّذِى سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ اللَّهُمَّ إِنَّا نَسْأَلُكَ فِى سَفَرِنَا هَذَا الْبِرَّ وَالتَّقْوَى وَمِنَ الْعَمَلِ مَا تَرْضَى اللَّهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هَذَا وَاطْوِ عَنَّا بُعْدَهُ اللَّهُمَّ أَنْتَ الصَّاحِبُ فِى السَّفَرِ وَالْخَلِيفَةُ فِى الأَهْلِ اللَّهُمَّ إِنِّى أَعُوذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ وَكَآبَةِ الْمَنْظَرِ وَسُوءِ الْمُنْقَلَبِ فِى الْمَالِ وَالأَهْلِ ». وَإِذَا رَجَعَ قَالَهُنَّ. وَزَادَ فِيهِنَّ « آيِبُونَ تَائِبُونَ عَابِدُونَ لِرَبِّنَا حَامِدُونَ ».(1)',
            '(1) رواه البخاري وأبو داود',
            1,
            0)
      ]),
      ZikerResponse(77, 'استحباب ابتداء القادم من السفر بالمسجد', [
        HadithResponse(
            1,
            'عن كعب بن مالك ﷺ ( أن رسول الله ﷺ كَانَ إِذَا قَدِمَ مِنْ سَفَرٍ بَدَأَ بِالْمَسْجِدِ فَيَرْكَعُ فِيهِ رَكْعَتَيْنِ ثُمَّ جَلَسَ لِلنَّاسِ ) .(1)\nقال الشيخ محمد بن عثيمين رحمه الله : ( وما أظن أحداً من الناس إلا قليلاً يستعمل هذه السنة ، وهذا لجهل الناس بهذا ، وإلا فهذا سهل والحمد لله ، وسواء صليت في مسجدك الذي كنت تصلي فيه القريب من بيتك ، أو صليت في أدنى مسجد من مساجد البلد الذي أنت فيه ) .',
            '(1) إفادة من أخينا سليمان بن محمد اللهيميد – حفظه الله وذكرت ذلك في المراجع في آخر الرسالة',
            1,
            0)
      ]),
      ZikerResponse(78, 'المعانقة عند الرجوع من السفر', [
        HadithResponse(
            1,
            'عن أنس قال : (كان أصحاب النبي صلى الله عليه وسلم إذا تلاقوا تصافحوا وإذا قدموا من سفر تعانقوا ) (1)',
            '(1) رواه الطبراني وخرجه الشيخ في الصحيحة برقم 2647',
            1,
            0)
      ]),

    ];

    return Future.value(listOfZikerModel);
  }

  Future<List<ZikerResponse>> getZikerListWithoutPrayHaijOmra() async {
    final listOfZikerModel = (await _getZikerList())
        .where((e) => azkarIndexList.contains(e.id))
        .toList();

    return Future.value(listOfZikerModel);
  }

  Future<List<ZikerResponse>> getPrayZikerList() async {
    final listOfZikerModel = (await _getZikerList())
        .where((e) => prayIndexList.contains(e.id))
        .toList();

    return Future.value(listOfZikerModel);
  }

  Future<List<ZikerResponse>> getHaijZikerList() async {
    final listOfZikerModel = (await _getZikerList())
        .where((e) => haijIndexList.contains(e.id))
        .toList();

    return Future.value(listOfZikerModel);
  }

  Future<List<ZikerResponse>> getOmraZikerList() async {
    final listOfZikerModel = (await _getZikerList())
        .where((e) => omraIndexList.contains(e.id))
        .toList();

    return Future.value(listOfZikerModel);
  }
}
